{-# OPTIONS --safe #-}
module Iliagda.Examples where

open import Iliagda.Init
open import Iliagda.Morphology
open import Iliagda.Prosody
open import Iliagda.Prosody.Synizesis
open import Iliagda.Prosody.Rules
open import Iliagda.Prosody.Rules.Dec
open import Iliagda.Verses
open import Iliagda.Show

dss : List ∃Derivations
dss = map (λ (_ , v) → -, -, allDerivations v) verses

showMqs : Words n × Quantities n → String
showMqs (ws , mqs) = padded (toList $ unwords ws) (toList mqs)

checkVerse : Verse {n} → String
checkVerse v@ws =
  let
    mqs2 , _ , _ = 𝟚-theQuantities ws
    mqs3 , _ , _ = 𝟛-theQuantities ws

    -- `ws = show ws
    -- ns = map Str.length (Str.words `ws)
    -- `mqs2 = map show (toList mqs2)
    -- `mqs3 = map show (toList mqs3)
  in
    showMqs (ws , mqs2) ◇ "\n\n" ◇
    showMqs (ws , mqs3) ◇ "\n\n" ◇
    showMqs (ws , mqs2 ⊗ mqs3)

    -- show ws ◇ "\n"
    -- ◇ spaces (map (uncurry pad) $ L.zip `mqs2 ns) ◇ " --𝟚 \n"
    -- ◇ spaces (map (uncurry pad) $ L.zip `mqs3 ns) ◇ " --𝟛 \n"

{- *** Why not 4-valued logic? ***

？ : {}
* : {·,─}

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε ω Ἀ χι ƛῆ ος
*  *   * *  *  *  * *  *  * * *  * * *  *  *

-1-
─  *   * *  *  *  * ─  *  * * *  ─ * *  *  *
-2-
─  ·   * ─  ─  ·  * ─  ─  * * ·  ─ * *  *  ·
*  ·   * *  *  *  * ─  *  * * *  * * *  *  *


-1-
─  *   * *  *  *  * ─  *  * * *  ─ * *  *  *
-3-
*  *   * *  *  *  * *  *  * * *  * * *  *  *
*  *   * *  *  ─  * *  *  * * *  * ─ *  *  *
*  *   * *  *  ─  * *  *  * * *  f * *  *  *

f ∉ {id , const · , const ─}

f = λ where
  ─ → ·
  · → ?
  * → *

─  *   * *  *  *  * ─  *  * * *  * ─ *  *  *
=
{⋯
─  *   * *  *  *  * ─  *  * * *  * ─ *  *  * ,
⋯}

─  *   * *  *  *  * *  *  * * *  * ─ *  *  *
=
{⋯
─  *   * *  *  *  * ─  *  * * *  * ─ *  *  * ,
─  *   * *  *  *  * ·  *  * * *  * ─ *  *  * ,
⋯}

𝟚: {⋯ xs ⋯}
𝟛: {⋯ ys ⋯}

𝟚𝟛: {⋯ xs ⋯} ∪ {⋯ ys ⋯}
𝟚𝟛: {⋯ xs ⋯} ∩ {⋯ ys ⋯}
𝟚𝟛: {⋯ xs ⋯} ⊗ {⋯ ys ⋯}
   ?

f𝟚𝟛 : Meter → Bool
f𝟚𝟛 m
  with f𝟚 m | f𝟛 m
... false | false = false
... false | true  = false
... true  | false = false
... true  | true  = true

─  ·   * ─  ─  *  * *  *  * * *  * ─ *  *  *

*  *   * ─  *  *  * *  *  * * *  * ─ *  *  *

─  ·   * ─  ×


─  *   * *  *  *  * ─  *  * * *  * ─ *  *  *
-4-
─  *   * *  *  *  * ─  *  * * *  * ─ *  *  *
                                 ↑
-}

{- ** Interactively showing all derivations of given verses **

-- [C-u C-u C-c C-n] dss

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ·  · ─  ─

***************

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ─  ─   · · ─  ·   · ─ ─

***************

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δἐ τε ƛεί ε το βου ƛή
─  ─ ─   ·  ·  ─  ·  ·  ─  ·  ·  ─   · ·  ─   ─

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─

***************

τίς τἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
─   ─   ─   · ·  ─  · ·  ─  ·  ·  ─ ·  ·  ─  ─

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ·  ·  ─  ·  · ─   ·  ·  ─  · ·  ─  ─

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
─   ·   · ─  ·    ·   ─  ·  ·  ─   · ·  ─  ·   ·  ─  ─

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
─  ·  ·  ─   ─   ─   ─ ─  ·  ·   ─ ─  ─  ─

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

***************



***************

-}


{- ** NEW **

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε ω Ἀ χι ƛῆ ος
∅

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ·  · ─  ─

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ─    ─  ─

***************

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   · · ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   ─   ─  ·   · ─ ─

***************

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δ᾽ἐ τε ƛεί ε το βου ƛή
∅

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

***************

τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
∅

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
∅

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
∅

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
∅

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
∅

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τ᾽ἀ πε ρεί σι᾽ ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·   ·  ─   ·   · ─   ─

***************

στέμ ματ᾽ ἔ χων ἐν χερ σὶν ἑ κη βό ƛου Ἀ πόƛ ƛω νος
─    ·    · ─   ─  ─   ·   · ─  ·  ·   ─ ─   ─  ─

***************

χρυ σέ ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι ούς
∅

{- *** NEW NEW
μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─ ─ ·    · ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  ?   ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  ─   ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·    ─ ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─


***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? *   ?   ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? *   ─   ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? *   ?   ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? *   ─   ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ─    ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─       ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─       ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? ?       ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? ─       ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί⁀Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ─    ─   ─   ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ─    ─   ─   ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?    *   ?   ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ─    *   ─   ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─    ─   ─   ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─       ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─       ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? ?       ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? ─       ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ─    ─  ─


οὐ ƛο μέ νην ἣ μυ ρί⁀Ἀ χαι οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ─    ─   ─   ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ─    ─   ─   ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?    *   ?   ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ─    *   ─   ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─    ─   ─   ─  ─    ─  ─


***************

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   · · ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ─     ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   · · ─  ─     ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ─   ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ─   ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ?   ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ─   ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   ─   ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ─   ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ─   ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ?   ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ─   ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   ─   ─  ─     ─ ─


***************

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ·  ─   ─


***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δ᾽ἐ τε ƛεί ε το βου ƛή
─  ─ ─   ?  ·  ─  ?  ?  ·  ·   ·  ─   · ·  ─   ─  --𝟙
─  ─ ─   ?  ·  ─  ·  ?  ·  ·   ·  ─   · ·  ─   ─  --𝟚
*  ? ?   ?  ?  ?  ?  ?  ─  ?   ?  *   ? ?  ?   ?  --𝟛
*  ─ ─   ?  ·  ─  ·  ?  ─  ·   ·  *   · ·  ─   ─  --𝟚⊗3
─  ─ ─   ·  ·  ─  ·  ·  ─  ·   ·  ─   · ·  ─   ─


***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
·  ─  ─  ?  ─   ?  ?  ? ─   ─   · ?  ?  ·   --𝟙
·  ─  ─  ?  ─   ·  ?  ? ─   ─   · ?  ?  ·   --𝟚
─  ?  ?  ─  ?   ?  ?  ─ ?   ?   ? ?  ─  ?   --𝟛
─  ─  ─  ─  ─   ·  ?  ─ ─   ─   · ?  ─  ·   --𝟚⊗3
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─


***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ·   ? ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ·   ? ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?   ? ─   ?  ? ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ·   ? ─   ·  ? ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ·   · ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ·   ? ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ·   ? ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?   ? ─   ?  ? ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ·   ? ─   ·  ? ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ·   · ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ·   ? ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ·   ? ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?   ? ─   ?    ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ·   ? ─   ─    ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ·   · ─   ─    ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ─     ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ─     ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?     ─   ?  ? ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ─     ─   ·  ? ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ─     ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ·   ? ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ·   ? ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?   ? ─   ?    ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ·   ? ─   ─    ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ·   · ─   ─    ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ─     ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ─     ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?     ─   ?  ? ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ─     ─   ·  ? ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ─     ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ─     ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ─     ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?     ─   ?    ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ─     ─   ─    ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ─     ─   ─    ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ─     ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ─     ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?     ─   ?    ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ─     ─   ─    ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ─     ─   ─    ─   ─  ─    ─   ─     ─ ─   ─


***************

τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
?   ?    ─   · ·  ─  · ?  ?  ?  ·  ─ ·  ?  ·  ─    --𝟙
?   ?    ─   · ·  ─  · ?  ·  ?  ·  ─ ·  ?  ·  ─    --𝟚
─   ─    *   ? ?  ?  ? ?  ─  ?  ?  ? ?  ?  ─  ?    --𝟛
─   ─    *   · ·  ─  · ?  ─  ?  ·  ─ ·  ?  ─  ─    --𝟚⊗3
─   ─    ─   · ·  ─  · ·  ─  ·  ·  ─ ·  ·  ─  ─


τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ⁀η κε μά χε σθαι
?   ?    ─   · ·  ─  · ?  ?  ?  ─    ·  ?  ·  ─    --𝟙
?   ?    ─   · ·  ─  · ?  ·  ?  ─    ·  ?  ·  ─    --𝟚
─   ─    *   ? ?  ?  ? ?  ─  ?  ?    ?  ?  ─  ?    --𝟛
─   ─    *   · ·  ─  · ?  ─  ?  ─    ·  ?  ─  ─    --𝟚⊗3
─   ─    ─   · ·  ─  · ·  ─  ─  ─    ·  ·  ─  ─


***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ?  ·  ─  ·  · ?   ?  ?  ─  ? ·  ─  ─    --𝟙
─  ─    ─   ?  ·  ─  ·  · ?   ?  ?  ─  · ·  ─  ─    --𝟚
?  ─    ?   ?  ?  *  ?  ? ─   ?  ?  *  ? ?  ?  ?    --𝟛
─  ─    ─   ?  ·  *  ·  · ─   ?  ?  *  · ·  ─  ─    --𝟚⊗3
─  ─    ─   ·  ·  ─  ·  · ─   ·  ·  ─  · ·  ─  ─


Λη τοῦς καὶ Δι⁀ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ─     ─  ·  · ?   ?  ?  ─  ? ·  ─  ─    --𝟙
─  ─    ─   ─     ─  ·  · ?   ?  ?  ─  · ·  ─  ─    --𝟚
?  ─    ?   ?     *  ?  ? ─   ?  ?  *  ? ?  ?  ?    --𝟛
─  ─    ─   ─     *  ·  · ─   ?  ?  *  · ·  ─  ─    --𝟚⊗3
─  ─    ─   ─     ─  ·  · ─   ·  ·  ─  · ·  ─  ─


***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
─   ·   ? ?  ?    ·   ·  ·  ?  ─   · ·  ·  ·   ·  ?  ─  --𝟙
─   ·   ? ?  ?    ·   ·  ·  ?  ─   · ·  ·  ·   ·  ?  ─  --𝟚
?   ?   ? ─  ?    ?   ─  ?  ?  ?   ? ?  ─  ?   ?  ?  ?  --𝟛
─   ·   ? ─  ?    ·   ─  ·  ?  ─   · ·  ─  ·   ·  ?  ─  --𝟚⊗3
─   ·   · ─  ·    ·   ─  ·  ·  ─   · ·  ─  ·   ·  ─  ─


***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
─  ·  ?  ·   ?   ─   ─ ?  ?  ·   ? ─  ─  ?  --𝟙
─  ·  ·  ·   ?   ─   ─ ?  ?  ·   ? ─  ─  ·  --𝟚
?  ?  ?  ─   ?   ?   ? ?  ?  ?   ? ?  ?  ?  --𝟛
─  ·  ·  ─   ?   ─   ─ ?  ?  ·   ? ─  ─  ·  --𝟚⊗3
─  ·  ·  ─   ─   ─   ─ ─  ·  ·   ─ ─  ─  ─


***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─  ?  ? ─   ─  --𝟙
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─  ·  ? ─   ─  --𝟚
─ ?   ? ?   ? ?   ─  ?  ?  ?  ? ?  *  ?  ? *   ?  --𝟛
─ ·   ? ─   · ?   ─  ·  ·  ?  · ?  *  ·  ? *   ─  --𝟚⊗3
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─


Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ⁀ας Ἀ χαι ῶν
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟙
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟚
─ ?   ? ?   ? ?   ─  ?  ?  ?  ? ?  ?     ? *   ?  --𝟛
─ ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? *   ─  --𝟚⊗3
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─     ─ ─   ─


Ἀ τρε⁀ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─  ?  ? ─   ─  --𝟙
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─  ·  ? ─   ─  --𝟚
─ ?     ?   ? ?   ─  ?  ?  ?  ? ?  *  ?  ? *   ?  --𝟛
─ ─     ─   · ?   ─  ·  ·  ?  · ?  *  ·  ? *   ─  --𝟚⊗3
─ ─     ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ⁀ας Ἀ χαι ῶν
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟙
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟚
─ ?     ?   ? ?   ─  ?  ?  ?  ? ?  ?     ? *   ?  --𝟛
─ ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? *   ─  --𝟚⊗3
─ ─     ─   · ·   ─  ·  ·  ─  · ·  ─     ─ ─   ─


***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τ᾽ἀ πε ρεί σι᾽ ἄ ποι να
?  ·  ·  ·   ·  ?  ?  ?   ·  ─   ?   ·  ─   ?   ? ─   ?  --𝟙
?  ·  ·  ·   ·  ?  ?  ?   ·  ─   ?   ·  ─   ?   ? ─   ·  --𝟚
?  ?  ?  ─   ?  ?  ─  ?   ?  ─   ?   ?  ?   ?   ? ?   ?  --𝟛
?  ·  ·  ─   ·  ?  ─  ?   ·  ─   ?   ·  ─   ?   ? ─   ·  --𝟚⊗3
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·   ·  ─   ·   · ─   ─


***************

στέμ ματ᾽ ἔ χων ἐν χερ σὶν ἑ κη βό ƛου Ἀ πόƛ ƛω νος
·    ?    · ─   ·  ·   ?   · ─  ·  ─   ? ·   ─  ·   --𝟙
·    ?    · ─   ·  ·   ?   · ─  ·  ─   ? ·   ─  ·   --𝟚
─    ?    ? ?   ─  ─   ?   ? ?  ?  *   ? ─   ?  ?   --𝟛
─    ?    · ─   ─  ─   ?   · ─  ·  *   ? ─   ─  ·   --𝟚⊗3
─    ·    · ─   ─  ─   ·   · ─  ·  ·   ─ ─   ─  ─


***************

χρυ σέ⁀ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι ούς
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─   ─   --𝟙
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─   ─   --𝟚
?   *    ? ─  ─    ?   ?   ─   ?  ?  ─  ?    ? *   ?   --𝟛
?   *    ? ─  ─    ─   ─   ─   ·  ·  ─  ?    ? *   ─   --𝟚⊗3
─   ·    · ─  ─    ─   ─   ─   ·  ·  ─  ·    · ─   ─


χρυ σέ⁀ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι⁀ούς
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─       --𝟙
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─       --𝟚
?   *    ? ─  ─    ?   ?   ─   ?  ?  ─  ?    ? ?       --𝟛
?   *    ? ─  ─    ─   ─   ─   ·  ·  ─  ?    ? ─       --𝟚⊗3
─   ·    · ─  ─    ─   ─   ─   ·  ·  ─  ─    ─ ─

-}
-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
