{-# OPTIONS --safe #-}
module Iliagda.Examples where

open import Iliagda.Init
open import Iliagda.Morphology
open import Iliagda.Prosody
open import Iliagda.Prosody.Synizesis
open import Iliagda.Prosody.Rules
open import Iliagda.Prosody.Rules.Dec
open import Iliagda.Verses
open import Iliagda.Show

debugVerse : Verse {n} → String
debugVerse ws =
  let
    mqs1 , _ , _ = 𝟙-theQuantities (unwords ws)
    mqs2 , _ , _ = 𝟚-theQuantities ws
    mqs3 , _ , _ = 𝟛-theQuantities ws

    `ws = show (unwords ws)
    ns = map Str.length (Str.words `ws)
    `mqs1 = map show (toList mqs1)
    `mqs2 = map show (toList mqs2)
    `mqs3 = map show (toList mqs3)
    `mqs23 = map show (toList $ mqs2 ⊗ mqs3)
  in
     `ws ◇ "\n"
    ◇ spaces (map (uncurry pad) $ L.zip `mqs1 ns) ◇ " --𝟙 \n"
    ◇ spaces (map (uncurry pad) $ L.zip `mqs2 ns) ◇ " --𝟚 \n"
    ◇ spaces (map (uncurry pad) $ L.zip `mqs3 ns) ◇ " --𝟛 \n"
    ◇ spaces (map (uncurry pad) $ L.zip `mqs23 ns) ◇ " --𝟚⊗3\n"

{- ** Interactively showing all derivations of given verses **

-- [C-u C-u C-c C-n] mkDerivations $ L.take 5 verse

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ·  · ─  ─

***************

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ─  ─   · · ─  ·   · ─ ─

***************

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δἐ τε ƛεί ε το βου ƛή
─  ─ ─   ·  ·  ─  ·  ·  ─  ·  ·  ─   · ·  ─   ─

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─

***************

τίς τἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
─   ─   ─   · ·  ─  · ·  ─  ·  ·  ─ ·  ·  ─  ─

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ·  ·  ─  ·  · ─   ·  ·  ─  · ·  ─  ─

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
─   ·   · ─  ·    ·   ─  ·  ·  ─   · ·  ─  ·   ·  ─  ─

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
─  ·  ·  ─   ─   ─   ─ ─  ·  ·   ─ ─  ─  ─

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

***************



***************

-}


{- ** NEW **

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε ω Ἀ χι ƛῆ ος
∅

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ·  · ─  ─

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ─    ─  ─

***************

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   · · ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   ─   ─  ·   · ─ ─

***************

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δ᾽ἐ τε ƛεί ε το βου ƛή
∅

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

***************

τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
∅

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
∅

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
∅

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
∅

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
∅

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τ᾽ἀ πε ρεί σι᾽ ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·   ·  ─   ·   · ─   ─

***************

στέμ ματ᾽ ἔ χων ἐν χερ σὶν ἑ κη βό ƛου Ἀ πόƛ ƛω νος
─    ·    · ─   ─  ─   ·   · ─  ·  ·   ─ ─   ─  ─

***************

χρυ σέ ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι ούς
∅

{- *** NEW NEW
μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─ ─ ·    · ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  ?   ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  ─   ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·    ─ ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─


***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? *   ?   ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? *   ─   ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─   ─   ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? *   ?   ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? *   ─   ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ─    ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─       ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─       ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? ?       ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? ─       ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί⁀Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ?  ─    ─   ─   ?  ·  · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ─    ─   ─   ·  ·  · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?    *   ?   ─  ?  ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ─    *   ─   ─  ·  · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─    ─   ─   ─  ·  · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ?  ? ─       ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?  ? ─       ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?  ? ?       ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?  ? ─       ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ─    ─  ─


οὐ ƛο μέ νην ἣ μυ ρί⁀Ἀ χαι οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ?  ─    ─   ─   ?  ─    ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ─    ─   ─   ·  ─    ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?    *   ?   ─  ?    ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ─    *   ─   ─  ─    ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─    ─   ─   ─  ─    ─  ─


***************

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   · · ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ─     ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ? ? ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ? ? ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ? ? ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   · · ─  ─     ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ─   ?  ·   ? ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ─   ·  ·   ? ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ?   ─  ?   ? ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ─   ─  ·   ? ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   ─   ─  ·   · ─ ─


ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ⁀ΐ α ψεν
·   ?   ?    ?  ─    ?  ?   ─   ?  ─     ? ·   --𝟙
·   ?   ?    ?  ─    ?  ?   ─   ·  ─     ? ·   --𝟚
─   ─   ─    ?  ─    ?  ?   ?   ─  *     ─ ?   --𝟛
─   ─   ─    ?  ─    ?  ?   ─   ─  *     ─ ·   --𝟚⊗3
─   ─   ─    ─  ─    ─  ─   ─   ─  ─     ─ ─


***************

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?  ? ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ·  · ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ·  · ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ?  ? ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ?  · ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?  ? ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ?  · ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ·  · ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ·  ─   ─


ἡρ ώ ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι⁀α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟙
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ?  ·   ?   --𝟚
?  * ?  ?  ─    ?    ?  ?    ?   ?  ?  ─   ?   --𝟛
─  * ─  ─  ─    ─    ─  ─    ─   ·  ?  ─   ?   --𝟚⊗3
─  ─ ─  ─  ─    ─    ─  ─    ─   ·  ·  ─   ─


***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δ᾽ἐ τε ƛεί ε το βου ƛή
─  ─ ─   ?  ·  ─  ?  ?  ·  ·   ·  ─   · ·  ─   ─  --𝟙
─  ─ ─   ?  ·  ─  ·  ?  ·  ·   ·  ─   · ·  ─   ─  --𝟚
*  ? ?   ?  ?  ?  ?  ?  ─  ?   ?  *   ? ?  ?   ?  --𝟛
*  ─ ─   ?  ·  ─  ·  ?  ─  ·   ·  *   · ·  ─   ─  --𝟚⊗3
─  ─ ─   ·  ·  ─  ·  ·  ─  ·   ·  ─   · ·  ─   ─


***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
·  ─  ─  ?  ─   ?  ?  ? ─   ─   · ?  ?  ·   --𝟙
·  ─  ─  ?  ─   ·  ?  ? ─   ─   · ?  ?  ·   --𝟚
─  ?  ?  ─  ?   ?  ?  ─ ?   ?   ? ?  ─  ?   --𝟛
─  ─  ─  ─  ─   ·  ?  ─ ─   ─   · ?  ─  ·   --𝟚⊗3
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─


***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ·   ? ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ·   ? ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?   ? ─   ?  ? ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ·   ? ─   ·  ? ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ·   · ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ·   ? ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ·   ? ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?   ? ─   ?  ? ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ·   ? ─   ·  ? ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ·   · ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ·   ? ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ·   ? ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?   ? ─   ?    ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ·   ? ─   ─    ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ·   · ─   ─    ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ─     ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ─     ─   ·  ? ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?     ─   ?  ? ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ─     ─   ·  ? ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ─     ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ·   ? ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ·   ? ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?   ? ─   ?    ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ·   ? ─   ─    ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ·   · ─   ─    ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ─     ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ─     ─   ·  ? ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?     ─   ?  ? ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ─     ─   ·  ? ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ─     ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─


Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
? ─     ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟙
? ─     ─   ─    ?   ?  ─    ─   ─  ·  ? ?   ─    --𝟚
─ ?     ─   ?    ─   ─  ─    ?   *  ?  ? ─   ?    --𝟛
─ ─     ─   ─    ─   ─  ─    ─   *  ·  ? ─   ─    --𝟚⊗3
─ ─     ─   ─    ─   ─  ─    ─   ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
? ─     ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟙
? ─     ─   ─    ?   ?  ─    ─   ─     ? ?   ─    --𝟚
─ ?     ─   ?    ─   ─  ─    ?   ?     ? ─   ?    --𝟛
─ ─     ─   ─    ─   ─  ─    ─   ─     ? ─   ─    --𝟚⊗3
─ ─     ─   ─    ─   ─  ─    ─   ─     ─ ─   ─


***************

τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
?   ?    ─   · ·  ─  · ?  ?  ?  ·  ─ ·  ?  ·  ─    --𝟙
?   ?    ─   · ·  ─  · ?  ·  ?  ·  ─ ·  ?  ·  ─    --𝟚
─   ─    *   ? ?  ?  ? ?  ─  ?  ?  ? ?  ?  ─  ?    --𝟛
─   ─    *   · ·  ─  · ?  ─  ?  ·  ─ ·  ?  ─  ─    --𝟚⊗3
─   ─    ─   · ·  ─  · ·  ─  ·  ·  ─ ·  ·  ─  ─


τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ⁀η κε μά χε σθαι
?   ?    ─   · ·  ─  · ?  ?  ?  ─    ·  ?  ·  ─    --𝟙
?   ?    ─   · ·  ─  · ?  ·  ?  ─    ·  ?  ·  ─    --𝟚
─   ─    *   ? ?  ?  ? ?  ─  ?  ?    ?  ?  ─  ?    --𝟛
─   ─    *   · ·  ─  · ?  ─  ?  ─    ·  ?  ─  ─    --𝟚⊗3
─   ─    ─   · ·  ─  · ·  ─  ─  ─    ·  ·  ─  ─


***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ?  ·  ─  ·  · ?   ?  ?  ─  ? ·  ─  ─    --𝟙
─  ─    ─   ?  ·  ─  ·  · ?   ?  ?  ─  · ·  ─  ─    --𝟚
?  ─    ?   ?  ?  *  ?  ? ─   ?  ?  *  ? ?  ?  ?    --𝟛
─  ─    ─   ?  ·  *  ·  · ─   ?  ?  *  · ·  ─  ─    --𝟚⊗3
─  ─    ─   ·  ·  ─  ·  · ─   ·  ·  ─  · ·  ─  ─


Λη τοῦς καὶ Δι⁀ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ─     ─  ·  · ?   ?  ?  ─  ? ·  ─  ─    --𝟙
─  ─    ─   ─     ─  ·  · ?   ?  ?  ─  · ·  ─  ─    --𝟚
?  ─    ?   ?     *  ?  ? ─   ?  ?  *  ? ?  ?  ?    --𝟛
─  ─    ─   ─     *  ·  · ─   ?  ?  *  · ·  ─  ─    --𝟚⊗3
─  ─    ─   ─     ─  ·  · ─   ·  ·  ─  · ·  ─  ─


***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
─   ·   ? ?  ?    ·   ·  ·  ?  ─   · ·  ·  ·   ·  ?  ─  --𝟙
─   ·   ? ?  ?    ·   ·  ·  ?  ─   · ·  ·  ·   ·  ?  ─  --𝟚
?   ?   ? ─  ?    ?   ─  ?  ?  ?   ? ?  ─  ?   ?  ?  ?  --𝟛
─   ·   ? ─  ?    ·   ─  ·  ?  ─   · ·  ─  ·   ·  ?  ─  --𝟚⊗3
─   ·   · ─  ·    ·   ─  ·  ·  ─   · ·  ─  ·   ·  ─  ─


***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
─  ·  ?  ·   ?   ─   ─ ?  ?  ·   ? ─  ─  ?  --𝟙
─  ·  ·  ·   ?   ─   ─ ?  ?  ·   ? ─  ─  ·  --𝟚
?  ?  ?  ─   ?   ?   ? ?  ?  ?   ? ?  ?  ?  --𝟛
─  ·  ·  ─   ?   ─   ─ ?  ?  ·   ? ─  ─  ·  --𝟚⊗3
─  ·  ·  ─   ─   ─   ─ ─  ·  ·   ─ ─  ─  ─


***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─  ?  ? ─   ─  --𝟙
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─  ·  ? ─   ─  --𝟚
─ ?   ? ?   ? ?   ─  ?  ?  ?  ? ?  *  ?  ? *   ?  --𝟛
─ ·   ? ─   · ?   ─  ·  ·  ?  · ?  *  ·  ? *   ─  --𝟚⊗3
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─


Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ⁀ας Ἀ χαι ῶν
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟙
? ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟚
─ ?   ? ?   ? ?   ─  ?  ?  ?  ? ?  ?     ? *   ?  --𝟛
─ ·   ? ─   · ?   ─  ·  ·  ?  · ?  ─     ? *   ─  --𝟚⊗3
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─     ─ ─   ─


Ἀ τρε⁀ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─  ?  ? ─   ─  --𝟙
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─  ·  ? ─   ─  --𝟚
─ ?     ?   ? ?   ─  ?  ?  ?  ? ?  *  ?  ? *   ?  --𝟛
─ ─     ─   · ?   ─  ·  ·  ?  · ?  *  ·  ? *   ─  --𝟚⊗3
─ ─     ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─


Ἀ τρε⁀ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ⁀ας Ἀ χαι ῶν
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟙
? ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? ─   ─  --𝟚
─ ?     ?   ? ?   ─  ?  ?  ?  ? ?  ?     ? *   ?  --𝟛
─ ─     ─   · ?   ─  ·  ·  ?  · ?  ─     ? *   ─  --𝟚⊗3
─ ─     ─   · ·   ─  ·  ·  ─  · ·  ─     ─ ─   ─


***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τ᾽ἀ πε ρεί σι᾽ ἄ ποι να
?  ·  ·  ·   ·  ?  ?  ?   ·  ─   ?   ·  ─   ?   ? ─   ?  --𝟙
?  ·  ·  ·   ·  ?  ?  ?   ·  ─   ?   ·  ─   ?   ? ─   ·  --𝟚
?  ?  ?  ─   ?  ?  ─  ?   ?  ─   ?   ?  ?   ?   ? ?   ?  --𝟛
?  ·  ·  ─   ·  ?  ─  ?   ·  ─   ?   ·  ─   ?   ? ─   ·  --𝟚⊗3
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·   ·  ─   ·   · ─   ─


***************

στέμ ματ᾽ ἔ χων ἐν χερ σὶν ἑ κη βό ƛου Ἀ πόƛ ƛω νος
·    ?    · ─   ·  ·   ?   · ─  ·  ─   ? ·   ─  ·   --𝟙
·    ?    · ─   ·  ·   ?   · ─  ·  ─   ? ·   ─  ·   --𝟚
─    ?    ? ?   ─  ─   ?   ? ?  ?  *   ? ─   ?  ?   --𝟛
─    ?    · ─   ─  ─   ?   · ─  ·  *   ? ─   ─  ·   --𝟚⊗3
─    ·    · ─   ─  ─   ·   · ─  ·  ·   ─ ─   ─  ─


***************

χρυ σέ⁀ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι ούς
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─   ─   --𝟙
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─   ─   --𝟚
?   *    ? ─  ─    ?   ?   ─   ?  ?  ─  ?    ? *   ?   --𝟛
?   *    ? ─  ─    ─   ─   ─   ·  ·  ─  ?    ? *   ─   --𝟚⊗3
─   ·    · ─  ─    ─   ─   ─   ·  ·  ─  ·    · ─   ─


χρυ σέ⁀ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι⁀ούς
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─       --𝟙
?   ─    ? ?  ─    ─   ─   ?   ·  ·  ?  ?    ? ─       --𝟚
?   *    ? ─  ─    ?   ?   ─   ?  ?  ─  ?    ? ?       --𝟛
?   *    ? ─  ─    ─   ─   ─   ·  ·  ─  ?    ? ─       --𝟚⊗3
─   ·    · ─  ─    ─   ─   ─   ·  ·  ─  ─    ─ ─

-}

{- ** NEW NEW NEW


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ? ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ? ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ? ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─ ─ ·    · ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─ ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  · ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  * ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  * ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ·  ─   ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? ?  ?   ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? ·  ─   ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    · ·    ─ ─  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─  ·  --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  *  ?  --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  *  ·  --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─  ─   ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *  ?   *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *  ─   *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─


μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ?   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟙
─  ·   ? ─  ·  ·  ? ─  ─    ? ─    ? ?  ─     --𝟚
?  ?   ? ?  ?  ?  ? ?  *    ? *    ? ?  ?     --𝟛
─  ·   ? ─  ·  ·  ? ─  *    ? *    ? ?  ─     --𝟚⊗3
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─

***************

οὐ ƛο μέ νην ἣ μυ ρί᾽ Ἀ χαι οῖς ἄƛ γε᾽ ἔ θη κε
─  ·  ·  ─   ─ ?  ?   ? ─   ─   ?  ·   · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?   ? ─   ─   ?  ·   · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?   ? *   ?   ─  ?   ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?   ? *   ─   ─  ·   · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ·   · ─   ─   ─  ·   · ─  ─


οὐ ƛο μέ νην ἣ μυ ρί᾽ Ἀ χαι⁀οῖς ἄƛ γε᾽ ἔ θη κε
─  ·  ·  ─   ─ ?  ?   ? ─       ?  ·   · ─  ·  --𝟙
─  ·  ·  ─   ─ ?  ?   ? ─       ?  ·   · ─  ·  --𝟚
?  ?  ?  ?   ? ?  ?   ? ?       ─  ?   ? ?  ?  --𝟛
─  ·  ·  ─   ─ ?  ?   ? ─       ─  ·   · ─  ·  --𝟚⊗3
─  ·  ·  ─   ─ ─  ─   ─ ─       ─  ·   · ─  ─

⋯(verse 3-15)

Verse 16)
---------

Ἀ τρε ΐ δα δὲ μά ƛι στα δύ ω κο σμή το ρε ƛα ῶν
? ·   ? ?  ·  ?  ?  ?   ?  ─ ·  ─   ·  ·  ?  ─  --𝟙
? ·   ? ?  ·  ?  ?  ·   ?  ─ ·  ─   ·  ·  ?  ─  --𝟚
─ ?   ? ?  ?  ?  ─  ?   ?  ? ─  ?   ?  ?  ?  ?  --𝟛
─ ·   ? ?  ·  ?  ─  ·   ?  ─ ─  ─   ·  ·  ?  ─  --𝟚⊗3
─ ·   · ─  ·  ·  ─  ·   ·  ─ ─  ─   ·  ·  ─  ─


Ἀ τρε⁀ΐ δα δὲ μά ƛι στα δύ ω κο σμή το ρε ƛα ῶν
? ─     ?  ·  ?  ?  ?   ?  ─ ·  ─   ·  ·  ?  ─  --𝟙
? ─     ?  ·  ?  ?  ·   ?  ─ ·  ─   ·  ·  ?  ─  --𝟚
─ ?     ?  ?  ?  ─  ?   ?  ? ─  ?   ?  ?  ?  ?  --𝟛
─ ─     ?  ·  ?  ─  ·   ?  ─ ─  ─   ·  ·  ?  ─  --𝟚⊗3
─ ─     ─  ·  ·  ─  ·   ·  ─ ─  ─   ·  ·  ─  ─


***************

Ἀ τρε ΐ δαι τε καὶ ἄƛ ƛοι ἐ ϋ κνή μι δες Ἀ χαι οί
? ·   ? ─   ·  ─   ?  ─   · ? ─   ?  ·   ? ─   ─  --𝟙
? ·   ? ─   ·  ─   ?  ─   · ? ─   ?  ·   ? ─   ─  --𝟚
─ ?   ? ?   ?  *   ─  *   ? ─ ?   ?  ?   ? *   ?  --𝟛
─ ·   ? ─   ·  *   ─  *   · ─ ─   ?  ·   ? *   ─  --𝟚⊗3
─ ·   · ─   ·  ·   ─  ·   · ─ ─   ─  ·   · ─   ─


Ἀ τρε ΐ δαι τε καὶ ἄƛ ƛοι ἐ⁀ϋ κνή μι δες Ἀ χαι οί
? ·   ? ─   ·  ─   ?  ─   ─   ─   ?  ·   ? ─   ─  --𝟙
? ·   ? ─   ·  ─   ?  ─   ─   ─   ?  ·   ? ─   ─  --𝟚
─ ?   ? ?   ?  *   ─  *   ─   ?   ?  ?   ? *   ?  --𝟛
─ ·   ? ─   ·  *   ─  *   ─   ─   ?  ·   ? *   ─  --𝟚⊗3
─ ·   · ─   ·  ·   ─  ─   ─   ─   ─  ·   · ─   ─


Ἀ τρε ΐ δαι τε καὶ ἄƛ ƛοι⁀ἐ ϋ κνή μι δες Ἀ χαι οί
? ·   ? ─   ·  ─   ?  ─     ? ─   ?  ·   ? ─   ─  --𝟙
? ·   ? ─   ·  ─   ?  ─     ? ─   ?  ·   ? ─   ─  --𝟚
─ ?   ? ?   ?  *   ─  *     ─ ?   ?  ?   ? *   ?  --𝟛
─ ·   ? ─   ·  *   ─  *     ─ ─   ?  ·   ? *   ─  --𝟚⊗3
─ ·   · ─   ·  ·   ─  ─     ─ ─   ─  ·   · ─   ─


Ἀ τρε⁀ΐ δαι τε καὶ ἄƛ ƛοι ἐ ϋ κνή μι δες Ἀ χαι οί
? ─     ─   ·  ─   ?  ─   · ? ─   ?  ·   ? ─   ─  --𝟙
? ─     ─   ·  ─   ?  ─   · ? ─   ?  ·   ? ─   ─  --𝟚
─ ?     ?   ?  *   ─  *   ? ─ ?   ?  ?   ? *   ?  --𝟛
─ ─     ─   ·  *   ─  *   · ─ ─   ?  ·   ? *   ─  --𝟚⊗3
─ ─     ─   ·  ·   ─  ·   · ─ ─   ─  ·   · ─   ─


Ἀ τρε⁀ΐ δαι τε καὶ ἄƛ ƛοι ἐ⁀ϋ κνή μι δες Ἀ χαι οί
? ─     ─   ·  ─   ?  ─   ─   ─   ?  ·   ? ─   ─  --𝟙
? ─     ─   ·  ─   ?  ─   ─   ─   ?  ·   ? ─   ─  --𝟚
─ ?     ?   ?  *   ─  *   ─   ?   ?  ?   ? *   ?  --𝟛
─ ─     ─   ·  *   ─  *   ─   ─   ?  ·   ? *   ─  --𝟚⊗3
─ ─     ─   ·  ·   ─  ─   ─   ─   ─  ·   · ─   ─


Ἀ τρε⁀ΐ δαι τε καὶ ἄƛ ƛοι⁀ἐ ϋ κνή μι δες Ἀ χαι οί
? ─     ─   ·  ─   ?  ─     ? ─   ?  ·   ? ─   ─  --𝟙
? ─     ─   ·  ─   ?  ─     ? ─   ?  ·   ? ─   ─  --𝟚
─ ?     ?   ?  *   ─  *     ─ ?   ?  ?   ? *   ?  --𝟛
─ ─     ─   ·  *   ─  *     ─ ─   ?  ·   ? *   ─  --𝟚⊗3
─ ─     ─   ·  ·   ─  ─     ─ ─   ─  ·   · ─   ─


***************

ὑ μῖν μὲν θε⁀οὶ δοῖ εν Ὀ ƛύμ πι α δώ ματ᾽ ἔ χο ντες
? ─   ·   ─     ─   ·  ? ?   ?  ? ─  ?    · ·  ·    --𝟙
? ─   ·   ─     ─   ·  ? ?   ?  ? ─  ?    · ·  ·    --𝟚
? ─   ─   ?     *   ?  ? ─   ?  ? ?  ?    ? ─  ?    --𝟛
? ─   ─   ─     *   ·  ? ─   ?  ? ─  ?    · ─  ·    --𝟚⊗3
─ ─   ─   ─     ─   ·  · ─   ·  · ─  ·    · ─  ─


ὑ μῖν μὲν θε⁀οὶ δοῖ εν Ὀ ƛύμ πι⁀α δώ ματ᾽ ἔ χο ντες
? ─   ·   ─     ─   ·  ? ?   ─    ─  ?    · ·  ·    --𝟙
? ─   ·   ─     ─   ·  ? ?   ─    ─  ?    · ·  ·    --𝟚
? ─   ─   ?     *   ?  ? ─   ?    ?  ?    ? ─  ?    --𝟛
? ─   ─   ─     *   ·  ? ─   ─    ─  ?    · ─  ·    --𝟚⊗3
─ ─   ─   ─     ─   ·  · ─   ─    ─  ·    · ─  ─


ὑ μῖν μὲν θε⁀οὶ δοῖ⁀εν Ὀ ƛύμ πι α δώ ματ᾽ ἔ χο ντες
? ─   ·   ─     ─      ? ?   ?  ? ─  ?    · ·  ·    --𝟙
? ─   ·   ─     ─      ? ?   ?  ? ─  ?    · ·  ·    --𝟚
? ─   ─   ?     ?      ? ─   ?  ? ?  ?    ? ─  ?    --𝟛
? ─   ─   ─     ─      ? ─   ?  ? ─  ?    · ─  ·    --𝟚⊗3
─ ─   ─   ─     ─      ─ ─   ·  · ─  ·    · ─  ─


ὑ μῖν μὲν θε⁀οὶ δοῖ⁀εν Ὀ ƛύμ πι⁀α δώ ματ᾽ ἔ χο ντες
? ─   ·   ─     ─      ? ?   ─    ─  ?    · ·  ·    --𝟙
? ─   ·   ─     ─      ? ?   ─    ─  ?    · ·  ·    --𝟚
? ─   ─   ?     ?      ? ─   ?    ?  ?    ? ─  ?    --𝟛
? ─   ─   ─     ─      ? ─   ─    ─  ?    · ─  ·    --𝟚⊗3
─ ─   ─   ─     ─      ─ ─   ─    ─  ·    · ─  ─


***************

ἐκ πέρ σαι Πρι ά μοι ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ?   ? ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ?   ? ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?   ? *   ? ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ?   ? *   · ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ·   · ─   · ·  ─   ·  ·    ─    ─ ─  ─


ἐκ πέρ σαι Πρι ά μοι ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ?   ? ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ?   ? ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?   ? *   ? ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ?   ? *   · ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ·   · ─   · ·  ─   ─  ─    ·    · ─  ─


ἐκ πέρ σαι Πρι ά μοι⁀ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ?   ? ─     ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ?   ? ─     ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?   ? ?     ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ?   ? ─     ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ·   · ─     ·  ·   ─  ─    ─    ─ ─  ─


ἐκ πέρ σαι Πρι⁀ά μοι ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ─     ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ─     ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?     *   ? ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ─     *   · ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ─     ─   · ·  ─   ·  ·    ─    ─ ─  ─


ἐκ πέρ σαι Πρι⁀ά μοι ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ─     ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ─     ─   · ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?     *   ? ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ─     *   · ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ─     ─   · ·  ─   ─  ─    ·    · ─  ─


ἐκ πέρ σαι Πρι⁀ά μοι⁀ο πό ƛιν εὖ δ᾽οἴ καδ᾽ ἱ κέ σθαι
·  ·   ─   ─     ─     ·  ?   ?  ?    ?    ? ·  ─    --𝟙
·  ·   ─   ─     ─     ·  ?   ?  ?    ?    ? ·  ─    --𝟚
─  ─   ─   ?     ?     ?  ?   ?  ?    ?    ? ─  ?    --𝟛
─  ─   ─   ─     ─     ·  ?   ?  ?    ?    ? ─  ─    --𝟚⊗3
─  ─   ─   ─     ─     ·  ·   ─  ─    ─    ─ ─  ─


***************

παῖ δα δ᾽ἐ μοὶ ƛύ σαι τε φί ƛην τὰ δ᾽ἄ ποι να δέ χε σθαι
─   ?  ·   ─   ?  ─   ·  ?  ─   ?  ?   ─   ?  ·  ·  ─    --𝟙
─   ·  ·   ─   ?  ─   ·  ?  ─   ?  ?   ─   ·  ·  ·  ─    --𝟚
?   ?  ?   ?   ?  ?   ?  ?  ─   ?  ?   ?   ?  ?  ─  ?    --𝟛
─   ·  ·   ─   ?  ─   ·  ?  ─   ?  ?   ─   ·  ·  ─  ─    --𝟚⊗3
─   ·  ·   ─   ─  ─   ·  ·  ─   ·  ·   ─   ·  ·  ─  ─

***************


ἁ ζό με νοι Δι ὸς υἱ ὸν ἑ κη βό ƛον Ἀ πόƛ ƛω να
? ·  ·  ─   ?  ·  ─  ·  · ─  ·  ·   ? ·   ─  ?  --𝟙
? ·  ·  ─   ?  ·  ─  ·  · ─  ·  ·   ? ·   ─  ·  --𝟚
─ ?  ?  ?   ?  ?  *  ?  ? ?  ?  ?   ? ─   ?  ?  --𝟛
─ ·  ·  ─   ?  ·  *  ·  · ─  ·  ·   ? ─   ─  ·  --𝟚⊗3
─ ·  ·  ─   ·  ·  ─  ·  · ─  ·  ·   ─ ─   ─  ─


ἁ ζό με νοι Δι⁀ὸς υἱ ὸν ἑ κη βό ƛον Ἀ πόƛ ƛω να
? ·  ·  ─   ─     ─  ·  · ─  ·  ·   ? ·   ─  ?  --𝟙
? ·  ·  ─   ─     ─  ·  · ─  ·  ·   ? ·   ─  ·  --𝟚
─ ?  ?  ?   ?     *  ?  ? ?  ?  ?   ? ─   ?  ?  --𝟛
─ ·  ·  ─   ─     *  ·  · ─  ·  ·   ? ─   ─  ·  --𝟚⊗3
─ ·  ·  ─   ─     ─  ·  · ─  ·  ·   ─ ─   ─  ─


***************

ἔνθ᾽ ἄƛ ƛοι μὲν πά ντες ἐ πευ φή μη σαν Ἀ χαι οὶ
·    ?  ─   ·   ?  ·    · ─   ─  ─  ?   ? ─   ─  --𝟙
·    ?  ─   ·   ·  ·    · ─   ─  ─  ·   ? ─   ─  --𝟚
─    ─  ?   ─   ─  ?    ? ?   ?  ?  ?   ? *   ?  --𝟛
─    ─  ─   ─   ─  ·    · ─   ─  ─  ·   ? *   ─  --𝟚⊗3
─    ─  ─   ─   ─  ·    · ─   ─  ─  ·   · ─   ─


***************

αἰ δεῖ σθαί θ᾽ἱ ε ρῆ α καὶ ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─  ? ─   ? ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─  · ─   ? ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? *  ? *   ─ ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · *  · *   ─ ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─  · ·   ─ ·   · ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ α καὶ ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ?   · ─  ? ─   ? ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ?   · ─  · ─   ? ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?   ? *  ? *   ─ ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ?   · *  · *   ─ ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─  · ·   ─ ·   · ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ α καὶ ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─  ? ─   ? ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─  · ─   ? ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? *  ? *   ─ ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · *  · *   ─ ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─  · ·   ─ ─     ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─    ─   ? ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─    ─   ? ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? ?    *   ─ ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · ─    *   ─ ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─   ─ ·   · ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ α καὶ ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─  ? ─   ? ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─  · ─   ? ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     *  ? *   ─ ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     *  · *   ─ ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─  · ·   ─ ·   · ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ α καὶ ἀ γƛα⁀ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ?   · ─  ? ─   ? ─     ·   ─     ─   ?  --𝟙
?  ─   ?    ?   · ─  · ─   ? ─     ·   ─     ─   ·  --𝟚
?  ─   ?    ?   ? *  ? *   ─ ?     ─   ?     ?   ?  --𝟛
?  ─   ?    ?   · *  · *   ─ ─     ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─  · ·   ─ ─     ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ?   · ─    ─   ? ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ?   · ─    ─   ? ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?   ? ?    *   ─ ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ?   · ─    *   ─ ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─   ─ ·   · ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─    ─   ? ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─    ─   ? ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? ?    *   ─ ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · ─    *   ─ ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─   ─ ─     ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ⁀ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─    ─     ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─    ─     ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? ?    ─     ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · ─    ─     ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─     ─   ─ ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ α καὶ ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ─     ─  ? ─   ? ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ─     ─  · ─   ? ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?     *  ? *   ─ ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ─     *  · *   ─ ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ─     ─  · ·   ─ ·   · ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ α καὶ ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─  ? ─   ? ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─  · ─   ? ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     *  ? *   ─ ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     *  · *   ─ ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─  · ·   ─ ─     ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─    ─   ? ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─    ─   ? ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     ?    *   ─ ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     ─    *   ─ ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─   ─ ·   · ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ ἀ γƛα⁀ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ?   · ─    ─   ? ─     ·   ─     ─   ?  --𝟙
?  ─   ?    ?   · ─    ─   ? ─     ·   ─     ─   ·  --𝟚
?  ─   ?    ?   ? ?    *   ─ ?     ─   ?     ?   ?  --𝟛
?  ─   ?    ?   · ─    *   ─ ─     ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─   ─ ─     ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ⁀ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ?   · ─    ─     ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ?   · ─    ─     ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?   ? ?    ─     ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ?   · ─    ─     ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─     ─   ─ ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ ε ρῆ⁀α καὶ⁀ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ?   · ─    ─     ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ?   · ─    ─     ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?   ? ?    ─     ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ?   · ─    ─     ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ·   · ─    ─     ─     ─   ─   ─ ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ α καὶ ἀ γƛα⁀ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ─     ─  ? ─   ? ─     ·   ─     ─   ?  --𝟙
?  ─   ?    ─     ─  · ─   ? ─     ·   ─     ─   ·  --𝟚
?  ─   ?    ?     *  ? *   ─ ?     ─   ?     ?   ?  --𝟛
?  ─   ?    ─     *  · *   ─ ─     ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ─     ─  · ·   ─ ─     ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ─     ─    ─   ? ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ─     ─    ─   ? ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?     ?    *   ─ ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ─     ─    *   ─ ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─   ─ ·   · ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─    ─   ? ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─    ─   ? ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     ?    *   ─ ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     ─    *   ─ ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─   ─ ─     ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ⁀ἀ γƛα ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─    ─     ?   ? ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─    ─     ?   ? ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     ?    ─     ?   ? ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     ─    ─     ?   ? ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─     ─   ─ ─   ·   · ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ ἀ γƛα⁀ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ─     ─    ─   ? ─     ·   ─     ─   ?  --𝟙
?  ─   ?    ─     ─    ─   ? ─     ·   ─     ─   ·  --𝟚
?  ─   ?    ?     ?    *   ─ ?     ─   ?     ?   ?  --𝟛
?  ─   ?    ─     ─    *   ─ ─     ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─   ─ ─     ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ⁀ἀ γƛα ὰ δέχ θαι⁀ἄ ποι να
?  ─   ?    ─     ─    ─     ?   ? ·   ─     ─   ?  --𝟙
?  ─   ?    ─     ─    ─     ?   ? ·   ─     ─   ·  --𝟚
?  ─   ?    ?     ?    ─     ?   ? ─   ?     ?   ?  --𝟛
?  ─   ?    ─     ─    ─     ?   ? ─   ─     ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─     ─   ─ ─   ─     ─   ─


αἰ δεῖ σθαί θ᾽ἱ⁀ε ρῆ⁀α καὶ⁀ἀ γƛα⁀ὰ δέχ θαι ἄ ποι να
?  ─   ?    ─     ─    ─     ─     ·   ─   ? ─   ?  --𝟙
?  ─   ?    ─     ─    ─     ─     ·   ─   ? ─   ·  --𝟚
?  ─   ?    ?     ?    ─     ?     ─   *   ? ?   ?  --𝟛
?  ─   ?    ─     ─    ─     ─     ─   *   ? ─   ·  --𝟚⊗3
─  ─   ─    ─     ─    ─     ─     ─   ─   ─ ─   ─


***************

ἀƛƛ᾽ οὐκ Ἀ τρε ΐ δῃ Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ·   ? ?  ? ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ·   ? ?  ? ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?   ? ?  ? ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ·   ? ?  ? ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ·   · ─  · ·  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε ΐ δῃ Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ·   ? ?  ? ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ·   ? ?  ? ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?   ? ?  ? ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ·   ? ?  ? ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ·   · ─  · ·  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε ΐ δῃ⁀Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ·   ? ─    ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ·   ? ─    ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?   ? ?    ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ·   ? ─    ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ·   · ─    ─  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε ΐ δῃ⁀Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ·   ? ─    ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ·   ? ─    ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?   ? ?    ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ·   ? ─    ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ·   · ─    ─  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε⁀ΐ δῃ Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ─     ?  ? ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ─     ?  ? ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?     ?  ? ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ─     ?  ? ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ─     ─  · ·  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε⁀ΐ δῃ Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ─     ?  ? ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ─     ?  ? ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?     ?  ? ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ─     ?  ? ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ─     ─  · ·  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε⁀ΐ δῃ⁀Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ─     ─    ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ─     ─    ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?     ?    ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ─     ─    ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ─     ─    ─  ─  ·   ·  ─  ·  ·  ─  ─


ἀƛƛ᾽ οὐκ Ἀ τρε⁀ΐ δῃ⁀Ἀ γα μέ μνο νι ἥν δα νε θυ μῷ
?    ─   ? ─     ─    ?  ·  ·   ?  ?  ?  ·  ?  ?  --𝟙
?    ─   ? ─     ─    ?  ·  ·   ·  ?  ?  ·  ?  ?  --𝟚
─    ?   ─ ?     ?    ?  ─  ?   ?  ─  ?  ?  ?  ?  --𝟛
─    ─   ─ ─     ─    ?  ─  ·   ·  ─  ?  ·  ?  ?  --𝟚⊗3
─    ─   ─ ─     ─    ─  ─  ·   ·  ─  ·  ·  ─  ─


***************

ἀƛ ƛὰ κα κῶς ἀ φί ει κρα τε ρὸν δ᾽ἐ πὶ μῦ θον ἔ τεƛ ƛε
?  ?  ?  ─   ? ?  ─  ?   ·  ·   ·   ?  ─  ·   · ·   ·  --𝟙
?  ?  ?  ─   ? ?  ─  ?   ·  ·   ·   ?  ─  ·   · ·   ·  --𝟚
─  ?  ?  ?   ? ?  ─  ?   ?  ─   ?   ?  ?  ?   ? ─   ?  --𝟛
─  ?  ?  ─   ? ?  ─  ?   ·  ─   ·   ?  ─  ·   · ─   ·  --𝟚⊗3
─  ·  ·  ─   · ·  ─  ·   ·  ─   ·   ·  ─  ·   · ─   ─


ἀƛ ƛὰ κα κῶς ἀ φί⁀ει κρα τε ρὸν δ᾽ἐ πὶ μῦ θον ἔ τεƛ ƛε
?  ?  ?  ─   ? ─     ?   ·  ·   ·   ?  ─  ·   · ·   ·  --𝟙
?  ?  ?  ─   ? ─     ?   ·  ·   ·   ?  ─  ·   · ·   ·  --𝟚
─  ?  ?  ?   ? ─     ?   ?  ─   ?   ?  ?  ?   ? ─   ?  --𝟛
─  ?  ?  ─   ? ─     ?   ·  ─   ·   ?  ─  ·   · ─   ·  --𝟚⊗3
─  ·  ·  ─   ─ ─     ·   ·  ─   ·   ·  ─  ·   · ─   ─

***************

μή σε γέ ρον κοί ƛῃ σιν ἐ γὼ πα ρὰ νηυ σὶ κι χεί ω
─  ·  ·  ·   ─   ?  ?   · ?  ?  ?  ─   ?  ?  ─   ─ --𝟙
─  ·  ·  ·   ─   ?  ·   · ?  ?  ?  ─   ?  ?  ─   ─ --𝟚
?  ?  ?  ─   ?   ?  ?   ? ?  ?  ?  ?   ?  ?  *   ? --𝟛
─  ·  ·  ─   ─   ?  ·   · ?  ?  ?  ─   ?  ?  *   ─ --𝟚⊗3
─  ·  ·  ─   ─   ─  ·   · ─  ·  ·  ─   ·  ·  ─   ─


μή σε γέ ρον κοί ƛῃ σιν ἐ γὼ πα ρὰ νηυ σὶ κι χεί⁀ω
─  ·  ·  ·   ─   ?  ?   · ?  ?  ?  ─   ?  ?  ─     --𝟙
─  ·  ·  ·   ─   ?  ·   · ?  ?  ?  ─   ?  ?  ─     --𝟚
?  ?  ?  ─   ?   ?  ?   ? ?  ?  ?  ?   ?  ?  ?     --𝟛
─  ·  ·  ─   ─   ?  ·   · ?  ?  ?  ─   ?  ?  ─     --𝟚⊗3
─  ·  ·  ─   ─   ─  ·   · ─  ·  ·  ─   ─  ─  ─


***************

ἢ νῦν δη θύ νοντ᾽ ἢ ὕ στε ρον αὖ τις ἰ ό ντα
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ? · ?   --𝟙
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ? · ?   --𝟚
? ─   ?  ?  ─     ? ─ ?   ?   ?  ?   ? ─ ?   --𝟛
? ─   ─  ?  ─     ? ─ ·   ·   ?  ?   ? ─ ?   --𝟚⊗3
─ ─   ─  ─  ─     ─ ─ ·   ·   ─  ·   · ─ ─


ἢ νῦν δη θύ νοντ᾽ ἢ ὕ στε ρον αὖ τις ἰ ό ντα
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ? · ?   --𝟙
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ? · ?   --𝟚
? ─   ?  ?  ─     ? ─ ?   ?   ?  ?   ? ─ ?   --𝟛
? ─   ─  ?  ─     ? ─ ·   ·   ?  ?   ? ─ ?   --𝟚⊗3
─ ─   ─  ─  ─     ─ ─ ·   ·   ─  ·   · ─ ─


ἢ νῦν δη θύ νοντ᾽ ἢ ὕ στε ρον αὖ τις ἰ⁀ό ντα
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ─   ?   --𝟙
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ─   ?   --𝟚
? ─   ?  ?  ─     ? ─ ?   ?   ?  ?   ─   ?   --𝟛
? ─   ─  ?  ─     ? ─ ·   ·   ?  ?   ─   ?   --𝟚⊗3
─ ─   ─  ─  ─     ─ ─ ·   ·   ─  ─   ─   ─


ἢ νῦν δη θύ νοντ᾽ ἢ ὕ στε ρον αὖ τις ἰ⁀ό ντα
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ─   ?   --𝟙
? ─   ─  ?  ·     ? ? ·   ·   ?  ?   ─   ?   --𝟚
? ─   ?  ?  ─     ? ─ ?   ?   ?  ?   ─   ?   --𝟛
? ─   ─  ?  ─     ? ─ ·   ·   ?  ?   ─   ?   --𝟚⊗3
─ ─   ─  ─  ─     ─ ─ ·   ·   ─  ─   ─   ─


***************

μή νύ τοι οὐ χραί σμῃ σκῆπ τρον καὶ στέμ μα θε οῖ ο
─  ?  ─   ─  ?    ?   ─    ·    ─   ·    ?  ·  ─  · --𝟙
─  ?  ─   ─  ?    ?   ─    ·    ─   ·    ?  ·  ─  · --𝟚
?  ?  *   ─  ─    ─   ─    ─    ─   ─    ?  ?  *  ? --𝟛
─  ?  *   ─  ─    ─   ─    ─    ─   ─    ?  ·  *  · --𝟚⊗3
─  ·  ·   ─  ─    ─   ─    ─    ─   ─    ·  ·  ─  ─


μή νύ τοι οὐ χραί σμῃ σκῆπ τρον καὶ στέμ μα θε⁀οῖ ο
─  ?  ─   ─  ?    ?   ─    ·    ─   ·    ?  ─     · --𝟙
─  ?  ─   ─  ?    ?   ─    ·    ─   ·    ?  ─     · --𝟚
?  ?  *   ─  ─    ─   ─    ─    ─   ─    ?  *     ? --𝟛
─  ?  *   ─  ─    ─   ─    ─    ─   ─    ?  *     · --𝟚⊗3
─  ·  ·   ─  ─    ─   ─    ─    ─   ─    ─  ─     ─


μή νύ τοι⁀οὐ χραί σμῃ σκῆπ τρον καὶ στέμ μα θε οῖ ο
─  ?  ─      ?    ?   ─    ·    ─   ·    ?  ·  ─  · --𝟙
─  ?  ─      ?    ?   ─    ·    ─   ·    ?  ·  ─  · --𝟚
?  ?  ─      ─    ─   ─    ─    ─   ─    ?  ?  *  ? --𝟛
─  ?  ─      ─    ─   ─    ─    ─   ─    ?  ·  *  · --𝟚⊗3
─  ─  ─      ─    ─   ─    ─    ─   ─    ·  ·  ─  ─


μή νύ τοι⁀οὐ χραί σμῃ σκῆπ τρον καὶ στέμ μα θε⁀οῖ ο
─  ?  ─      ?    ?   ─    ·    ─   ·    ?  ─     · --𝟙
─  ?  ─      ?    ?   ─    ·    ─   ·    ?  ─     · --𝟚
?  ?  ─      ─    ─   ─    ─    ─   ─    ?  *     ? --𝟛
─  ?  ─      ─    ─   ─    ─    ─   ─    ?  *     · --𝟚⊗3
─  ─  ─      ─    ─   ─    ─    ─   ─    ─  ─     ─


***************

τὴν δ᾽ἐ γὼ οὐ ƛύ σω πρίν μιν καὶ γῆ ρας ἔ πει σιν
─   ·   ?  ─  ?  ─  ?    ?   ─   ─  ?   · ─   ?   --𝟙
─   ·   ?  ─  ?  ─  ?    ?   ─   ─  ·   · ─   ·   --𝟚
─   ?   ?  ?  ?  ─  ─    ─   ?   ?  ?   ? ?   ?   --𝟛
─   ·   ?  ─  ?  ─  ─    ─   ─   ─  ·   · ─   ·   --𝟚⊗3
─   ·   ·  ─  ─  ─  ─    ─   ─   ─  ·   · ─   ─


***************

ἡ με τέ ρῳ ἐ νὶ οἴ κῳ ἐν Ἄρ γε ϊ τη ƛό θι πά τρης
─ ·  ·  ─  · ?  ?  ─  ·  ?  ·  ? ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─  · ?  ?  ─  ·  ?  ·  · ─  ·  ?  ?  ─    --𝟚
? ?  ?  *  ? ?  ?  *  ?  ─  ?  ? ?  ?  ?  ─  ?    --𝟛
─ ·  ·  *  · ?  ?  *  ·  ─  ·  · ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─  · ·  ─  ·  ·  ─  ·  · ─  ·  ·  ─  ─


ἡ με τέ ρῳ ἐ νὶ οἴ κῳ ἐν Ἄρ γε⁀ϊ τη ƛό θι πά τρης
─ ·  ·  ─  · ?  ?  ─  ·  ?  ─    ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─  · ?  ?  ─  ·  ?  ─    ─  ·  ?  ?  ─    --𝟚
? ?  ?  *  ? ?  ?  *  ?  ─  ?    ?  ?  ?  ─  ?    --𝟛
─ ·  ·  *  · ?  ?  *  ·  ─  ─    ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─  · ·  ─  ·  ·  ─  ─    ─  ·  ·  ─  ─


ἡ με τέ ρῳ ἐ νὶ οἴ κῳ⁀ἐν Ἄρ γε ϊ τη ƛό θι πά τρης
─ ·  ·  ─  · ?  ?  ─     ?  ·  ? ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─  · ?  ?  ─     ?  ·  · ─  ·  ?  ?  ─    --𝟚
? ?  ?  *  ? ?  ?  ?     ─  ?  ? ?  ?  ?  ─  ?    --𝟛
─ ·  ·  *  · ?  ?  ─     ─  ·  · ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─  · ·  ─  ─     ─  ·  · ─  ·  ·  ─  ─


ἡ με τέ ρῳ⁀ἐ νὶ οἴ κῳ ἐν Ἄρ γε ϊ τη ƛό θι πά τρης
─ ·  ·  ─    ?  ?  ─  ·  ?  ·  ? ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─    ?  ?  ─  ·  ?  ·  · ─  ·  ?  ?  ─    --𝟚
? ?  ?  ?    ?  ?  *  ?  ─  ?  ? ?  ?  ?  ─  ?    --𝟛
─ ·  ·  ─    ?  ?  *  ·  ─  ·  · ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─    ─  ─  ·  ·  ─  ·  · ─  ·  ·  ─  ─


ἡ με τέ ρῳ ἐ νὶ οἴ κῳ⁀ἐν Ἄρ γε⁀ϊ τη ƛό θι πά τρης
─ ·  ·  ─  · ?  ?  ─     ?  ─    ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─  · ?  ?  ─     ?  ─    ─  ·  ?  ?  ─    --𝟚
? ?  ?  *  ? ?  ?  ?     ─  ?    ?  ?  ?  ─  ?    --𝟛
─ ·  ·  *  · ?  ?  ─     ─  ─    ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─  · ·  ─  ─     ─  ─    ─  ·  ·  ─  ─


ἡ με τέ ρῳ⁀ἐ νὶ οἴ κῳ ἐν Ἄρ γε⁀ϊ τη ƛό θι πά τρης
─ ·  ·  ─    ?  ?  ─  ·  ?  ─    ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─    ?  ?  ─  ·  ?  ─    ─  ·  ?  ?  ─    --𝟚
? ?  ?  ?    ?  ?  *  ?  ─  ?    ?  ?  ?  ─  ?    --𝟛
─ ·  ·  ─    ?  ?  *  ·  ─  ─    ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─    ─  ─  ·  ·  ─  ─    ─  ·  ·  ─  ─


ἡ με τέ ρῳ⁀ἐ νὶ οἴ κῳ⁀ἐν Ἄρ γε ϊ τη ƛό θι πά τρης
─ ·  ·  ─    ?  ?  ─     ?  ·  ? ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─    ?  ?  ─     ?  ·  · ─  ·  ?  ?  ─    --𝟚
? ?  ?  ?    ?  ?  ?     ─  ?  ? ?  ?  ?  ─  ?    --𝟛
─ ·  ·  ─    ?  ?  ─     ─  ·  · ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─    ─  ─  ─     ─  ·  · ─  ·  ·  ─  ─


ἡ με τέ ρῳ⁀ἐ νὶ οἴ κῳ⁀ἐν Ἄρ γε⁀ϊ τη ƛό θι πά τρης
─ ·  ·  ─    ?  ?  ─     ?  ─    ─  ·  ?  ?  ─    --𝟙
─ ·  ·  ─    ?  ?  ─     ?  ─    ─  ·  ?  ?  ─    --𝟚
? ?  ?  ?    ?  ?  ?     ─  ?    ?  ?  ?  ─  ?    --𝟛
─ ·  ·  ─    ?  ?  ─     ─  ─    ─  ·  ?  ─  ─    --𝟚⊗3
─ ·  ·  ─    ─  ─  ─     ─  ─    ─  ·  ·  ─  ─

***************

ἱ στὸν ἐ ποι χο μέ νην καὶ ἐ μὸν ƛέ χος ἀ ντι ό ω σαν
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ?   · ─ ?   --𝟙
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ?   · ─ ·   --𝟚
─ ?    ? ?   ?  ?  ─   *   ? ─   ?  ?   ─ ?   ? ? ?   --𝟛
─ ·    · ─   ·  ·  ─   *   · ─   ·  ·   ─ ?   · ─ ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ·   · ─   ·  ·   ─ ·   · ─ ─


ἱ στὸν ἐ ποι χο μέ νην καὶ ἐ μὸν ƛέ χος ἀ ντι ό⁀ω σαν
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ?   ─   ?   --𝟙
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ?   ─   ·   --𝟚
─ ?    ? ?   ?  ?  ─   *   ? ─   ?  ?   ─ ?   ?   ?   --𝟛
─ ·    · ─   ·  ·  ─   *   · ─   ·  ·   ─ ?   ─   ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ·   · ─   ·  ·   ─ ─   ─   ─


ἱ στὸν ἐ ποι χο μέ νην καὶ ἐ μὸν ƛέ χος ἀ ντι⁀ό ω σαν
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ─     ─ ?   --𝟙
? ·    · ─   ·  ·  ─   ─   · ·   ·  ·   ? ─     ─ ·   --𝟚
─ ?    ? ?   ?  ?  ─   *   ? ─   ?  ?   ─ *     ? ?   --𝟛
─ ·    · ─   ·  ·  ─   *   · ─   ·  ·   ─ *     ─ ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ·   · ─   ·  ·   ─ ─     ─ ─


ἱ στὸν ἐ ποι χο μέ νην καὶ⁀ἐ μὸν ƛέ χος ἀ ντι ό ω σαν
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ?   · ─ ?   --𝟙
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ?   · ─ ·   --𝟚
─ ?    ? ?   ?  ?  ─   ?     ─   ?  ?   ─ ?   ? ? ?   --𝟛
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ ?   · ─ ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ ·   · ─ ─


ἱ στὸν ἐ ποι χο μέ νην καὶ⁀ἐ μὸν ƛέ χος ἀ ντι ό⁀ω σαν
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ?   ─   ?   --𝟙
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ?   ─   ·   --𝟚
─ ?    ? ?   ?  ?  ─   ?     ─   ?  ?   ─ ?   ?   ?   --𝟛
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ ?   ─   ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ ─   ─   ─


ἱ στὸν ἐ ποι χο μέ νην καὶ⁀ἐ μὸν ƛέ χος ἀ ντι⁀ό ω σαν
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ─     ─ ?   --𝟙
? ·    · ─   ·  ·  ─   ─     ·   ·  ·   ? ─     ─ ·   --𝟚
─ ?    ? ?   ?  ?  ─   ?     ─   ?  ?   ─ *     ? ?   --𝟛
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ *     ─ ·   --𝟚⊗3
─ ·    · ─   ·  ·  ─   ─     ─   ·  ·   ─ ─     ─ ─


***************

ἀƛƛ᾽ ἴ θι μή μ᾽ἐ ρέ θι ζε σα ώ τε ρος ὥς κε νέ η αι
?    ? ?  ─  ·   ·  ?  ·  ?  ─ ·  ·   ?  ·  ·  ─ ─  --𝟙
?    ? ?  ─  ·   ·  ?  ·  ?  ─ ·  ·   ?  ·  ·  ─ ─  --𝟚
─    ? ?  ?  ?   ?  ─  ?  ?  ? ?  ?   ─  ?  ?  * ?  --𝟛
─    ? ?  ─  ·   ·  ─  ·  ?  ─ ·  ·   ─  ·  ·  * ─  --𝟚⊗3
─    · ·  ─  ·   ·  ─  ·  ·  ─ ·  ·   ─  ·  ·  ─ ─


***************

ὣς ἔ φατ᾽ ἔ δει σεν δ᾽ὃ γέ ρων καὶ ἐ πεί θε το μύ θῳ
∅

***************

βῆ δ᾽ἀ κέ ων πα ρὰ θῖ να πο ƛυ φƛοί σβοι ο θα ƛάσ σης
─  ?   ·  ─  ?  ?  ─  ?  ·  ?  ─    ─    · ?  ?   ─   --𝟙
─  ?   ·  ─  ?  ?  ─  ·  ·  ?  ─    ─    · ?  ?   ─   --𝟚
?  ?   ?  ─  ?  ?  ?  ?  ?  ─  ─    *    ? ?  ─   ?   --𝟛
─  ?   ·  ─  ?  ?  ─  ·  ·  ─  ─    *    · ?  ─   ─   --𝟚⊗3
─  ·   ·  ─  ·  ·  ─  ·  ·  ─  ─    ─    · ·  ─   ─


βῆ δ᾽ἀ κέ ων πα ρὰ θῖ να πο ƛυ φƛοί σβοι⁀ο θα ƛάσ σης
─  ?   ·  ─  ?  ?  ─  ?  ·  ?  ─    ─      ?  ?   ─   --𝟙
─  ?   ·  ─  ?  ?  ─  ·  ·  ?  ─    ─      ?  ?   ─   --𝟚
?  ?   ?  ─  ?  ?  ?  ?  ?  ─  ─    ?      ?  ─   ?   --𝟛
─  ?   ·  ─  ?  ?  ─  ·  ·  ─  ─    ─      ?  ─   ─   --𝟚⊗3
─  ·   ·  ─  ·  ·  ─  ·  ·  ─  ─    ─      ─  ─   ─


βῆ δ᾽ἀ κέ⁀ων πα ρὰ θῖ να πο ƛυ φƛοί σβοι ο θα ƛάσ σης
─  ?   ─     ?  ?  ─  ?  ·  ?  ─    ─    · ?  ?   ─   --𝟙
─  ?   ─     ?  ?  ─  ·  ·  ?  ─    ─    · ?  ?   ─   --𝟚
?  ?   ─     ?  ?  ?  ?  ?  ─  ─    *    ? ?  ─   ?   --𝟛
─  ?   ─     ?  ?  ─  ·  ·  ─  ─    *    · ?  ─   ─   --𝟚⊗3
─  ─   ─     ·  ·  ─  ·  ·  ─  ─    ─    · ·  ─   ─


βῆ δ᾽ἀ κέ⁀ων πα ρὰ θῖ να πο ƛυ φƛοί σβοι⁀ο θα ƛάσ σης
─  ?   ─     ?  ?  ─  ?  ·  ?  ─    ─      ?  ?   ─   --𝟙
─  ?   ─     ?  ?  ─  ·  ·  ?  ─    ─      ?  ?   ─   --𝟚
?  ?   ─     ?  ?  ?  ?  ?  ─  ─    ?      ?  ─   ?   --𝟛
─  ?   ─     ?  ?  ─  ·  ·  ─  ─    ─      ?  ─   ─   --𝟚⊗3
─  ─   ─     ·  ·  ─  ·  ·  ─  ─    ─      ─  ─   ─


***************

ποƛ ƛὰ δ᾽ἔ πειτ᾽ ἀ πά νευ θε κι ὼν ἠ ρᾶθ᾽ ὁ γε ραι ὸς
·   ?  ·   ─     ? ?  ─   ·  ?  ?  ─ ─    ? ·  ─   ·  --𝟙
·   ?  ·   ─     ? ?  ─   ·  ?  ?  ─ ─    ? ·  ─   ·  --𝟚
─   ?  ?   ?     ? ?  ?   ?  ?  ?  ? ?    ? ?  *   ?  --𝟛
─   ?  ·   ─     ? ?  ─   ·  ?  ?  ─ ─    ? ·  *   ·  --𝟚⊗3
─   ·  ·   ─     · ·  ─   ·  ·  ─  ─ ─    · ·  ─   ─


***************

Ἀ πόƛ ƛω νι ἄ νακ τι τὸν ἠ ΰ κο μος τέ κε Λη τώ
? ·   ─  ?  ? ?   ?  ·   ─ ? ·  ·   ·  ·  ─  ─  --𝟙
? ·   ─  ·  ? ?   ·  ·   ─ ? ·  ·   ·  ·  ─  ─  --𝟚
? ─   ?  ?  ? ─   ?  ?   * ? ?  ─   ?  ?  ?  ?  --𝟛
? ─   ─  ·  ? ─   ·  ·   * ? ·  ─   ·  ·  ─  ─  --𝟚⊗3
─ ─   ─  ·  · ─   ·  ·   ─ · ·  ─   ·  ·  ─  ─


Ἀ πόƛ ƛω νι⁀ἄ νακ τι τὸν ἠ ΰ κο μος τέ κε Λη τώ
? ·   ─  ─    ?   ?  ·   ─ ? ·  ·   ·  ·  ─  ─  --𝟙
? ·   ─  ─    ?   ·  ·   ─ ? ·  ·   ·  ·  ─  ─  --𝟚
? ─   ?  ?    ─   ?  ?   * ? ?  ─   ?  ?  ?  ?  --𝟛
? ─   ─  ─    ─   ·  ·   * ? ·  ─   ·  ·  ─  ─  --𝟚⊗3
─ ─   ─  ─    ─   ·  ·   ─ · ·  ─   ·  ·  ─  ─


***************

κƛῦ θί μευ ἀρ γυ ρό τοξ᾽ ὃς Χρύ σην ἀμ φι βέ βη κας
─   ?  ─   ?  ?  ·  ·    ·  ?   ─   ?  ?  ·  ─  ?   --𝟙
─   ?  ─   ?  ?  ·  ·    ·  ?   ─   ?  ?  ·  ─  ·   --𝟚
?   ?  *   ─  ?  ?  ─    ─  ?   ?   ─  ?  ?  ?  ?   --𝟛
─   ?  *   ─  ?  ·  ─    ─  ?   ─   ─  ?  ·  ─  ·   --𝟚⊗3
─   ·  ·   ─  ·  ·  ─    ─  ─   ─   ─  ·  ·  ─  ─


κƛῦ θί μευ⁀ἀρ γυ ρό τοξ᾽ ὃς Χρύ σην ἀμ φι βέ βη κας
─   ?  ─      ?  ·  ·    ·  ?   ─   ?  ?  ·  ─  ?   --𝟙
─   ?  ─      ?  ·  ·    ·  ?   ─   ?  ?  ·  ─  ·   --𝟚
?   ?  ─      ?  ?  ─    ─  ?   ?   ─  ?  ?  ?  ?   --𝟛
─   ?  ─      ?  ·  ─    ─  ?   ─   ─  ?  ·  ─  ·   --𝟚⊗3
─   ─  ─      ·  ·  ─    ─  ─   ─   ─  ·  ·  ─  ─


***************

Κίƛ ƛαν τε ζα θέ ην Τε νέ δοι ό τε ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ·  ─  ·  ·  ─   · ·  ? ?  ? ?   ─    --𝟙
?   ?   ·  ?  ·  ─  ·  ·  ─   · ·  ? ?  ? ?   ─    --𝟚
─   ─   ─  ?  ?  ─  ?  ?  *   ? ?  ? ?  ? ─   ?    --𝟛
─   ─   ─  ?  ·  ─  ·  ·  *   · ·  ? ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ·  ·  ─  ·  ·  ─   · ·  ─ ·  · ─   ─


Κίƛ ƛαν τε ζα θέ ην Τε νέ δοι ό τε ἶ φι⁀ἀ νάσ σεις
?   ?   ·  ?  ·  ─  ·  ·  ─   · ·  ? ─    ?   ─    --𝟙
?   ?   ·  ?  ·  ─  ·  ·  ─   · ·  ? ─    ?   ─    --𝟚
─   ─   ─  ?  ?  ─  ?  ?  *   ? ?  ? ?    ─   ?    --𝟛
─   ─   ─  ?  ·  ─  ·  ·  *   · ·  ? ─    ─   ─    --𝟚⊗3
─   ─   ─  ·  ·  ─  ·  ·  ─   · ·  ─ ─    ─   ─


Κίƛ ƛαν τε ζα θέ ην Τε νέ δοι⁀ό τε ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ·  ─  ·  ·  ─     ·  ? ?  ? ?   ─    --𝟙
?   ?   ·  ?  ·  ─  ·  ·  ─     ·  ? ?  ? ?   ─    --𝟚
─   ─   ─  ?  ?  ─  ?  ?  ?     ?  ? ?  ? ─   ?    --𝟛
─   ─   ─  ?  ·  ─  ·  ·  ─     ·  ? ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ·  ·  ─  ·  ·  ─     ·  · ─  ─ ─   ─


Κίƛ ƛαν τε ζα θέ⁀ην Τε νέ δοι ό τε ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ─     ·  ·  ─   · ·  ? ?  ? ?   ─    --𝟙
?   ?   ·  ?  ─     ·  ·  ─   · ·  ? ?  ? ?   ─    --𝟚
─   ─   ─  ?  ─     ?  ?  *   ? ?  ? ?  ? ─   ?    --𝟛
─   ─   ─  ?  ─     ·  ·  *   · ·  ? ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ─  ─     ·  ·  ─   · ·  ─ ·  · ─   ─


Κίƛ ƛαν τε ζα θέ ην Τε νέ δοι⁀ό τε⁀ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ·  ─  ·  ·  ─     ─    ?  ? ?   ─    --𝟙
?   ?   ·  ?  ·  ─  ·  ·  ─     ─    ?  ? ?   ─    --𝟚
─   ─   ─  ?  ?  ─  ?  ?  ?     ?    ?  ? ─   ?    --𝟛
─   ─   ─  ?  ·  ─  ·  ·  ─     ─    ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ·  ·  ─  ·  ·  ─     ─    ─  ─ ─   ─


Κίƛ ƛαν τε ζα θέ⁀ην Τε νέ δοι ό τε ἶ φι⁀ἀ νάσ σεις
?   ?   ·  ?  ─     ·  ·  ─   · ·  ? ─    ?   ─    --𝟙
?   ?   ·  ?  ─     ·  ·  ─   · ·  ? ─    ?   ─    --𝟚
─   ─   ─  ?  ─     ?  ?  *   ? ?  ? ?    ─   ?    --𝟛
─   ─   ─  ?  ─     ·  ·  *   · ·  ? ─    ─   ─    --𝟚⊗3
─   ─   ─  ─  ─     ·  ·  ─   · ·  ─ ─    ─   ─


Κίƛ ƛαν τε ζα θέ⁀ην Τε νέ δοι⁀ό τε ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ─     ·  ·  ─     ·  ? ?  ? ?   ─    --𝟙
?   ?   ·  ?  ─     ·  ·  ─     ·  ? ?  ? ?   ─    --𝟚
─   ─   ─  ?  ─     ?  ?  ?     ?  ? ?  ? ─   ?    --𝟛
─   ─   ─  ?  ─     ·  ·  ─     ·  ? ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ─  ─     ·  ·  ─     ·  · ─  ─ ─   ─


Κίƛ ƛαν τε ζα θέ⁀ην Τε νέ δοι⁀ό τε⁀ἶ φι ἀ νάσ σεις
?   ?   ·  ?  ─     ·  ·  ─     ─    ?  ? ?   ─    --𝟙
?   ?   ·  ?  ─     ·  ·  ─     ─    ?  ? ?   ─    --𝟚
─   ─   ─  ?  ─     ?  ?  ?     ?    ?  ? ─   ?    --𝟛
─   ─   ─  ?  ─     ·  ·  ─     ─    ?  ? ─   ─    --𝟚⊗3
─   ─   ─  ─  ─     ·  ·  ─     ─    ─  ─ ─   ─


***************

Σμιν θεῦ εἴ πο τέ τοι χα ρί εντ᾽ ἐ πὶ νη ὸν ἔ ρε ψα
?    ─   ?  ·  ·  ─   ?  ?  ·    · ?  ─  ·  · ·  ?  --𝟙
?    ─   ?  ·  ·  ─   ?  ?  ·    · ?  ─  ·  · ·  ·  --𝟚
─    *   ?  ?  ?  ?   ?  ?  ─    ? ?  *  ?  ? ─  ?  --𝟛
─    *   ?  ·  ·  ─   ?  ?  ─    · ?  *  ·  · ─  ·  --𝟚⊗3
─    ─   ─  ·  ·  ─   ·  ·  ─    · ·  ─  ·  · ─  ─


Σμιν θεῦ εἴ πο τέ τοι χα ρί⁀εντ᾽ ἐ πὶ νη ὸν ἔ ρε ψα
?    ─   ?  ·  ·  ─   ?  ─       · ?  ─  ·  · ·  ?  --𝟙
?    ─   ?  ·  ·  ─   ?  ─       · ?  ─  ·  · ·  ·  --𝟚
─    *   ?  ?  ?  ?   ?  ─       ? ?  *  ?  ? ─  ?  --𝟛
─    *   ?  ·  ·  ─   ?  ─       · ?  *  ·  · ─  ·  --𝟚⊗3
─    ─   ─  ·  ·  ─   ─  ─       · ·  ─  ·  · ─  ─


***************

ἢ εἰ δή πο τέ τοι κα τὰ πί ο να μη ρί᾽ ἔ κη α
? ?  ─  ·  ·  ─   ?  ?  ?  · ?  ─  ?   · ─  ? --𝟙
? ?  ─  ·  ·  ─   ?  ?  ?  · ·  ─  ?   · ─  · --𝟚
? ?  ?  ?  ?  ?   ?  ?  ?  ? ?  ?  ?   ? *  ? --𝟛
? ?  ─  ·  ·  ─   ?  ?  ?  · ·  ─  ?   · *  · --𝟚⊗3
─ ─  ─  ·  ·  ─   ·  ·  ─  · ·  ─  ·   · ─  ─


***************

ταύ ρων ἠδ᾽ αἰ γῶν τὸ δέ μοι κρή η νον ἐ έƛ δωρ
?   ─   ─   ?  ─   ·  ·  ─   ─   ─ ·   · ·  ─   --𝟙
?   ─   ─   ?  ─   ·  ·  ─   ─   ─ ·   · ·  ─   --𝟚
?   ?   ?   ?  ─   ?  ?  ─   *   ? ?   ? ─  ?   --𝟛
?   ─   ─   ?  ─   ·  ·  ─   *   ─ ·   · ─  ─   --𝟚⊗3
─   ─   ─   ─  ─   ·  ·  ─   ─   ─ ·   · ─  ─


***************

τί σει αν Δα να οὶ ἐ μὰ δά κρυ α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ?  ─  · ?  ?  ?   ? ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ?  ─  · ?  ?  ?   · ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  ?  *  ? ?  ─  ?   ? ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  ?  *  · ?  ─  ?   · ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ·  ·  ─  · ·  ─  ·   · ─   ·  ·  ─   ─


τί σει αν Δα να οὶ ἐ μὰ δά κρυ⁀α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ?  ─  · ?  ?  ─     ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ?  ─  · ?  ?  ─     ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  ?  *  ? ?  ─  ?     ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  ?  *  · ?  ─  ─     ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ·  ·  ─  · ·  ─  ─     ─   ·  ·  ─   ─


τί σει αν Δα να οὶ⁀ἐ μὰ δά κρυ α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ?  ─    ?  ?  ?   ? ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ?  ─    ?  ?  ?   · ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  ?  ?    ?  ─  ?   ? ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  ?  ─    ?  ─  ?   · ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ·  ·  ─    ─  ─  ·   · ─   ·  ·  ─   ─


τί σει αν Δα να⁀οὶ ἐ μὰ δά κρυ α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ─     · ?  ?  ?   ? ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ─     · ?  ?  ?   · ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  *     ? ?  ─  ?   ? ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  *     · ?  ─  ?   · ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ─  ─     · ·  ─  ·   · ─   ·  ·  ─   ─


τί σει⁀αν Δα να οὶ ἐ μὰ δά κρυ α σοῖ σι βέ ƛεσ σιν
?  ─      ?  ?  ─  · ?  ?  ?   ? ─   ?  ·  ·   ?   --𝟙
?  ─      ?  ?  ─  · ?  ?  ?   · ─   ·  ·  ·   ·   --𝟚
?  ─      ?  ?  *  ? ?  ─  ?   ? ?   ?  ?  ─   ?   --𝟛
?  ─      ?  ?  *  · ?  ─  ?   · ─   ·  ·  ─   ·   --𝟚⊗3
─  ─      ─  ─  ─  · ·  ─  ·   · ─   ·  ·  ─   ─


τί σει αν Δα να οὶ⁀ἐ μὰ δά κρυ⁀α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ?  ─    ?  ?  ─     ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ?  ─    ?  ?  ─     ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  ?  ?    ?  ─  ?     ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  ?  ─    ?  ─  ─     ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ·  ·  ─    ─  ─  ─     ─   ·  ·  ─   ─


τί σει αν Δα να⁀οὶ ἐ μὰ δά κρυ⁀α σοῖ σι βέ ƛεσ σιν
?  ─   ?  ?  ─     · ?  ?  ─     ─   ?  ·  ·   ?   --𝟙
?  ─   ·  ?  ─     · ?  ?  ─     ─   ·  ·  ·   ·   --𝟚
?  *   ─  ?  *     ? ?  ─  ?     ?   ?  ?  ─   ?   --𝟛
?  *   ─  ?  *     · ?  ─  ─     ─   ·  ·  ─   ·   --𝟚⊗3
─  ─   ─  ─  ─     · ·  ─  ─     ─   ·  ·  ─   ─


τί σει⁀αν Δα να οὶ ἐ μὰ δά κρυ⁀α σοῖ σι βέ ƛεσ σιν
?  ─      ?  ?  ─  · ?  ?  ─     ─   ?  ·  ·   ?   --𝟙
?  ─      ?  ?  ─  · ?  ?  ─     ─   ·  ·  ·   ·   --𝟚
?  ─      ?  ?  *  ? ?  ─  ?     ?   ?  ?  ─   ?   --𝟛
?  ─      ?  ?  *  · ?  ─  ─     ─   ·  ·  ─   ·   --𝟚⊗3
─  ─      ─  ─  ─  · ·  ─  ─     ─   ·  ·  ─   ─


τί σει⁀αν Δα να οὶ⁀ἐ μὰ δά κρυ α σοῖ σι βέ ƛεσ σιν
?  ─      ?  ?  ─    ?  ?  ?   ? ─   ?  ·  ·   ?   --𝟙
?  ─      ?  ?  ─    ?  ?  ?   · ─   ·  ·  ·   ·   --𝟚
?  ─      ?  ?  ?    ?  ─  ?   ? ?   ?  ?  ─   ?   --𝟛
?  ─      ?  ?  ─    ?  ─  ?   · ─   ·  ·  ─   ·   --𝟚⊗3
─  ─      ─  ─  ─    ─  ─  ·   · ─   ·  ·  ─   ─


τί σει⁀αν Δα να οὶ⁀ἐ μὰ δά κρυ⁀α σοῖ σι βέ ƛεσ σιν
?  ─      ?  ?  ─    ?  ?  ─     ─   ?  ·  ·   ?   --𝟙
?  ─      ?  ?  ─    ?  ?  ─     ─   ·  ·  ·   ·   --𝟚
?  ─      ?  ?  ?    ?  ─  ?     ?   ?  ?  ─   ?   --𝟛
?  ─      ?  ?  ─    ?  ─  ─     ─   ·  ·  ─   ·   --𝟚⊗3
─  ─      ─  ─  ─    ─  ─  ─     ─   ·  ·  ─   ─


***************

ὣς ἔ φατ᾽ εὐ χό με νος τοῦ δ᾽ἔ κƛυ ε Φοῖ βος Ἀ πόƛ ƛων
?  · ?    ?  ·  ·  ·   ─   ·   ?   · ─   ·   ? ·   ─   --𝟙
?  · ?    ?  ·  ·  ·   ─   ·   ?   · ─   ·   ? ·   ─   --𝟚
?  ? ?    ?  ?  ?  ─   ?   ─   ?   ? ?   ?   ? ─   ?   --𝟛
?  · ?    ?  ·  ·  ─   ─   ─   ?   · ─   ·   ? ─   ─   --𝟚⊗3
─  · ·    ─  ·  ·  ─   ─   ─   ·   · ─   ·   · ─   ─


ὣς ἔ φατ᾽ εὐ χό με νος τοῦ δ᾽ἔ κƛυ⁀ε Φοῖ βος Ἀ πόƛ ƛων
?  · ?    ?  ·  ·  ·   ─   ·   ─     ─   ·   ? ·   ─   --𝟙
?  · ?    ?  ·  ·  ·   ─   ·   ─     ─   ·   ? ·   ─   --𝟚
?  ? ?    ?  ?  ?  ─   ?   ─   ?     ?   ?   ? ─   ?   --𝟛
?  · ?    ?  ·  ·  ─   ─   ─   ─     ─   ·   ? ─   ─   --𝟚⊗3
─  · ·    ─  ·  ·  ─   ─   ─   ─     ─   ·   · ─   ─


***************

βῆ δὲ κατ᾽ Οὐ ƛύμ ποι ο κα ρή νων χω ό με νος κῆρ
─  ·  ?    ?  ?   ─   · ?  ─  ─   ─  · ·  ·   ─   --𝟙
─  ·  ?    ?  ?   ─   · ?  ─  ─   ─  · ·  ·   ─   --𝟚
?  ?  ?    ?  ─   *   ? ?  ?  ─   *  ? ?  ─   ?   --𝟛
─  ·  ?    ?  ─   *   · ?  ─  ─   *  · ·  ─   ─   --𝟚⊗3
─  ·  ·    ─  ─   ─   · ·  ─  ─   ─  · ·  ─   ─


βῆ δὲ κατ᾽ Οὐ ƛύμ ποι⁀ο κα ρή νων χω ό με νος κῆρ
─  ·  ?    ?  ?   ─     ?  ─  ─   ─  · ·  ·   ─   --𝟙
─  ·  ?    ?  ?   ─     ?  ─  ─   ─  · ·  ·   ─   --𝟚
?  ?  ?    ?  ─   ?     ?  ?  ─   *  ? ?  ─   ?   --𝟛
─  ·  ?    ?  ─   ─     ?  ─  ─   *  · ·  ─   ─   --𝟚⊗3
─  ·  ·    ─  ─   ─     ─  ─  ─   ─  · ·  ─   ─


***************

τόξ᾽ ὤ μοι σιν ἔ χων ἀμ φη ρε φέ α τε φα ρέ τρην
·    ? ─   ?   · ─   ?  ─  ·  ·  ? ·  ?  ·  ─    --𝟙
·    ? ─   ?   · ─   ?  ─  ·  ·  ? ·  ?  ·  ─    --𝟚
─    ? ?   ?   ? ?   ─  ?  ?  ?  ? ?  ?  ─  ?    --𝟛
─    ? ─   ?   · ─   ─  ─  ·  ·  ? ·  ?  ─  ─    --𝟚⊗3
─    ─ ─   ·   · ─   ─  ─  ·  ·  ─ ·  ·  ─  ─



-}

-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
