{-# OPTIONS --safe #-}
module Iliagda.Examples where

open import Iliagda.Init
open import Iliagda.Morphology
open import Iliagda.Prosody.Core
open import Iliagda.Prosody.Synizesis
open import Iliagda.Prosody
open import Iliagda.Dec.Core
open import Iliagda.Dec

_ : [ ─ ⨾ · ⨾ · ] ~ mkPM [ -, -, ─·· ]
_ = dactyl []

-- μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος
v1 :
  ( word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
  ∷ word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ]
  ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
  ∷ word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]
  ∷ []) ~
  mkPM
  ( (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v1 = auto

-- οὐλομένην, ἣ μυρί᾽ Ἀχαιοῖς ἄλγε᾽ ἔθηκε,
v2 :
  ( word [ [ ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
  ∷ word [ [ ἣ ] ]
  ∷ word [ [ μ ⨾ υ ] ⨾ [ ρ ⨾ ί ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ῖ ⨾ ς ] ]
  ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ] ]
  ∷ word [ [ ἔ ] ⨾ [ θ ⨾ η ] ⨾ [ κ ⨾ ε ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v2 = auto

-- πολλὰς δ᾽ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν
v3 :
  ( word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ⨾ ς ] ]
  ∷ word [ [ δ{-᾽-} ⨾ ἰ ⨾ φ ] ⨾ [ θ ⨾ ί ] ⨾ [ μ ⨾ ο ⨾ υ ⨾ ς ] ]
  ∷ word [ [ ψ ⨾ υ ] ⨾ [ χ ⨾ ὰ ⨾ ς ] ]
  ∷ word [  [ Ἄ ] ⨾ [ ϊ ] ⨾ [ δ ⨾ ι ] ]
  ∷ word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ ΐ ] ⨾ [ α ] ⨾ [ ψ ⨾ ε ⨾ ν ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ──)

  -- ** both options apply!
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  -- ∷ (-, -, ─··)
  -- ∷ (-, -, ──)

  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v3 = auto

-- ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν
v4 :
  ( word [ [ ἡ ⨾ ρ ] ⨾ [ ώ ] ⨾ [ ω ⨾ ν ] ]
  ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ὺ ⨾ ς ] ]
  ∷ word [ [ δ ⨾ ὲ ] ]
  ∷ word [ [ ἑ ] ⨾ [ ƛ ⨾ ώ ] ⨾ [ ρ ⨾ ι ] ⨾ [ α ] ]
  ∷ word [ [ τ ⨾ ε ⨾ ῦ ] ⨾ [ χ ⨾ ε ] ]
  ∷ word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v4 = auto

-- οἰωνοῖσί τε πᾶσι, Διὸς δ᾽ ἐτελείετο βουλή,
v5 :
  ( word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ί ] ]
  ∷ word [ [ τ ⨾ ε ] ]
  ∷ word [ [ π ⨾ ᾶ ] ⨾ [ σ ⨾ ι ] ]
  ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
  ∷ word [ [ δ{-᾽-} ⨾ ἐ ] ⨾ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ε ] ⨾ [ τ ⨾ ο ] ]
  ∷ word [ [ β ⨾ ο ⨾ υ ] ⨾ [ ƛ ⨾ ή ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v5 = auto

-- ἐξ οὗ δὴ τὰ πρῶτα διαστήτην ἐρίσαντε
v6 :
  ( word [ [ ἐ ⨾ ξ ] ]
  ∷ word [ [ ο ⨾ ὗ ] ]
  ∷ word [ [ δ ⨾ ὴ ] ]
  ∷ word [ [ τ ⨾ ὰ ] ]
  ∷ word [ [ π ⨾ ρ ⨾ ῶ ] ⨾ [ τ ⨾ α ] ]
  ∷ word [ [ δ ⨾ ι ] ⨾ [ α ] ⨾ [ σ ⨾ τ ⨾ ή ] ⨾ [ τ ⨾ η ⨾ ν ] ]
  ∷ word [ [ ἐ ] ⨾ [ ρ ⨾ ί ] ⨾ [ σ ⨾ α ] ⨾ [ ν ⨾ τ ⨾ ε ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v6 = auto

-- Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς.
v7 :
  ( word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ⨾ ς ] ]
  ∷ word [ [ τ ⨾ ε ] ]
  ∷ word [ [ ἄ ] ⨾ [ ν ⨾ α ⨾ ξ ] ]
  ∷ word [ [ ἀ ⨾ ν ] ⨾ [ δ ⨾ ρ ⨾ ῶ ⨾ ν ] ]
  ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
  ∷ word [ [ δ ⨾ ῖ ] ⨾ [ ο ⨾ ς ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v7 = auto

-- τίς τ᾽ ἄρ σφωε θεῶν ἔριδι ξυνέηκε μάχεσθαι;
v8 :
  ( word [ [ τ ⨾ ί ⨾ ς ] ]
  ∷ word [ [ τ{-᾽-} ⨾ ἄ ⨾ ρ ] ]
  ∷ word [ [ σ ⨾ φ ⨾ ω ] ⨾ [ ε ] ]
  ∷ word [ [ θ ⨾ ε ] ⨾ [ ῶ ⨾ ν ] ]
  ∷ word [ [ ἔ ] ⨾ [ ρ ⨾ ι ] ⨾ [ δ ⨾ ι ] ]
  ∷ word [ [ ξ ⨾ υ ] ⨾ [ ν ⨾ έ ] ⨾ [ η ] ⨾ [ κ ⨾ ε ] ]
  ∷ word [ [ μ ⨾ ά ] ⨾ [ χ ⨾ ε ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v8 = auto

{-
Λητοῦς καὶ Διὸς υἱός: ὃ γὰρ βασιλῆϊ χολωθεὶς
νοῦσον ἀνὰ στρατὸν ὄρσε κακήν, ὀλέκοντο δὲ λαοί,
οὕνεκα τὸν Χρύσην ἠτίμασεν ἀρητῆρα
Ἀτρεΐδης: ὃ γὰρ ἦλθε θοὰς ἐπὶ νῆας Ἀχαιῶν
λυσόμενός τε θύγατρα φέρων τ᾽ ἀπερείσι᾽ ἄποινα,
στέμματ᾽ ἔχων ἐν χερσὶν ἑκηβόλου Ἀπόλλωνος
χρυσέῳ ἀνὰ σκήπτρῳ, καὶ λίσσετο πάντας Ἀχαιούς,
Ἀτρεΐδα δὲ μάλιστα δύω, κοσμήτορε λαῶν:
Ἀτρεΐδαι τε καὶ ἄλλοι ἐϋκνήμιδες Ἀχαιοί,
ὑμῖν μὲν θεοὶ δοῖεν Ὀλύμπια δώματ᾽ ἔχοντες
ἐκπέρσαι Πριάμοιο πόλιν, εὖ δ᾽ οἴκαδ᾽ ἱκέσθαι:
παῖδα δ᾽ ἐμοὶ λύσαιτε φίλην, τὰ δ᾽ ἄποινα δέχεσθαι,
ἁζόμενοι Διὸς υἱὸν ἑκηβόλον Ἀπόλλωνα.

ἔνθ᾽ ἄλλοι μὲν πάντες ἐπευφήμησαν Ἀχαιοὶ
αἰδεῖσθαί θ᾽ ἱερῆα καὶ ἀγλαὰ δέχθαι ἄποινα:
ἀλλ᾽ οὐκ Ἀτρεΐδῃ Ἀγαμέμνονι ἥνδανε θυμῷ,
ἀλλὰ κακῶς ἀφίει, κρατερὸν δ᾽ ἐπὶ μῦθον ἔτελλε:
μή σε γέρον κοίλῃσιν ἐγὼ παρὰ νηυσὶ κιχείω
ἢ νῦν δηθύνοντ᾽ ἢ ὕστερον αὖτις ἰόντα,
μή νύ τοι οὐ χραίσμῃ σκῆπτρον καὶ στέμμα θεοῖο:
τὴν δ᾽ ἐγὼ οὐ λύσω: πρίν μιν καὶ γῆρας ἔπεισιν
ἡμετέρῳ ἐνὶ οἴκῳ ἐν Ἄργεϊ τηλόθι πάτρης
ἱστὸν ἐποιχομένην καὶ ἐμὸν λέχος ἀντιόωσαν:
ἀλλ᾽ ἴθι μή μ᾽ ἐρέθιζε σαώτερος ὥς κε νέηαι.--



...ἀνδρειφόντης... <--- most unmetrical line!!!
-}

-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
