{-# OPTIONS --safe #-}
module Iliagda.Examples where

open import Iliagda.Init
open import Iliagda.Morphology
open import Iliagda.Prosody
open import Iliagda.Prosody.Synizesis
open import Iliagda.Prosody.Rules
open import Iliagda.Prosody.Rules.Dec
open import Iliagda.Verses
open import Iliagda.Show

dss : List ∃Derivations
dss = map (λ (_ , v) → -, -, allDerivations v) verses

{- ** Interactively showing all derivations of given verses **

-- [C-u C-u C-c C-n] dss

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  · · ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─ ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε ω⁀Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    · ·  ─   ─  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    · ·  ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ⁀ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─  ─   ─    ─ ─  ─

μῆ νιν ἄ ει δε θε ὰ Πη ƛη⁀ϊ ά δε⁀ω Ἀ χι ƛῆ⁀ος
─  ·   · ─  ·  ·  ─ ─  ─    ─ ─    ─ ─  ─

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ·  · ─   ─   ─  ·  · ─  ─

***************

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─   ─  ─    ─  ─   · · ─  ·   · ─ ─

***************

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

ἡρ ώ ων αὐ τοὺς δὲ ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─ ─  ─  ─    ·  · ─  ·  · ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δἐ τε ƛεί ε το βου ƛή
─  ─ ─   ·  ·  ─  ·  ·  ─  ·  ·  ─   · ·  ─   ─

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─  ·  · ─   ─

***************

τίς τἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
─   ─   ─   · ·  ─  · ·  ─  ·  ·  ─ ·  ·  ─  ─

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
─  ─    ─   ·  ·  ─  ·  · ─   ·  ·  ─  · ·  ─  ─

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
─   ·   · ─  ·    ·   ─  ·  ·  ─   · ·  ─  ·   ·  ─  ─

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
─  ·  ·  ─   ─   ─   ─ ─  ·  ·   ─ ─  ─  ─

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
─ ·   · ─   · ·   ─  ·  ·  ─  · ·  ─  ·  · ─   ─

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

ƛυ σό με νός τε θύ γα τρα φέ ρων τἀ πε ρεί σι ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·  ·  ─   ·  · ─   ─

***************



***************

-}


{- ** NEW **

μῆ νιν ἄ ει δε θε ὰ Πη ƛη ϊ ά δε ω Ἀ χι ƛῆ ος
∅

***************

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ·  · ─  ─

οὐ ƛο μέ νην ἣ μυ ρί Ἀ χαι⁀οῖς ἄƛ γε⁀ἔ θη κε
─  ·  ·  ─   ─ ─  ─  ─ ─       ─  ─    ─  ─

***************

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ·  ·   ─ ─ ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   · · ─  ·   · ─ ─

ποƛ ƛὰς δ᾽ἰφ θί μους ψυ χὰς Ἄ⁀ϊ δι προ ΐ α ψεν
─   ─   ─    ─  ─    ─  ─   ─   ─  ·   · ─ ─

***************

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

ἡρ ώ⁀ων αὐ τοὺς δὲ⁀ἑ ƛώ ρι α τεῦ χε κύ νεσ σιν
─  ─    ─  ─    ─    ─  ─  ─ ─   ·  ·  ─   ─

***************

οἰ ω νοῖ σί τε πᾶ σι Δι ὸς δ᾽ἐ τε ƛεί ε το βου ƛή
∅

***************

ἐξ οὗ δὴ τὰ πρῶ τα δι α στή την ἐ ρί σα ντε
─  ─  ─  ─  ─   ·  ·  ─ ─   ─   · ·  ─  ─

***************

Ἀ τρε ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ·   · ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ·  · ─   ─  ─    ─   ─     ─ ─   ─

Ἀ τρε⁀ΐ δης τε⁀ἄ ναξ ἀν δρῶν καὶ δῖ⁀ος Ἀ χιƛ ƛεύς
─ ─     ─   ─    ─   ─  ─    ─   ─     ─ ─   ─

***************

τίς τ᾽ἄρ σφω ε θε ῶν ἔ ρι δι ξυ νέ η κε μά χε σθαι
∅

***************

Λη τοῦς καὶ Δι ὸς υἱ ός ὃ γὰρ βα σι ƛῆ ϊ χο ƛω θεὶς
∅

***************

νοῦ σον ἀ νὰ στρα τὸν ὄρ σε κα κήν ὀ ƛέ κο ντο δὲ ƛα οί
∅

***************

οὕ νε κα τὸν Χρύ σην ἠ τί μα σεν ἀ ρη τῆ ρα
∅

***************

Ἀ τρε ΐ δης ὃ γὰρ ἦƛ θε θο ὰς ἐ πὶ νῆ ας Ἀ χαι ῶν
∅

***************

ƛυ σό με νός τε θύ γα τρα φέ ρων τ᾽ἀ πε ρεί σι᾽ ἄ ποι να
─  ·  ·  ─   ·  ·  ─  ·   ·  ─   ·   ·  ─   ·   · ─   ─

***************

στέμ ματ᾽ ἔ χων ἐν χερ σὶν ἑ κη βό ƛου Ἀ πόƛ ƛω νος
─    ·    · ─   ─  ─   ·   · ─  ·  ·   ─ ─   ─  ─

***************

χρυ σέ ῳ ἀ νὰ σκήπ τρῳ καὶ ƛίσ σε το πά ντας Ἀ χαι ούς
∅

{-
-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
