{-# OPTIONS --safe #-}
module Iliagda.Examples where

open import Iliagda.Init
open import Iliagda.Morphology
open import Iliagda.Prosody.Core
open import Iliagda.Prosody.Synizesis
open import Iliagda.Prosody
open import Iliagda.Dec.Core
open import Iliagda.Dec

_ : [ ─ ⨾ · ⨾ · ] ~ mkPM [ -, -, ─·· ]
_ = dactyl []

-- ** Verse I: μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος

μῆνιν : word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ] , ∅ ~ [ just ─ ⨾ just · ]
μῆνιν = base {mqs = [ just ─ ⨾ nothing ]} auto

ἄειδε : word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ] , [ θ ] ~ [ nothing ⨾ just ─ ⨾ just · ]
ἄειδε = base auto

θεὰ : word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ] , [ Π ]  ~ [ just · ⨾ nothing ]
θεὰ = base auto

Πηƛηϊάδεω : word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ] , ∅
          ~ [ just ─ ⨾ just ─ ⨾ nothing ⨾ nothing ⨾ just · ⨾ just ─ ]
Πηƛηϊάδεω = base auto

Ἀχιλῆος : word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ] , ∅
        ~ [ nothing ⨾ nothing ⨾ just ─ ⨾ just · ]
Ἀχιλῆος = base {mqs = [ nothing ⨾ nothing ⨾ just ─ ⨾ just · ]} auto

_v1 :
  ( word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
  ∷ word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ]
  ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
  ∷ word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]
  ∷ []) ~
  ( just ─ ∷ just ·
  ∷ nothing ∷ just ─ ∷ just ·
  ∷ just · ∷ nothing
  ∷ just ─ ∷ just ─ ∷ nothing ∷ nothing ∷ just · ∷ just ─
  ∷ nothing ∷ nothing ∷ just ─ ∷ just ·
  ∷ [])
_v1 = μῆνιν ∷ ἄειδε ∷ θεὰ ∷ Πηƛηϊάδεω ∷ Ἀχιλῆος ∷ []

*syn :
  ( [ μ ⨾ ῆ ] ∷ [ ν ⨾ ι ⨾ ν ]
  ∷ [ ἄ ] ∷ [ ε ⨾ ι ] ∷ [ δ ⨾ ε ]
  ∷ [ θ ⨾ ε ] ∷ [ ὰ ]
  ∷ [ Π ⨾ η ] ∷ [ ƛ ⨾ η ] ∷ [ ϊ ] ∷ [ ά ] ∷ [ δ ⨾ ε ] ∷ [ ω ]
  ∷ [ Ἀ ] ∷ [ χ ⨾ ι ] ∷ [ ƛ ⨾ ῆ ] ∷ [ ο ⨾ ς ]
  ∷ [] )
  -synizizes*-
  ( [ μ ⨾ ῆ ] ∷ [ ν ⨾ ι ⨾ ν ]
  ∷ [ ἄ ] ∷ [ ε ⨾ ι ] ∷ [ δ ⨾ ε ]
  ∷ [ θ ⨾ ε ] ∷ [ ὰ ]
  ∷ [ Π ⨾ η ] ∷ [ ƛ ⨾ η ] ∷ [ ϊ ] ∷ [ ά ] ∷ [ δ ⨾ ε ⨾ ω ]
  ∷ [ Ἀ ] ∷ [ χ ⨾ ι ] ∷ [ ƛ ⨾ ῆ ] ∷ [ ο ⨾ ς ]
  ∷ [] )
*syn = auto

v1 :
  ( word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
  ∷ word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ]
  ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
  ∷ word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]
  ∷ []) ~
  mkPM
  ( (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
{-  foot [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ⨾ [ ἄ ] ]     -- (-, -, ─··)
  ∷ foot [ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ⨾ [ θ ⨾ ε ] ]     -- (-, -, ─··)
  ∷ foot [ [ ὰ ] ⨾ [ Π ⨾ η ] ]                     -- (-, -, ──)
  ∷ foot [ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ]             -- (-, -, ─··)
  ∷ foot [ [ δ ⨾ ε ] ⨾ [ ω ] ⨾ [ Ἀ ] ⨾ [ χ ⨾ ι ] ] -- (-, -, ─··)
  ∷ foot [ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]                 -- (-, -, ──)
  ∷ []
-}
v1 = [586] *syn _v1 auto auto

-- ** Verse II: οὐλομένην, ἣ μυρί᾽ Ἀχαιοῖς ἄλγε᾽ ἔθηκε,

οὐλομένην : word [ [ ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ] , ∅
          ~ [ just ─ ⨾ just · ⨾ just · ⨾ just ─ ]
οὐλομένην = base auto

_ἣ : word [ [ ἣ ] ] , [ μ ] ~ [ just ─ ]
_ἣ = base auto

μυρί : word [ [ μ ⨾ υ ] ⨾ [ ρ ⨾ ί ] ] , ∅ ~ [ nothing ⨾ nothing ]
μυρί = base auto

Ἀχαιοῖς : word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ῖ ⨾ ς ] ] , ∅
        ~ [ nothing ⨾ just ─ ⨾ just ─ ]
Ἀχαιοῖς = base auto

ἄλγε᾽ : word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ] ] , ∅ ~ [ just ─ ⨾ just · ]
ἄλγε᾽ = base auto

ἔθηκε : word [ [ ἔ ] ⨾ [ θ ⨾ η ] ⨾ [ κ ⨾ ε ] ] , ∅ ~ [ just · ⨾ just ─ ⨾ just · ]
ἔθηκε = base auto

v2 :
  ( word [ [ ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
  ∷ word [ [ ἣ ] ]
  ∷ word [ [ μ ⨾ υ ] ⨾ [ ρ ⨾ ί ] ]
  ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ῖ ⨾ ς ] ]
  ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ] ]
  ∷ word [ [ ἔ ] ⨾ [ θ ⨾ η ] ⨾ [ κ ⨾ ε ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v2 = fromBelow
   $ (οὐλομένην ∷ _ἣ ∷ μυρί ∷ Ἀχαιοῖς ∷ ἄλγε᾽ ∷ ἔθηκε ∷ [])
   ~∘~ auto

-- πολλὰς δ᾽ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν

πολλὰς : word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ⨾ ς ] ] , [ δ ] ~ [ just ─ ⨾ just ─ ]
πολλὰς = base auto

δ᾽ἰφθίμους : word [ [ δ{-᾽-} ⨾ ἰ ⨾ φ ] ⨾ [ θ ⨾ ί ] ⨾ [ μ ⨾ ο ⨾ υ ⨾ ς ] ] ,  [ ψ ]
           ~ [ just ─ ⨾ nothing ⨾ just ─ ]
δ᾽ἰφθίμους = base auto

ψυχὰς : word [ [ ψ ⨾ υ ] ⨾ [ χ ⨾ ὰ ⨾ ς ] ] , ∅ ~ [ nothing ⨾ nothing ]
ψυχὰς = base auto

Ἄϊδι : word [  [ Ἄ ] ⨾ [ ϊ ] ⨾ [ δ ⨾ ι ] ] , [ π ⨾ ρ ]
     ~ [ nothing ⨾ nothing ⨾ just ─ ]
Ἄϊδι = base auto

προΐαψεν : word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ ΐ ] ⨾ [ α ] ⨾ [ ψ ⨾ ε ⨾ ν ] ] , ∅
         ~ [ just · ⨾ nothing ⨾ just ─ ⨾ just · ]
προΐαψεν = base auto

v3 :
  ( word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ⨾ ς ] ]
  ∷ word [ [ δ{-᾽-} ⨾ ἰ ⨾ φ ] ⨾ [ θ ⨾ ί ] ⨾ [ μ ⨾ ο ⨾ υ ⨾ ς ] ]
  ∷ word [ [ ψ ⨾ υ ] ⨾ [ χ ⨾ ὰ ⨾ ς ] ]
  ∷ word [  [ Ἄ ] ⨾ [ ϊ ] ⨾ [ δ ⨾ ι ] ]
  ∷ word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ ΐ ] ⨾ [ α ] ⨾ [ ψ ⨾ ε ⨾ ν ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ──)

  -- ** both options apply!
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  -- ∷ (-, -, ─··)
  -- ∷ (-, -, ──)

  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v3 = fromBelow
   $ (πολλὰς ∷ δ᾽ἰφθίμους ∷ ψυχὰς ∷ Ἄϊδι ∷ προΐαψεν ∷ [])
   ~∘~ auto

-- ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν

ἡρώων : word [ [ ἡ ⨾ ρ ] ⨾ [ ώ ] ⨾ [ ω ⨾ ν ] ] , ∅
      ~ [ just ─ ⨾ just ─ ⨾ just ─ ]
ἡρώων = base auto

αὐτοὺς : word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ὺ ⨾ ς ] ] , [ δ ]
      ~ [ just ─ ⨾ just ─ ]
αὐτοὺς = base auto

δὲ : word [ [ δ ⨾ ὲ ] ] , ∅ ~ [ just · ]
δὲ = base auto

ἑλώρια : word [ [ ἑ ] ⨾ [ ƛ ⨾ ώ ] ⨾ [ ρ ⨾ ι ] ⨾ [ α ] ] , [ τ ]
       ~ [ just · ⨾ just ─ ⨾ nothing ⨾ nothing ]
ἑλώρια = base auto

τεῦχε : word [ [ τ ⨾ ε ⨾ ῦ ] ⨾ [ χ ⨾ ε ] ] , [ κ ]
      ~ [ just ─ ⨾ just · ]
τεῦχε = base {mqs = [ just ─ ⨾ just · ]} auto

κύνεσσιν : word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ] , ∅
         ~ [ nothing ⨾ just ─ ⨾ nothing ]
κύνεσσιν = base auto

v4 :
  ( word [ [ ἡ ⨾ ρ ] ⨾ [ ώ ] ⨾ [ ω ⨾ ν ] ]
  ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ὺ ⨾ ς ] ]
  ∷ word [ [ δ ⨾ ὲ ] ]
  ∷ word [ [ ἑ ] ⨾ [ ƛ ⨾ ώ ] ⨾ [ ρ ⨾ ι ] ⨾ [ α ] ]
  ∷ word [ [ τ ⨾ ε ⨾ ῦ ] ⨾ [ χ ⨾ ε ] ]
  ∷ word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v4 = fromBelow
   $ (ἡρώων ∷ αὐτοὺς ∷ δὲ ∷ ἑλώρια ∷ τεῦχε ∷ κύνεσσιν ∷ [])
   ~∘~ auto

-- οἰωνοῖσί τε πᾶσι, Διὸς δ᾽ ἐτελείετο βουλή,

οἰωνοῖσί : word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ί ] ] , [ τ ]
         ~ [ just ─ ⨾ just ─ ⨾ just ─ ⨾ just · ]
οἰωνοῖσί = base {mqs = [ just ─ ⨾ just ─ ⨾ just ─ ⨾ nothing ]} auto

τε : word [ [ τ ⨾ ε ] ] , [ π ]
   ~ [ just · ]
τε = base auto

πᾶσι : word [ [ π ⨾ ᾶ ] ⨾ [ σ ⨾ ι ] ] , [ Δ ]
     ~ [ nothing ⨾ just · ]
πᾶσι = base {mqs = [ nothing ⨾ nothing ]} auto

Διὸς : word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ] , [ δ ]
     ~ [ nothing ⨾ just ─ ]
Διὸς = base auto

δ᾽ἐτελείετο
  : word [ [ δ{-᾽-} ⨾ ἐ ] ⨾ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ε ] ⨾ [ τ ⨾ ο ] ] , [ β ]
  ~ [ just · ⨾ just · ⨾ just ─ ⨾ just · ⨾ just · ]
δ᾽ἐτελείετο = base auto

βουλή : word [ [ β ⨾ ο ⨾ υ ] ⨾ [ ƛ ⨾ ή ] ] , ∅
      ~ [ just ─ ⨾ just ─ ]
βουλή = base auto

v5 :
  ( word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ί ] ]
  ∷ word [ [ τ ⨾ ε ] ]
  ∷ word [ [ π ⨾ ᾶ ] ⨾ [ σ ⨾ ι ] ]
  ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
  ∷ word [ [ δ{-᾽-} ⨾ ἐ ] ⨾ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ε ] ⨾ [ τ ⨾ ο ] ]
  ∷ word [ [ β ⨾ ο ⨾ υ ] ⨾ [ ƛ ⨾ ή ] ]
  ∷ []
  ) ~ mkPM
  ( (-, -, ──)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ─··)
  ∷ (-, -, ──)
  ∷ [])
v5 = fromBelow
   $ (οἰωνοῖσί ∷ τε ∷ πᾶσι ∷ Διὸς ∷ δ᾽ἐτελείετο ∷ βουλή ∷ [])
   ~∘~ auto


{-
ἐξ οὗ δὴ τὰ πρῶτα διαστήτην ἐρίσαντε
Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς.
τίς τ᾽ ἄρ σφωε θεῶν ἔριδι ξυνέηκε μάχεσθαι;
Λητοῦς καὶ Διὸς υἱός: ὃ γὰρ βασιλῆϊ χολωθεὶς
νοῦσον ἀνὰ στρατὸν ὄρσε κακήν, ὀλέκοντο δὲ λαοί,
οὕνεκα τὸν Χρύσην ἠτίμασεν ἀρητῆρα
Ἀτρεΐδης: ὃ γὰρ ἦλθε θοὰς ἐπὶ νῆας Ἀχαιῶν
λυσόμενός τε θύγατρα φέρων τ᾽ ἀπερείσι᾽ ἄποινα,
στέμματ᾽ ἔχων ἐν χερσὶν ἑκηβόλου Ἀπόλλωνος
χρυσέῳ ἀνὰ σκήπτρῳ, καὶ λίσσετο πάντας Ἀχαιούς,
Ἀτρεΐδα δὲ μάλιστα δύω, κοσμήτορε λαῶν:
Ἀτρεΐδαι τε καὶ ἄλλοι ἐϋκνήμιδες Ἀχαιοί,
ὑμῖν μὲν θεοὶ δοῖεν Ὀλύμπια δώματ᾽ ἔχοντες
ἐκπέρσαι Πριάμοιο πόλιν, εὖ δ᾽ οἴκαδ᾽ ἱκέσθαι:
παῖδα δ᾽ ἐμοὶ λύσαιτε φίλην, τὰ δ᾽ ἄποινα δέχεσθαι,
ἁζόμενοι Διὸς υἱὸν ἑκηβόλον Ἀπόλλωνα.

ἔνθ᾽ ἄλλοι μὲν πάντες ἐπευφήμησαν Ἀχαιοὶ
αἰδεῖσθαί θ᾽ ἱερῆα καὶ ἀγλαὰ δέχθαι ἄποινα:
ἀλλ᾽ οὐκ Ἀτρεΐδῃ Ἀγαμέμνονι ἥνδανε θυμῷ,
ἀλλὰ κακῶς ἀφίει, κρατερὸν δ᾽ ἐπὶ μῦθον ἔτελλε:
μή σε γέρον κοίλῃσιν ἐγὼ παρὰ νηυσὶ κιχείω
ἢ νῦν δηθύνοντ᾽ ἢ ὕστερον αὖτις ἰόντα,
μή νύ τοι οὐ χραίσμῃ σκῆπτρον καὶ στέμμα θεοῖο:
τὴν δ᾽ ἐγὼ οὐ λύσω: πρίν μιν καὶ γῆρας ἔπεισιν
ἡμετέρῳ ἐνὶ οἴκῳ ἐν Ἄργεϊ τηλόθι πάτρης
ἱστὸν ἐποιχομένην καὶ ἐμὸν λέχος ἀντιόωσαν:
ἀλλ᾽ ἴθι μή μ᾽ ἐρέθιζε σαώτερος ὥς κε νέηαι.--



...ἀνδρειφόντης... <--- most unmetrical line!!!
-}

-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
