{-# OPTIONS --safe #-}
module Iliagda.Verses where

open import Iliagda.Init
open import Iliagda.Morphology

-- μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος
v1 : Verse
v1 = word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
   ∷ word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ]
   ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
   ∷ word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]
   ∷ []

-- οὐλομένην, ἣ μυρί᾽ Ἀχαιοῖς ἄλγε᾽ ἔθηκε,
v2 : Verse
v2 = word [ [ ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
   ∷ word [ [ ἣ ] ]
   ∷ word [ [ μ ⨾ υ ] ⨾ [ ρ ⨾ ί ⨾ ᾽ ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ῖ ⨾ ς ] ]
   ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ⨾ ᾽ ] ]
   ∷ word [ [ ἔ ] ⨾ [ θ ⨾ η ] ⨾ [ κ ⨾ ε ] ]
   ∷ []

-- πολλὰς δ᾽ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν
v3 : Verse
v3 = word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ⨾ ς ] ]
   ∷ word [ [ δ ⨾ ᾽ ⨾ ἰ ⨾ φ ] ⨾ [ θ ⨾ ί ] ⨾ [ μ ⨾ ο ⨾ υ ⨾ ς ] ]
   ∷ word [ [ ψ ⨾ υ ] ⨾ [ χ ⨾ ὰ ⨾ ς ] ]
   ∷ word [ [ Ἄ ] ⨾ [ ϊ ] ⨾ [ δ ⨾ ι ] ]
   ∷ word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ ΐ ] ⨾ [ α ] ⨾ [ ψ ⨾ ε ⨾ ν ] ]
   ∷ []

-- ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν
v4 : Verse
v4 = word [ [ ἡ ] ⨾ [ ρ ⨾ ώ ] ⨾ [ ω ⨾ ν ] ]
   ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ὺ ⨾ ς ] ]
   ∷ word [ [ δ ⨾ ὲ ] ]
   ∷ word [ [ ἑ ] ⨾ [ ƛ ⨾ ώ ] ⨾ [ ρ ⨾ ι ] ⨾ [ α ] ]
   ∷ word [ [ τ ⨾ ε ⨾ ῦ ] ⨾ [ χ ⨾ ε ] ]
   ∷ word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
   ∷ []

-- οἰωνοῖσί τε πᾶσι, Διὸς δ᾽ ἐτελείετο βουλή,
v5 : Verse
v5 = word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ί ] ]
   ∷ word [ [ τ ⨾ ε ] ]
   ∷ word [ [ π ⨾ ᾶ ] ⨾ [ σ ⨾ ι ] ]
   ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
   ∷ word [ [ δ ⨾ ᾽ ⨾ ἐ ] ⨾ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ε ] ⨾ [ τ ⨾ ο ] ]
   ∷ word [ [ β ⨾ ο ⨾ υ ] ⨾ [ ƛ ⨾ ή ] ]
   ∷ []

-- ἐξ οὗ δὴ τὰ πρῶτα διαστήτην ἐρίσαντε
v6 : Verse
v6 = word [ [ ἐ ⨾ ξ ] ]
   ∷ word [ [ ο ⨾ ὗ ] ]
   ∷ word [ [ δ ⨾ ὴ ] ]
   ∷ word [ [ τ ⨾ ὰ ] ]
   ∷ word [ [ π ⨾ ρ ⨾ ῶ ] ⨾ [ τ ⨾ α ] ]
   ∷ word [ [ δ ⨾ ι ] ⨾ [ α ] ⨾ [ σ ⨾ τ ⨾ ή ] ⨾ [ τ ⨾ η ⨾ ν ] ]
   ∷ word [ [ ἐ ] ⨾ [ ρ ⨾ ί ] ⨾ [ σ ⨾ α ] ⨾ [ ν ⨾ τ ⨾ ε ] ]
   ∷ []

-- Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς.
v7 : Verse
v7 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ⨾ ς ] ]
   ∷ word [ [ τ ⨾ ε ] ]
   ∷ word [ [ ἄ ] ⨾ [ ν ⨾ α ⨾ ξ ] ]
   ∷ word [ [ ἀ ⨾ ν ] ⨾ [ δ ⨾ ρ ⨾ ῶ ⨾ ν ] ]
   ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
   ∷ word [ [ δ ⨾ ῖ ] ⨾ [ ο ⨾ ς ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
   ∷ []

-- τίς τ᾽ ἄρ σφωε θεῶν ἔριδι ξυνέηκε μάχεσθαι;
v8 : Verse
v8 = word [ [ τ ⨾ ί ⨾ ς ] ]
   ∷ word [ [ τ ⨾ ᾽ ⨾ ἄ ⨾ ρ ] ]
   ∷ word [ [ σ ⨾ φ ⨾ ω ] ⨾ [ ε ] ]
   ∷ word [ [ θ ⨾ ε ] ⨾ [ ῶ ⨾ ν ] ]
   ∷ word [ [ ἔ ] ⨾ [ ρ ⨾ ι ] ⨾ [ δ ⨾ ι ] ]
   ∷ word [ [ ξ ⨾ υ ] ⨾ [ ν ⨾ έ ] ⨾ [ η ] ⨾ [ κ ⨾ ε ] ]
   ∷ word [ [ μ ⨾ ά ] ⨾ [ χ ⨾ ε ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
   ∷ []

-- Λητοῦς καὶ Διὸς υἱός· ὃ γὰρ βασιλῆϊ χολωθεὶς
v9 : Verse
v9 = word [ [ Λ ⨾ η ] ⨾ [ τ ⨾ ο ⨾ ῦ ⨾ ς ] ]
   ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
   ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
   ∷ word [ [ υ ⨾ ἱ ] ⨾ [ ό ⨾ ς ] ]
   ∷ word [ [ ὃ ] ]
   ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
   ∷ word [ [ β ⨾ α ] ⨾ [ σ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ϊ ] ]
   ∷ word [ [ χ ⨾ ο ] ⨾ [ ƛ ⨾ ω ] ⨾ [ θ ⨾ ε ⨾ ὶ ⨾ ς ] ]
   ∷ []

-- νοῦσον ἀνὰ στρατὸν ὄρσε κακήν, ὀλέκοντο δὲ λαοί,
v10 : Verse
v10 = word [ [ ν ⨾ ο ⨾ ῦ ] ⨾ [ σ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ὰ ] ]
    ∷ word [ [ σ ⨾ τ ⨾ ρ ⨾ α ] ⨾ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ὄ ⨾ ρ ] ⨾ [ σ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ κ ⨾ ή ⨾ ν ] ]
    ∷ word [ [ ὀ ] ⨾ [ ƛ ⨾ έ ] ⨾ [ κ ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ ο ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ ƛ ⨾ α ] ⨾ [ ο ⨾ ί ] ]
    ∷ []

-- οὕνεκα τὸν Χρύσην ἠτίμασεν ἀρητῆρα
v11 : Verse
v11 = word [ [ ο ⨾ ὕ ] ⨾ [ ν ⨾ ε ] ⨾ [ κ ⨾ α ] ]
    ∷ word [ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ Χ ⨾ ρ ⨾ ύ ] ⨾ [ σ ⨾ η ⨾ ν ] ]
    ∷ word [ [ ἠ ] ⨾ [ τ ⨾ ί ] ⨾ [ μ ⨾ α ] ⨾ [ σ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ρ ⨾ η ] ⨾ [ τ ⨾ ῆ ] ⨾ [ ρ ⨾ α ] ]
    ∷ []

-- Ἀτρεΐδης· ὃ γὰρ ἦλθε θοὰς ἐπὶ νῆας Ἀχαιῶν
v12 : Verse
v12 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ⨾ ς ] ]
    ∷ word [ [ ὃ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ἦ ⨾ ƛ ] ⨾ [ θ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ο ] ⨾ [ ὰ ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ ν ⨾ ῆ ] ⨾ [ α ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ []

-- λυσόμενός τε θύγατρα φέρων τ᾽ ἀπερείσι᾽ ἄποινα,
v13 : Verse
v13 = word [ [ ƛ ⨾ υ ] ⨾ [ σ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ό ⨾ ς ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ύ ] ⨾ [ γ ⨾ α ] ⨾ [ τ ⨾ ρ ⨾ α ] ]
    ∷ word [ [ φ ⨾ έ ] ⨾ [ ρ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ἀ ] ⨾ [ π ⨾ ε ] ⨾ [ ρ ⨾ ε ⨾ ί ] ⨾ [ σ ⨾ ι ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ α ] ]
    ∷ []

-- στέμματ᾽ ἔχων ἐν χερσὶν ἑκηβόλου Ἀπόλλωνος
v14 : Verse
v14 = word [ [ σ ⨾ τ ⨾ έ ⨾ μ ] ⨾ [ μ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ χ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ἐ ⨾ ν ] ]
    ∷ word [ [ χ ⨾ ε ⨾ ρ ] ⨾ [ σ ⨾ ὶ ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ η ] ⨾ [ β ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ υ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ []

-- χρυσέῳ ἀνὰ σκήπτρῳ, καὶ λίσσετο πάντας Ἀχαιούς,
v15 : Verse
v15 = word [ [ χ ⨾ ρ ⨾ υ ] ⨾ [ σ ⨾ έ ] ⨾ [ ῳ ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ὰ ] ]
    ∷ word [ [ σ ⨾ κ ⨾ ή ⨾ π ] ⨾ [ τ ⨾ ρ ⨾ ῳ ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ƛ ⨾ ί ⨾ σ ] ⨾ [ σ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ π ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ α ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ύ ⨾ ς ] ]
    ∷ []

-- Ἀτρεΐδα δὲ μάλιστα δύω, κοσμήτορε λαῶν·
v16 : Verse
v16 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ α ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ μ ⨾ ά ] ⨾ [ ƛ ⨾ ι ] ⨾ [ σ ⨾ τ ⨾ α ] ]
    ∷ word [ [ δ ⨾ ύ ] ⨾ [ ω ] ]
    ∷ word [ [ κ ⨾ ο ] ⨾ [ σ ⨾ μ ⨾ ή ] ⨾ [ τ ⨾ ο ] ⨾ [ ρ ⨾ ε ] ]
    ∷ word [ [ ƛ ⨾ α ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ []

-- Ἀτρεΐδαι τε καὶ ἄλλοι ἐϋκνήμιδες Ἀχαιοί,
v17 : Verse
v17 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ α ⨾ ι ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ ƛ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ ἐ ] ⨾ [ ϋ ] ⨾ [ κ ⨾ ν ⨾ ή ] ⨾ [ μ ⨾ ι ] ⨾ [ δ ⨾ ε ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ί ] ]
    ∷ []

-- ὑμῖν μὲν θεοὶ δοῖεν Ὀλύμπια δώματ᾽ ἔχοντες
v18 : Verse
v18 = word [ [ ὑ ] ⨾ [ μ ⨾ ῖ ⨾ ν ] ]
    ∷ word [ [ μ ⨾ ὲ ⨾ ν ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ο ⨾ ὶ ] ]
    ∷ word [ [ δ ⨾ ο ⨾ ῖ ] ⨾ [ ε ⨾ ν ] ]
    ∷ word [ [ Ὀ ] ⨾ [ ƛ ⨾ ύ ⨾ μ ] ⨾ [ π ⨾ ι ] ⨾ [ α ] ]
    ∷ word [ [ δ ⨾ ώ ] ⨾ [ μ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ χ ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ ε ⨾ ς ] ]
    ∷ []

-- ἐκπέρσαι Πριάμοιο πόλιν, εὖ δ᾽ οἴκαδ᾽ ἱκέσθαι·
v19 : Verse
v19 = word [ [ ἐ ⨾ κ ] ⨾ [ π ⨾ έ ⨾ ρ ] ⨾ [ σ ⨾ α ⨾ ι ] ]
    ∷ word [ [ Π ⨾ ρ ⨾ ι ] ⨾ [ ά ] ⨾ [ μ ⨾ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ word [ [ π ⨾ ό ] ⨾ [ ƛ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ε ⨾ ὖ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ο ⨾ ἴ ] ⨾ [ κ ⨾ α ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἱ ] ⨾ [ κ ⨾ έ ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
    ∷ []

-- παῖδα δ᾽ ἐμοὶ λύσαιτε φίλην, τὰ δ᾽ ἄποινα δέχεσθαι,
v20 : Verse
v20 = word [ [ π ⨾ α ⨾ ῖ ] ⨾ [ δ ⨾ α ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἐ ] ⨾ [ μ ⨾ ο ⨾ ὶ ] ]
    ∷ word [ [ ƛ ⨾ ύ ] ⨾ [ σ ⨾ α ⨾ ι ] ⨾ [ τ ⨾ ε ] ]
    ∷ word [ [ φ ⨾ ί ] ⨾ [ ƛ ⨾ η ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ὰ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἄ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ δ ⨾ έ ] ⨾ [ χ ⨾ ε ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
    ∷ []

-- ἁζόμενοι Διὸς υἱὸν ἑκηβόλον Ἀπόλλωνα.
v21 : Verse
v21 = word [ [ ἁ ] ⨾ [ ζ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ι ] ]
    ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
    ∷ word [ [ υ ⨾ ἱ ] ⨾ [ ὸ ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ η ] ⨾ [ β ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ α ] ]
    ∷ []

-- ἔνθ᾽ ἄλλοι μὲν πάντες ἐπευφήμησαν Ἀχαιοὶ
v22 : Verse
v22 = word [ [ ἔ ⨾ ν ⨾ θ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ ƛ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ μ ⨾ ὲ ⨾ ν ] ]
    ∷ word [ [ π ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ ε ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ε ⨾ υ ] ⨾ [ φ ⨾ ή ] ⨾ [ μ ⨾ η ] ⨾ [ σ ⨾ α ⨾ ν ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ὶ ] ]
    ∷ []

-- αἰδεῖσθαί θ᾽ ἱερῆα καὶ ἀγλαὰ δέχθαι ἄποινα·
v23 : Verse
v23 = word [ [ α ⨾ ἰ ] ⨾ [ δ ⨾ ε ⨾ ῖ ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ί ] ]
    ∷ word [ [ θ ⨾ ᾽ ⨾ ἱ ] ⨾ [ ε ] ⨾ [ ρ ⨾ ῆ ] ⨾ [ α ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ἀ ] ⨾ [ γ ⨾ ƛ ⨾ α ] ⨾ [ ὰ ] ]
    ∷ word [ [ δ ⨾ έ ⨾ χ ] ⨾ [ θ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἄ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ α ] ]
    ∷ []

-- ἀλλ᾽ οὐκ Ἀτρεΐδῃ Ἀγαμέμνονι ἥνδανε θυμῷ,
v24 : Verse
v24 = word [ [ ἀ ⨾ ƛ ⨾ ƛ ⨾ ᾽ ] ]
    ∷ word [ [ ο ⨾ ὐ ⨾ κ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ ῃ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ γ ⨾ α ] ⨾ [ μ ⨾ έ ] ⨾ [ μ ⨾ ν ⨾ ο ] ⨾ [ ν ⨾ ι ] ]
    ∷ word [ [ ἥ ⨾ ν ] ⨾ [ δ ⨾ α ] ⨾ [ ν ⨾ ε ] ]
    ∷ word [ [ θ ⨾ υ ] ⨾ [ μ ⨾ ῷ ] ]
    ∷ []

-- ἀλλὰ κακῶς ἀφίει, κρατερὸν δ᾽ ἐπὶ μῦθον ἔτελλε·
v25 : Verse
v25 = word [ [ ἀ ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ κ ⨾ ῶ ⨾ ς ] ]
    ∷ word [ [ ἀ ] ⨾ [ φ ⨾ ί ] ⨾ [ ε ⨾ ι ] ]
    ∷ word [ [ κ ⨾ ρ ⨾ α ] ⨾ [ τ ⨾ ε ] ⨾ [ ρ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ μ ⨾ ῦ ] ⨾ [ θ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἔ ] ⨾ [ τ ⨾ ε ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ] ]
    ∷ []

-- μή σε γέρον κοίλῃσιν ἐγὼ παρὰ νηυσὶ κιχείω
v26 : Verse
v26 = word [ [ μ ⨾ ή ] ]
    ∷ word [ [ σ ⨾ ε ] ]
    ∷ word [ [ γ ⨾ έ ] ⨾ [ ρ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ κ ⨾ ο ⨾ ί ] ⨾ [ ƛ ⨾ ῃ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ γ ⨾ ὼ ] ]
    ∷ word [ [ π ⨾ α ] ⨾ [ ρ ⨾ ὰ ] ]
    ∷ word [ [ ν ⨾ η ⨾ υ ] ⨾ [ σ ⨾ ὶ ] ]
    ∷ word [ [ κ ⨾ ι ] ⨾ [ χ ⨾ ε ⨾ ί ] ⨾ [ ω ] ]
    ∷ []

-- ἢ νῦν δηθύνοντ᾽ ἢ ὕστερον αὖτις ἰόντα,
v27 : Verse
v27 = word [ [ ἢ ] ]
    ∷ word [ [ ν ⨾ ῦ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ η ] ⨾ [ θ ⨾ ύ ] ⨾ [ ν ⨾ ο ⨾ ν ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἢ ] ]
    ∷ word [ [ ὕ ] ⨾ [ σ ⨾ τ ⨾ ε ] ⨾ [ ρ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ α ⨾ ὖ ] ⨾ [ τ ⨾ ι ⨾ ς ] ]
    ∷ word [ [ ἰ ] ⨾ [ ό ] ⨾ [ ν ⨾ τ ⨾ α ] ]
    ∷ []

-- μή νύ τοι οὐ χραίσμῃ σκῆπτρον καὶ στέμμα θεοῖο·
v28 : Verse
v28 = word [ [ μ ⨾ ή ] ]
    ∷ word [ [ ν ⨾ ύ ] ]
    ∷ word [ [ τ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ ο ⨾ ὐ ] ]
    ∷ word [ [ χ ⨾ ρ ⨾ α ⨾ ί ] ⨾ [ σ ⨾ μ ⨾ ῃ ] ]
    ∷ word [ [ σ ⨾ κ ⨾ ῆ ⨾ π ] ⨾ [ τ ⨾ ρ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ σ ⨾ τ ⨾ έ ⨾ μ ] ⨾ [ μ ⨾ α ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ο ⨾ ῖ ] ⨾ [ ο ] ]
    ∷ []

-- τὴν δ᾽ ἐγὼ οὐ λύσω· πρίν μιν καὶ γῆρας ἔπεισιν
v29 : Verse
v29 = word [ [ τ ⨾ ὴ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἐ ] ⨾ [ γ ⨾ ὼ ] ]
    ∷ word [ [ ο ⨾ ὐ ] ]
    ∷ word [ [ ƛ ⨾ ύ ] ⨾ [ σ ⨾ ω ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ί ⨾ ν ] ]
    ∷ word [ [ μ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ γ ⨾ ῆ ] ⨾ [ ρ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ἔ ] ⨾ [ π ⨾ ε ⨾ ι ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ []

-- ἡμετέρῳ ἐνὶ οἴκῳ ἐν Ἄργεϊ τηλόθι πάτρης
v30 : Verse
v30 = word [ [ ἡ ] ⨾ [ μ ⨾ ε ] ⨾ [ τ ⨾ έ ] ⨾ [ ρ ⨾ ῳ ] ]
    ∷ word [ [ ἐ ] ⨾ [ ν ⨾ ὶ ] ]
    ∷ word [ [ ο ⨾ ἴ ] ⨾ [ κ ⨾ ῳ ] ]
    ∷ word [ [ ἐ ⨾ ν ] ]
    ∷ word [ [ Ἄ ⨾ ρ ] ⨾ [ γ ⨾ ε ] ⨾ [ ϊ ] ]
    ∷ word [ [ τ ⨾ η ] ⨾ [ ƛ ⨾ ό ] ⨾ [ θ ⨾ ι ] ]
    ∷ word [ [ π ⨾ ά ] ⨾ [ τ ⨾ ρ ⨾ η ⨾ ς ] ]
    ∷ []

-- ἱστὸν ἐποιχομένην καὶ ἐμὸν λέχος ἀντιόωσαν·
v31 : Verse
v31 = word [ [ ἱ ] ⨾ [ σ ⨾ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ χ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ἐ ] ⨾ [ μ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ƛ ⨾ έ ] ⨾ [ χ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ τ ⨾ ι ] ⨾ [ ό ] ⨾ [ ω ] ⨾ [ σ ⨾ α ⨾ ν ] ]
    ∷ []

-- ἀλλ᾽ ἴθι μή μ᾽ ἐρέθιζε σαώτερος ὥς κε νέηαι.
v32 : Verse
v32 = word [ [ ἀ ⨾ ƛ ⨾ ƛ ⨾ ᾽ ] ]
    ∷ word [ [ ἴ ] ⨾ [ θ ⨾ ι ] ]
    ∷ word [ [ μ ⨾ ή ] ]
    ∷ word [ [ μ ⨾ ᾽ ⨾ ἐ ] ⨾ [ ρ ⨾ έ ] ⨾ [ θ ⨾ ι ] ⨾ [ ζ ⨾ ε ] ]
    ∷ word [ [ σ ⨾ α ] ⨾ [ ώ ] ⨾ [ τ ⨾ ε ] ⨾ [ ρ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ὥ ⨾ ς ] ]
    ∷ word [ [ κ ⨾ ε ] ]
    ∷ word [ [ ν ⨾ έ ] ⨾ [ η ] ⨾ [ α ⨾ ι ] ]
    ∷ []

-- ὣς ἔφατ᾽, ἔδεισεν δ᾽ ὃ γέρων καὶ ἐπείθετο μύθῳ·
v33 : Verse
v33 = word [ [ ὣ ⨾ ς ] ]
    ∷ word [ [ ἔ ] ⨾ [ φ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ δ ⨾ ε ⨾ ι ] ⨾ [ σ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ὃ ] ]
    ∷ word [ [ γ ⨾ έ ] ⨾ [ ρ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ε ⨾ ί ] ⨾ [ θ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ μ ⨾ ύ ] ⨾ [ θ ⨾ ῳ ] ]
    ∷ []

-- βῆ δ᾽ ἀκέων παρὰ θῖνα πολυφλοίσβοιο θαλάσσης·
v34 : Verse
v34 = word [ [ β ⨾ ῆ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἀ ] ⨾ [ κ ⨾ έ ] ⨾ [ ω ⨾ ν ] ]
    ∷ word [ [ π ⨾ α ] ⨾ [ ρ ⨾ ὰ ] ]
    ∷ word [ [ θ ⨾ ῖ ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ π ⨾ ο ] ⨾ [ ƛ ⨾ υ ] ⨾ [ φ ⨾ ƛ ⨾ ο ⨾ ί ] ⨾ [ σ ⨾ β ⨾ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ word [ [ θ ⨾ α ] ⨾ [ ƛ ⨾ ά ⨾ σ ] ⨾ [ σ ⨾ η ⨾ ς ] ]
    ∷ []

-- πολλὰ δ᾽ ἔπειτ᾽ ἀπάνευθε κιὼν ἠρᾶθ᾽ ὁ γεραιὸς
v35 : Verse
v35 = word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἔ ] ⨾ [ π ⨾ ε ⨾ ι ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ά ] ⨾ [ ν ⨾ ε ⨾ υ ] ⨾ [ θ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ ι ] ⨾ [ ὼ ⨾ ν ] ]
    ∷ word [ [ ἠ ] ⨾ [ ρ ⨾ ᾶ ⨾ θ ⨾ ᾽ ] ]
    ∷ word [ [ ὁ ] ]
    ∷ word [ [ γ ⨾ ε ] ⨾ [ ρ ⨾ α ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
    ∷ []

-- Ἀπόλλωνι ἄνακτι, τὸν ἠΰκομος τέκε Λητώ·
v36 : Verse
v36 = word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ ι ] ]
    ∷ word [ [ ἄ ] ⨾ [ ν ⨾ α ⨾ κ ] ⨾ [ τ ⨾ ι ] ]
    ∷ word [ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ἠ ] ⨾ [ ΰ ] ⨾ [ κ ⨾ ο ] ⨾ [ μ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ τ ⨾ έ ] ⨾ [ κ ⨾ ε ] ]
    ∷ word [ [ Λ ⨾ η ] ⨾ [ τ ⨾ ώ ] ]
    ∷ []

-- κλῦθί μευ ἀργυρότοξ᾽, ὃς Χρύσην ἀμφιβέβηκας
v37 : Verse
v37 = word [ [ κ ⨾ ƛ ⨾ ῦ ] ⨾ [ θ ⨾ ί ] ]
    ∷ word [ [ μ ⨾ ε ⨾ υ ] ]
    ∷ word [ [ ἀ ⨾ ρ ] ⨾ [ γ ⨾ υ ] ⨾ [ ρ ⨾ ό ] ⨾ [ τ ⨾ ο ⨾ ξ ⨾ ᾽ ] ]
    ∷ word [ [ ὃ ⨾ ς ] ]
    ∷ word [ [ Χ ⨾ ρ ⨾ ύ ] ⨾ [ σ ⨾ η ⨾ ν ] ]
    ∷ word [ [ ἀ ⨾ μ ] ⨾ [ φ ⨾ ι ] ⨾ [ β ⨾ έ ] ⨾ [ β ⨾ η ] ⨾ [ κ ⨾ α ⨾ ς ] ]
    ∷ []

-- Κίλλαν τε ζαθέην Τενέδοιό τε ἶφι ἀνάσσεις,
v38 : Verse
v38 = word [ [ Κ ⨾ ί ⨾ ƛ ] ⨾ [ ƛ ⨾ α ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ ζ ⨾ α ] ⨾ [ θ ⨾ έ ] ⨾ [ η ⨾ ν ] ]
    ∷ word [ [ Τ ⨾ ε ] ⨾ [ ν ⨾ έ ] ⨾ [ δ ⨾ ο ⨾ ι ] ⨾ [ ό ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ ἶ ] ⨾ [ φ ⨾ ι ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ά ⨾ σ ] ⨾ [ σ ⨾ ε ⨾ ι ⨾ ς ] ]
    ∷ []

-- Σμινθεῦ εἴ ποτέ τοι χαρίεντ᾽ ἐπὶ νηὸν ἔρεψα,
v39 : Verse
v39 = word [ [ Σ ⨾ μ ⨾ ι ⨾ ν ] ⨾ [ θ ⨾ ε ⨾ ῦ ] ]
    ∷ word [ [ ε ⨾ ἴ ] ]
    ∷ word [ [ π ⨾ ο ] ⨾ [ τ ⨾ έ ] ]
    ∷ word [ [ τ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ χ ⨾ α ] ⨾ [ ρ ⨾ ί ] ⨾ [ ε ⨾ ν ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ ν ⨾ η ] ⨾ [ ὸ ⨾ ν ] ]
    ∷ word [ [ ἔ ] ⨾ [ ρ ⨾ ε ] ⨾ [ ψ ⨾ α ] ]
    ∷ []

-- ἢ εἰ δή ποτέ τοι κατὰ πίονα μηρί᾽ ἔκηα
v40 : Verse
v40 = word [ [ ἢ ] ]
    ∷ word [ [ ε ⨾ ἰ ] ]
    ∷ word [ [ δ ⨾ ή ] ]
    ∷ word [ [ π ⨾ ο ] ⨾ [ τ ⨾ έ ] ]
    ∷ word [ [ τ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ τ ⨾ ὰ ] ]
    ∷ word [ [ π ⨾ ί ] ⨾ [ ο ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ μ ⨾ η ] ⨾ [ ρ ⨾ ί ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ κ ⨾ η ] ⨾ [ α ] ]
    ∷ []

-- ταύρων ἠδ᾽ αἰγῶν, τὸ δέ μοι κρήηνον ἐέλδωρ·
v41 : Verse
v41 = word [ [ τ ⨾ α ⨾ ύ ] ⨾ [ ρ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ἠ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ α ⨾ ἰ ] ⨾ [ γ ⨾ ῶ ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ὸ ] ]
    ∷ word [ [ δ ⨾ έ ] ]
    ∷ word [ [ μ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ κ ⨾ ρ ⨾ ή ] ⨾ [ η ] ⨾ [ ν ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ έ ⨾ ƛ ] ⨾ [ δ ⨾ ω ⨾ ρ ] ]
    ∷ []

-- τίσειαν Δαναοὶ ἐμὰ δάκρυα σοῖσι βέλεσσιν.
v42 : Verse
v42 = word [ [ τ ⨾ ί ] ⨾ [ σ ⨾ ε ⨾ ι ] ⨾ [ α ⨾ ν ] ]
    ∷ word [ [ Δ ⨾ α ] ⨾ [ ν ⨾ α ] ⨾ [ ο ⨾ ὶ ] ]
    ∷ word [ [ ἐ ] ⨾ [ μ ⨾ ὰ ] ]
    ∷ word [ [ δ ⨾ ά ] ⨾ [ κ ⨾ ρ ⨾ υ ] ⨾ [ α ] ]
    ∷ word [ [ σ ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ β ⨾ έ ] ⨾ [ ƛ ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ []

-- ὣς ἔφατ᾽ εὐχόμενος, τοῦ δ᾽ ἔκλυε Φοῖβος Ἀπόλλων,
v43 : Verse
v43 = word [ [ ὣ ⨾ ς ] ]
    ∷ word [ [ ἔ ] ⨾ [ φ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ε ⨾ ὐ ] ⨾ [ χ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ τ ⨾ ο ⨾ ῦ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἔ ] ⨾ [ κ ⨾ ƛ ⨾ υ ] ⨾ [ ε ] ]
    ∷ word [ [ Φ ⨾ ο ⨾ ῖ ] ⨾ [ β ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ⨾ ν ] ]
    ∷ []

-- βῆ δὲ κατ᾽ Οὐλύμποιο καρήνων χωόμενος κῆρ,
v44 : Verse
v44 = word [ [ β ⨾ ῆ ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ κ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ Ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ύ ⨾ μ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ ρ ⨾ ή ] ⨾ [ ν ⨾ ω ⨾ ν ] ]
    ∷ word [ [ χ ⨾ ω ] ⨾ [ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ κ ⨾ ῆ ⨾ ρ ] ]
    ∷ []

-- τόξ᾽ ὤμοισιν ἔχων ἀμφηρεφέα τε φαρέτρην·
v45 : Verse
v45 = word [ [ τ ⨾ ό ⨾ ξ ⨾ ᾽ ] ]
    ∷ word [ [ ὤ ] ⨾ [ μ ⨾ ο ⨾ ι ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἔ ] ⨾ [ χ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ἀ ⨾ μ ] ⨾ [ φ ⨾ η ] ⨾ [ ρ ⨾ ε ] ⨾ [ φ ⨾ έ ] ⨾ [ α ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ φ ⨾ α ] ⨾ [ ρ ⨾ έ ] ⨾ [ τ ⨾ ρ ⨾ η ⨾ ν ] ]
    ∷ []

-- ἔκλαγξαν δ᾽ ἄρ᾽ ὀϊστοὶ ἐπ᾽ ὤμων χωομένοιο,
v46 : Verse
v46 = word [ [ ἔ ] ⨾ [ κ ⨾ ƛ ⨾ α ⨾ γ ] ⨾ [ ξ ⨾ α ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἄ ⨾ ρ ⨾ ᾽ ] ]
    ∷ word [ [ ὀ ] ⨾ [ ϊ ] ⨾ [ σ ⨾ τ ⨾ ο ⨾ ὶ ] ]
    ∷ word [ [ ἐ ⨾ π ⨾ ᾽ ] ]
    ∷ word [ [ ὤ ] ⨾ [ μ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ χ ⨾ ω ] ⨾ [ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ []

-- αὐτοῦ κινηθέντος· ὃ δ᾽ ἤϊε νυκτὶ ἐοικώς.
v47 : Verse
v47 = word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ῦ ] ]
    ∷ word [ [ κ ⨾ ι ] ⨾ [ ν ⨾ η ] ⨾ [ θ ⨾ έ ] ⨾ [ ν ⨾ τ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ὃ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἤ ] ⨾ [ ϊ ] ⨾ [ ε ] ]
    ∷ word [ [ ν ⨾ υ ⨾ κ ] ⨾ [ τ ⨾ ὶ ] ]
    ∷ word [ [ ἐ ] ⨾ [ ο ⨾ ι ] ⨾ [ κ ⨾ ώ ⨾ ς ] ]
    ∷ []

-- ἕζετ᾽ ἔπειτ᾽ ἀπάνευθε νεῶν, μετὰ δ᾽ ἰὸν ἕηκε·
v48 : Verse
v48 = word [ [ ἕ ] ⨾ [ ζ ⨾ ε ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ π ⨾ ε ⨾ ι ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ά ] ⨾ [ ν ⨾ ε ⨾ υ ] ⨾ [ θ ⨾ ε ] ]
    ∷ word [ [ ν ⨾ ε ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ word [ [ μ ⨾ ε ] ⨾ [ τ ⨾ ὰ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἰ ] ⨾ [ ὸ ⨾ ν ] ]
    ∷ word [ [ ἕ ] ⨾ [ η ] ⨾ [ κ ⨾ ε ] ]
    ∷ []

-- δεινὴ δὲ κλαγγὴ γένετ᾽ ἀργυρέοιο βιοῖο·
v49 : Verse
v49 = word [ [ δ ⨾ ε ⨾ ι ] ⨾ [ ν ⨾ ὴ ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ κ ⨾ ƛ ⨾ α ⨾ γ ] ⨾ [ γ ⨾ ὴ ] ]
    ∷ word [ [ γ ⨾ έ ] ⨾ [ ν ⨾ ε ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἀ ⨾ ρ ] ⨾ [ γ ⨾ υ ] ⨾ [ ρ ⨾ έ ] ⨾ [ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ word [ [ β ⨾ ι ] ⨾ [ ο ⨾ ῖ ] ⨾ [ ο ] ]
    ∷ []

-- οὐρῆας μὲν πρῶτον ἐπῴχετο καὶ κύνας ἀργούς,
v50 : Verse
v50 = word [ [ ο ⨾ ὐ ] ⨾ [ ρ ⨾ ῆ ] ⨾ [ α ⨾ ς ] ]
    ∷ word [ [ μ ⨾ ὲ ⨾ ν ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ῶ ] ⨾ [ τ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ῴ ] ⨾ [ χ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ α ⨾ ς ] ]
    ∷ word [ [ ἀ ⨾ ρ ] ⨾ [ γ ⨾ ο ⨾ ύ ⨾ ς ] ]
    ∷ []

-- αὐτὰρ ἔπειτ᾽ αὐτοῖσι βέλος ἐχεπευκὲς ἐφιεὶς
v51 : Verse
v51 = word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ἔ ] ⨾ [ π ⨾ ε ⨾ ι ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ β ⨾ έ ] ⨾ [ ƛ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ χ ⨾ ε ] ⨾ [ π ⨾ ε ⨾ υ ] ⨾ [ κ ⨾ ὲ ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ φ ⨾ ι ] ⨾ [ ε ⨾ ὶ ⨾ ς ] ]
    ∷ []

-- βάλλ᾽· αἰεὶ δὲ πυραὶ νεκύων καίοντο θαμειαί.
v52 : Verse
v52 = word [ [ β ⨾ ά ⨾ ƛ ⨾ ƛ ⨾ ᾽ ] ]
    ∷ word [ [ α ⨾ ἰ ] ⨾ [ ε ⨾ ὶ ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ π ⨾ υ ] ⨾ [ ρ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ν ⨾ ε ] ⨾ [ κ ⨾ ύ ] ⨾ [ ω ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ί ] ⨾ [ ο ] ⨾ [ ν ⨾ τ ⨾ ο ] ]
    ∷ word [ [ θ ⨾ α ] ⨾ [ μ ⨾ ε ⨾ ι ] ⨾ [ α ⨾ ί ] ]
    ∷ []

-- ἐννῆμαρ μὲν ἀνὰ στρατὸν ᾤχετο κῆλα θεοῖο,
v53 : Verse
v53 = word [ [ ἐ ⨾ ν ] ⨾ [ ν ⨾ ῆ ] ⨾ [ μ ⨾ α ⨾ ρ ] ]
    ∷ word [ [ μ ⨾ ὲ ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ὰ ] ]
    ∷ word [ [ σ ⨾ τ ⨾ ρ ⨾ α ] ⨾ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ᾤ ] ⨾ [ χ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ κ ⨾ ῆ ] ⨾ [ ƛ ⨾ α ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ο ⨾ ῖ ] ⨾ [ ο ] ]
    ∷ []

-- τῇ δεκάτῃ δ᾽ ἀγορὴν δὲ καλέσσατο λαὸν Ἀχιλλεύς·
v54 : Verse
v54 = word [ [ τ ⨾ ῇ ] ]
    ∷ word [ [ δ ⨾ ε ] ⨾ [ κ ⨾ ά ] ⨾ [ τ ⨾ ῃ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἀ ] ⨾ [ γ ⨾ ο ] ⨾ [ ρ ⨾ ὴ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ ƛ ⨾ έ ⨾ σ ] ⨾ [ σ ⨾ α ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ ƛ ⨾ α ] ⨾ [ ὸ ⨾ ν ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
    ∷ []

-- τῷ γὰρ ἐπὶ φρεσὶ θῆκε θεὰ λευκώλενος Ἥρη·
v55 : Verse
v55 = word [ [ τ ⨾ ῷ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ φ ⨾ ρ ⨾ ε ] ⨾ [ σ ⨾ ὶ ] ]
    ∷ word [ [ θ ⨾ ῆ ] ⨾ [ κ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
    ∷ word [ [ ƛ ⨾ ε ⨾ υ ] ⨾ [ κ ⨾ ώ ] ⨾ [ ƛ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Ἥ ] ⨾ [ ρ ⨾ η ] ]
    ∷ []

-- κήδετο γὰρ Δαναῶν, ὅτι ῥα θνήσκοντας ὁρᾶτο.
v56 : Verse
v56 = word [ [ κ ⨾ ή ] ⨾ [ δ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ Δ ⨾ α ] ⨾ [ ν ⨾ α ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ word [ [ ὅ ] ⨾ [ τ ⨾ ι ] ]
    ∷ word [ [ ῥ ⨾ α ] ]
    ∷ word [ [ θ ⨾ ν ⨾ ή ] ⨾ [ σ ⨾ κ ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ὁ ] ⨾ [ ρ ⨾ ᾶ ] ⨾ [ τ ⨾ ο ] ]
    ∷ []

-- οἳ δ᾽ ἐπεὶ οὖν ἤγερθεν ὁμηγερέες τε γένοντο,
v57 : Verse
v57 = word [ [ ο ⨾ ἳ ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἐ ] ⨾ [ π ⨾ ε ⨾ ὶ ] ]
    ∷ word [ [ ο ⨾ ὖ ⨾ ν ] ]
    ∷ word [ [ ἤ ] ⨾ [ γ ⨾ ε ⨾ ρ ] ⨾ [ θ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ὁ ] ⨾ [ μ ⨾ η ] ⨾ [ γ ⨾ ε ] ⨾ [ ρ ⨾ έ ] ⨾ [ ε ⨾ ς ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ γ ⨾ έ ] ⨾ [ ν ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ ο ] ]
    ∷ []

-- τοῖσι δ᾽ ἀνιστάμενος μετέφη πόδας ὠκὺς Ἀχιλλεύς·
v58 : Verse
v58 = word [ [ τ ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἀ ] ⨾ [ ν ⨾ ι ] ⨾ [ σ ⨾ τ ⨾ ά ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ μ ⨾ ε ] ⨾ [ τ ⨾ έ ] ⨾ [ φ ⨾ η ] ]
    ∷ word [ [ π ⨾ ό ] ⨾ [ δ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ὠ ] ⨾ [ κ ⨾ ὺ ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
    ∷ []

-- Ἀτρεΐδη νῦν ἄμμε παλιμπλαγχθέντας ὀΐω
v59 : Verse
v59 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ] ]
    ∷ word [ [ ν ⨾ ῦ ⨾ ν ] ]
    ∷ word [ [ ἄ ⨾ μ ] ⨾ [ μ ⨾ ε ] ]
    ∷ word [ [ π ⨾ α ] ⨾ [ ƛ ⨾ ι ⨾ μ ] ⨾ [ π ⨾ ƛ ⨾ α ⨾ γ ⨾ χ ] ⨾ [ θ ⨾ έ ] ⨾ [ ν ⨾ τ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ὀ ] ⨾ [ ΐ ] ⨾ [ ω ] ]
    ∷ []

-- ἂψ ἀπονοστήσειν, εἴ κεν θάνατόν γε φύγοιμεν,
v60 : Verse
v60 = word [ [ ἂ ⨾ ψ ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ο ] ⨾ [ ν ⨾ ο ] ⨾ [ σ ⨾ τ ⨾ ή ] ⨾ [ σ ⨾ ε ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ε ⨾ ἴ ] ]
    ∷ word [ [ κ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ θ ⨾ ά ] ⨾ [ ν ⨾ α ] ⨾ [ τ ⨾ ό ⨾ ν ] ]
    ∷ word [ [ γ ⨾ ε ] ]
    ∷ word [ [ φ ⨾ ύ ] ⨾ [ γ ⨾ ο ⨾ ι ] ⨾ [ μ ⨾ ε ⨾ ν ] ]
    ∷ []

-- εἰ δὴ ὁμοῦ πόλεμός τε δαμᾷ καὶ λοιμὸς Ἀχαιούς·
v61 : Verse
v61 = word [ [ ε ⨾ ἰ ] ]
    ∷ word [ [ δ ⨾ ὴ ] ]
    ∷ word [ [ ὁ ] ⨾ [ μ ⨾ ο ⨾ ῦ ] ]
    ∷ word [ [ π ⨾ ό ] ⨾ [ ƛ ⨾ ε ] ⨾ [ μ ⨾ ό ⨾ ς ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ δ ⨾ α ] ⨾ [ μ ⨾ ᾷ ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ƛ ⨾ ο ⨾ ι ] ⨾ [ μ ⨾ ὸ ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ύ ⨾ ς ] ]
    ∷ []

-- ἀλλ᾽ ἄγε δή τινα μάντιν ἐρείομεν ἢ ἱερῆα
v62 : Verse
v62 = word [ [ ἀ ⨾ ƛ ⨾ ƛ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ] ⨾ [ γ ⨾ ε ] ]
    ∷ word [ [ δ ⨾ ή ] ]
    ∷ word [ [ τ ⨾ ι ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ μ ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ ρ ⨾ ε ⨾ ί ] ⨾ [ ο ] ⨾ [ μ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ἢ ] ]
    ∷ word [ [ ἱ ] ⨾ [ ε ] ⨾ [ ρ ⨾ ῆ ] ⨾ [ α ] ]
    ∷ []

-- ἢ καὶ ὀνειροπόλον, καὶ γάρ τ᾽ ὄναρ ἐκ Διός ἐστιν,
v63 : Verse
v63 = word [ [ ἢ ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ὀ ] ⨾ [ ν ⨾ ε ⨾ ι ] ⨾ [ ρ ⨾ ο ] ⨾ [ π ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ γ ⨾ ά ⨾ ρ ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ὄ ] ⨾ [ ν ⨾ α ⨾ ρ ] ]
    ∷ word [ [ ἐ ⨾ κ ] ]
    ∷ word [ [ Δ ⨾ ι ] ⨾ [ ό ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ σ ⨾ τ ⨾ ι ⨾ ν ] ]
    ∷ []

-- ὅς κ᾽ εἴποι ὅ τι τόσσον ἐχώσατο Φοῖβος Ἀπόλλων,
v64 : Verse
v64 = word [ [ ὅ ⨾ ς ] ]
    ∷ word [ [ κ ⨾ ᾽ ⨾ ε ⨾ ἴ ] ⨾ [ π ⨾ ο ⨾ ι ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ τ ⨾ ι ] ]
    ∷ word [ [ τ ⨾ ό ⨾ σ ] ⨾ [ σ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ χ ⨾ ώ ] ⨾ [ σ ⨾ α ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ Φ ⨾ ο ⨾ ῖ ] ⨾ [ β ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ⨾ ν ] ]
    ∷ []

-- εἴτ᾽ ἄρ᾽ ὅ γ᾽ εὐχωλῆς ἐπιμέμφεται ἠδ᾽ ἑκατόμβης,
v65 : Verse
v65 = word [ [ ε ⨾ ἴ ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ⨾ ρ ⨾ ᾽ ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ γ ⨾ ᾽ ⨾ ε ⨾ ὐ ] ⨾ [ χ ⨾ ω ] ⨾ [ ƛ ⨾ ῆ ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ι ] ⨾ [ μ ⨾ έ ⨾ μ ] ⨾ [ φ ⨾ ε ] ⨾ [ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἠ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ α ] ⨾ [ τ ⨾ ό ⨾ μ ] ⨾ [ β ⨾ η ⨾ ς ] ]
    ∷ []

-- αἴ κέν πως ἀρνῶν κνίσης αἰγῶν τε τελείων
v66 : Verse
v66 = word [ [ α ⨾ ἴ ] ]
    ∷ word [ [ κ ⨾ έ ⨾ ν ] ]
    ∷ word [ [ π ⨾ ω ⨾ ς ] ]
    ∷ word [ [ ἀ ⨾ ρ ] ⨾ [ ν ⨾ ῶ ⨾ ν ] ]
    ∷ word [ [ κ ⨾ ν ⨾ ί ] ⨾ [ σ ⨾ η ⨾ ς ] ]
    ∷ word [ [ α ⨾ ἰ ] ⨾ [ γ ⨾ ῶ ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ω ⨾ ν ] ]
    ∷ []

-- βούλεται ἀντιάσας ἡμῖν ἀπὸ λοιγὸν ἀμῦναι.
v67 : Verse
v67 = word [ [ β ⨾ ο ⨾ ύ ] ⨾ [ ƛ ⨾ ε ] ⨾ [ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ τ ⨾ ι ] ⨾ [ ά ] ⨾ [ σ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ἡ ] ⨾ [ μ ⨾ ῖ ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ὸ ] ]
    ∷ word [ [ ƛ ⨾ ο ⨾ ι ] ⨾ [ γ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ μ ⨾ ῦ ] ⨾ [ ν ⨾ α ⨾ ι ] ]
    ∷ []

-- ἤτοι ὅ γ᾽ ὣς εἰπὼν κατ᾽ ἄρ᾽ ἕζετο· τοῖσι δ᾽ ἀνέστη
v68 : Verse
v68 = word [ [ ἤ ] ⨾ [ τ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ γ ⨾ ᾽ ⨾ ὣ ⨾ ς ] ]
    ∷ word [ [ ε ⨾ ἰ ] ⨾ [ π ⨾ ὼ ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ⨾ ρ ⨾ ᾽ ] ]
    ∷ word [ [ ἕ ] ⨾ [ ζ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ τ ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἀ ] ⨾ [ ν ⨾ έ ] ⨾ [ σ ⨾ τ ⨾ η ] ]
    ∷ []

-- Κάλχας Θεστορίδης οἰωνοπόλων ὄχ᾽ ἄριστος,
v69 : Verse
v69 = word [ [ Κ ⨾ ά ⨾ ƛ ] ⨾ [ χ ⨾ α ⨾ ς ] ]
    ∷ word [ [ Θ ⨾ ε ] ⨾ [ σ ⨾ τ ⨾ ο ] ⨾ [ ρ ⨾ ί ] ⨾ [ δ ⨾ η ⨾ ς ] ]
    ∷ word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ] ⨾ [ π ⨾ ό ] ⨾ [ ƛ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ὄ ⨾ χ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ] ⨾ [ ρ ⨾ ι ] ⨾ [ σ ⨾ τ ⨾ ο ⨾ ς ] ]
    ∷ []

-- ὃς ᾔδη τά τ᾽ ἐόντα τά τ᾽ ἐσσόμενα πρό τ᾽ ἐόντα,
v70 : Verse
v70 = word [ [ ὃ ⨾ ς ] ]
    ∷ word [ [ ᾔ ] ⨾ [ δ ⨾ η ] ]
    ∷ word [ [ τ ⨾ ά ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ἐ ] ⨾ [ ό ] ⨾ [ ν ⨾ τ ⨾ α ] ]
    ∷ word [ [ τ ⨾ ά ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ἐ ⨾ σ ] ⨾ [ σ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ό ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ἐ ] ⨾ [ ό ] ⨾ [ ν ⨾ τ ⨾ α ] ]
    ∷ []

-- καὶ νήεσσ᾽ ἡγήσατ᾽ Ἀχαιῶν Ἴλιον εἴσω
v71 : Verse
v71 = word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ν ⨾ ή ] ⨾ [ ε ⨾ σ ⨾ σ ⨾ ᾽ ] ]
    ∷ word [ [ ἡ ] ⨾ [ γ ⨾ ή ] ⨾ [ σ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ word [ [ Ἴ ] ⨾ [ ƛ ⨾ ι ] ⨾ [ ο ⨾ ν ] ]
    ∷ word [ [ ε ⨾ ἴ ] ⨾ [ σ ⨾ ω ] ]
    ∷ []

-- ἣν διὰ μαντοσύνην, τήν οἱ πόρε Φοῖβος Ἀπόλλων·
v72 : Verse
v72 = word [ [ ἣ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ι ] ⨾ [ ὰ ] ]
    ∷ word [ [ μ ⨾ α ] ⨾ [ ν ⨾ τ ⨾ ο ] ⨾ [ σ ⨾ ύ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
    ∷ word [ [ τ ⨾ ή ⨾ ν ] ]
    ∷ word [ [ ο ⨾ ἱ ] ]
    ∷ word [ [ π ⨾ ό ] ⨾ [ ρ ⨾ ε ] ]
    ∷ word [ [ Φ ⨾ ο ⨾ ῖ ] ⨾ [ β ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ⨾ ν ] ]
    ∷ []

-- ὅ σφιν ἐὺ φρονέων ἀγορήσατο καὶ μετέειπεν·
v73 : Verse
v73 = word [ [ ὅ ] ]
    ∷ word [ [ σ ⨾ φ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἐ ⨾ ὺ ] ]
    ∷ word [ [ φ ⨾ ρ ⨾ ο ] ⨾ [ ν ⨾ έ ] ⨾ [ ω ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ γ ⨾ ο ] ⨾ [ ρ ⨾ ή ] ⨾ [ σ ⨾ α ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ μ ⨾ ε ] ⨾ [ τ ⨾ έ ] ⨾ [ ε ⨾ ι ] ⨾ [ π ⨾ ε ⨾ ν ] ]
    ∷ []

-- ὦ Ἀχιλεῦ κέλεαί με Διῒ φίλε μυθήσασθαι
v74 : Verse
v74 = word [ [ ὦ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ε ⨾ ῦ ] ]
    ∷ word [ [ κ ⨾ έ ] ⨾ [ ƛ ⨾ ε ] ⨾ [ α ⨾ ί ] ]
    ∷ word [ [ μ ⨾ ε ] ]
    ∷ word [ [ Δ ⨾ ι ] ⨾ [ ῒ ] ]
    ∷ word [ [ φ ⨾ ί ] ⨾ [ ƛ ⨾ ε ] ]
    ∷ word [ [ μ ⨾ υ ] ⨾ [ θ ⨾ ή ] ⨾ [ σ ⨾ α ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
    ∷ []

-- μῆνιν Ἀπόλλωνος ἑκατηβελέταο ἄνακτος·
v75 : Verse
v75 = word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ α ] ⨾ [ τ ⨾ η ] ⨾ [ β ⨾ ε ] ⨾ [ ƛ ⨾ έ ] ⨾ [ τ ⨾ α ] ⨾ [ ο ] ]
    ∷ word [ [ ἄ ] ⨾ [ ν ⨾ α ⨾ κ ] ⨾ [ τ ⨾ ο ⨾ ς ] ]
    ∷ []

-- τοὶ γὰρ ἐγὼν ἐρέω· σὺ δὲ σύνθεο καί μοι ὄμοσσον
v76 : Verse
v76 = word [ [ τ ⨾ ο ⨾ ὶ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ἐ ] ⨾ [ γ ⨾ ὼ ⨾ ν ] ]
    ∷ word [ [ ἐ ] ⨾ [ ρ ⨾ έ ] ⨾ [ ω ] ]
    ∷ word [ [ σ ⨾ ὺ ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ σ ⨾ ύ ⨾ ν ] ⨾ [ θ ⨾ ε ] ⨾ [ ο ] ]
    ∷ word [ [ κ ⨾ α ⨾ ί ] ]
    ∷ word [ [ μ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ ὄ ] ⨾ [ μ ⨾ ο ⨾ σ ] ⨾ [ σ ⨾ ο ⨾ ν ] ]
    ∷ []

-- ἦ μέν μοι πρόφρων ἔπεσιν καὶ χερσὶν ἀρήξειν·
v77 : Verse
v77 = word [ [ ἦ ] ]
    ∷ word [ [ μ ⨾ έ ⨾ ν ] ]
    ∷ word [ [ μ ⨾ ο ⨾ ι ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ό ] ⨾ [ φ ⨾ ρ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ἔ ] ⨾ [ π ⨾ ε ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ χ ⨾ ε ⨾ ρ ] ⨾ [ σ ⨾ ὶ ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ρ ⨾ ή ] ⨾ [ ξ ⨾ ε ⨾ ι ⨾ ν ] ]
    ∷ []

-- ἦ γὰρ ὀΐομαι ἄνδρα χολωσέμεν, ὃς μέγα πάντων
v78 : Verse
v78 = word [ [ ἦ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ὀ ] ⨾ [ ΐ ] ⨾ [ ο ] ⨾ [ μ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἄ ⨾ ν ] ⨾ [ δ ⨾ ρ ⨾ α ] ]
    ∷ word [ [ χ ⨾ ο ] ⨾ [ ƛ ⨾ ω ] ⨾ [ σ ⨾ έ ] ⨾ [ μ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ὃ ⨾ ς ] ]
    ∷ word [ [ μ ⨾ έ ] ⨾ [ γ ⨾ α ] ]
    ∷ word [ [ π ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ ω ⨾ ν ] ]
    ∷ []

-- Ἀργείων κρατέει καί οἱ πείθονται Ἀχαιοί·
v79 : Verse
v79 = word [ [ Ἀ ⨾ ρ ] ⨾ [ γ ⨾ ε ⨾ ί ] ⨾ [ ω ⨾ ν ] ]
    ∷ word [ [ κ ⨾ ρ ⨾ α ] ⨾ [ τ ⨾ έ ] ⨾ [ ε ⨾ ι ] ]
    ∷ word [ [ κ ⨾ α ⨾ ί ] ]
    ∷ word [ [ ο ⨾ ἱ ] ]
    ∷ word [ [ π ⨾ ε ⨾ ί ] ⨾ [ θ ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ί ] ]
    ∷ []

-- κρείσσων γὰρ βασιλεὺς ὅτε χώσεται ἀνδρὶ χέρηϊ·
v80 : Verse
v80 = word [ [ κ ⨾ ρ ⨾ ε ⨾ ί ⨾ σ ] ⨾ [ σ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ β ⨾ α ] ⨾ [ σ ⨾ ι ] ⨾ [ ƛ ⨾ ε ⨾ ὺ ⨾ ς ] ]
    ∷ word [ [ ὅ ] ⨾ [ τ ⨾ ε ] ]
    ∷ word [ [ χ ⨾ ώ ] ⨾ [ σ ⨾ ε ] ⨾ [ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἀ ⨾ ν ] ⨾ [ δ ⨾ ρ ⨾ ὶ ] ]
    ∷ word [ [ χ ⨾ έ ] ⨾ [ ρ ⨾ η ] ⨾ [ ϊ ] ]
    ∷ []

-- εἴ περ γάρ τε χόλον γε καὶ αὐτῆμαρ καταπέψῃ,
v81 : Verse
v81 = word [ [ ε ⨾ ἴ ] ]
    ∷ word [ [ π ⨾ ε ⨾ ρ ] ]
    ∷ word [ [ γ ⨾ ά ⨾ ρ ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ χ ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ γ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ῆ ] ⨾ [ μ ⨾ α ⨾ ρ ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ τ ⨾ α ] ⨾ [ π ⨾ έ ] ⨾ [ ψ ⨾ ῃ ] ]
    ∷ []

-- ἀλλά τε καὶ μετόπισθεν ἔχει κότον, ὄφρα τελέσσῃ,
v82 : Verse
v82 = word [ [ ἀ ⨾ ƛ ] ⨾ [ ƛ ⨾ ά ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ μ ⨾ ε ] ⨾ [ τ ⨾ ό ] ⨾ [ π ⨾ ι ] ⨾ [ σ ⨾ θ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ἔ ] ⨾ [ χ ⨾ ε ⨾ ι ] ]
    ∷ word [ [ κ ⨾ ό ] ⨾ [ τ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ὄ ] ⨾ [ φ ⨾ ρ ⨾ α ] ]
    ∷ word [ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ έ ⨾ σ ] ⨾ [ σ ⨾ ῃ ] ]
    ∷ []

-- ἐν στήθεσσιν ἑοῖσι· σὺ δὲ φράσαι εἴ με σαώσεις.
v83 : Verse
v83 = word [ [ ἐ ⨾ ν ] ]
    ∷ word [ [ σ ⨾ τ ⨾ ή ] ⨾ [ θ ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ σ ⨾ ὺ ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ φ ⨾ ρ ⨾ ά ] ⨾ [ σ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ε ⨾ ἴ ] ]
    ∷ word [ [ μ ⨾ ε ] ]
    ∷ word [ [ σ ⨾ α ] ⨾ [ ώ ] ⨾ [ σ ⨾ ε ⨾ ι ⨾ ς ] ]
    ∷ []

-- τὸν δ᾽ ἀπαμειβόμενος προσέφη πόδας ὠκὺς Ἀχιλλεύς·
v84 : Verse
v84 = word [ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ δ ⨾ ᾽ ⨾ ἀ ] ⨾ [ π ⨾ α ] ⨾ [ μ ⨾ ε ⨾ ι ] ⨾ [ β ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ σ ⨾ έ ] ⨾ [ φ ⨾ η ] ]
    ∷ word [ [ π ⨾ ό ] ⨾ [ δ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ὠ ] ⨾ [ κ ⨾ ὺ ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
    ∷ []

-- θαρσήσας μάλα εἰπὲ θεοπρόπιον ὅ τι οἶσθα·
v85 : Verse
v85 = word [ [ θ ⨾ α ⨾ ρ ] ⨾ [ σ ⨾ ή ] ⨾ [ σ ⨾ α ⨾ ς ] ]
    ∷ word [ [ μ ⨾ ά ] ⨾ [ ƛ ⨾ α ] ]
    ∷ word [ [ ε ⨾ ἰ ] ⨾ [ π ⨾ ὲ ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ο ] ⨾ [ π ⨾ ρ ⨾ ό ] ⨾ [ π ⨾ ι ] ⨾ [ ο ⨾ ν ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ τ ⨾ ι ] ]
    ∷ word [ [ ο ⨾ ἶ ] ⨾ [ σ ⨾ θ ⨾ α ] ]
    ∷ []

-- οὐ μὰ γὰρ Ἀπόλλωνα Διῒ φίλον, ᾧ τε σὺ Κάλχαν
v86 : Verse
v86 = word [ [ ο ⨾ ὐ ] ]
    ∷ word [ [ μ ⨾ ὰ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ Δ ⨾ ι ] ⨾ [ ῒ ] ]
    ∷ word [ [ φ ⨾ ί ] ⨾ [ ƛ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ᾧ ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ σ ⨾ ὺ ] ]
    ∷ word [ [ Κ ⨾ ά ⨾ ƛ ] ⨾ [ χ ⨾ α ⨾ ν ] ]
    ∷ []

-- εὐχόμενος Δαναοῖσι θεοπροπίας ἀναφαίνεις,
v87 : Verse
v87 = word [ [ ε ⨾ ὐ ] ⨾ [ χ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Δ ⨾ α ] ⨾ [ ν ⨾ α ] ⨾ [ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ] ]
    ∷ word [ [ θ ⨾ ε ] ⨾ [ ο ] ⨾ [ π ⨾ ρ ⨾ ο ] ⨾ [ π ⨾ ί ] ⨾ [ α ⨾ ς ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ α ] ⨾ [ φ ⨾ α ⨾ ί ] ⨾ [ ν ⨾ ε ⨾ ι ⨾ ς ] ]
    ∷ []

-- οὔ τις ἐμεῦ ζῶντος καὶ ἐπὶ χθονὶ δερκομένοιο
v88 : Verse
v88 = word [ [ ο ⨾ ὔ ] ]
    ∷ word [ [ τ ⨾ ι ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ μ ⨾ ε ⨾ ῦ ] ]
    ∷ word [ [ ζ ⨾ ῶ ] ⨾ [ ν ⨾ τ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ χ ⨾ θ ⨾ ο ] ⨾ [ ν ⨾ ὶ ] ]
    ∷ word [ [ δ ⨾ ε ⨾ ρ ] ⨾ [ κ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ ο ⨾ ι ] ⨾ [ ο ] ]
    ∷ []

-- σοὶ κοίλῃς παρὰ νηυσί βαρείας χεῖρας ἐποίσει
v89 : Verse
v89 = word [ [ σ ⨾ ο ⨾ ὶ ] ]
    ∷ word [ [ κ ⨾ ο ⨾ ί ] ⨾ [ ƛ ⨾ ῃ ⨾ ς ] ]
    ∷ word [ [ π ⨾ α ] ⨾ [ ρ ⨾ ὰ ] ]
    ∷ word [ [ ν ⨾ η ⨾ υ ] ⨾ [ σ ⨾ ί ] ]
    ∷ word [ [ β ⨾ α ] ⨾ [ ρ ⨾ ε ⨾ ί ] ⨾ [ α ⨾ ς ] ]
    ∷ word [ [ χ ⨾ ε ⨾ ῖ ] ⨾ [ ρ ⨾ α ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ο ⨾ ί ] ⨾ [ σ ⨾ ε ⨾ ι ] ]
    ∷ []

-- συμπάντων Δαναῶν, οὐδ᾽ ἢν Ἀγαμέμνονα εἴπῃς,
v90 : Verse
v90 = word [ [ σ ⨾ υ ⨾ μ ] ⨾ [ π ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ Δ ⨾ α ] ⨾ [ ν ⨾ α ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ word [ [ ο ⨾ ὐ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἢ ⨾ ν ] ]
    ∷ word [ [ Ἀ ] ⨾ [ γ ⨾ α ] ⨾ [ μ ⨾ έ ] ⨾ [ μ ⨾ ν ⨾ ο ] ⨾ [ ν ⨾ α ] ]
    ∷ word [ [ ε ⨾ ἴ ] ⨾ [ π ⨾ ῃ ⨾ ς ] ]
    ∷ []

-- ὃς νῦν πολλὸν ἄριστος Ἀχαιῶν εὔχεται εἶναι.
v91 : Verse
v91 = word [ [ ὃ ⨾ ς ] ]
    ∷ word [ [ ν ⨾ ῦ ⨾ ν ] ]
    ∷ word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ἄ ] ⨾ [ ρ ⨾ ι ] ⨾ [ σ ⨾ τ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ word [ [ ε ⨾ ὔ ] ⨾ [ χ ⨾ ε ] ⨾ [ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ε ⨾ ἶ ] ⨾ [ ν ⨾ α ⨾ ι ] ]
    ∷ []

-- καὶ τότε δὴ θάρσησε καὶ ηὔδα μάντις ἀμύμων·
v92 : Verse
v92 = word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ τ ⨾ ό ] ⨾ [ τ ⨾ ε ] ]
    ∷ word [ [ δ ⨾ ὴ ] ]
    ∷ word [ [ θ ⨾ ά ⨾ ρ ] ⨾ [ σ ⨾ η ] ⨾ [ σ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ η ⨾ ὔ ] ⨾ [ δ ⨾ α ] ]
    ∷ word [ [ μ ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ ι ⨾ ς ] ]
    ∷ word [ [ ἀ ] ⨾ [ μ ⨾ ύ ] ⨾ [ μ ⨾ ω ⨾ ν ] ]
    ∷ []

-- οὔ τ᾽ ἄρ ὅ γ᾽ εὐχωλῆς ἐπιμέμφεται οὐδ᾽ ἑκατόμβης,
v93 : Verse
v93 = word [ [ ο ⨾ ὔ ] ]
    ∷ word [ [ τ ⨾ ᾽ ⨾ ἄ ⨾ ρ ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ γ ⨾ ᾽ ⨾ ε ⨾ ὐ ] ⨾ [ χ ⨾ ω ] ⨾ [ ƛ ⨾ ῆ ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ι ] ⨾ [ μ ⨾ έ ⨾ μ ] ⨾ [ φ ⨾ ε ] ⨾ [ τ ⨾ α ⨾ ι ] ]
    ∷ word [ [ ο ⨾ ὐ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ α ] ⨾ [ τ ⨾ ό ⨾ μ ] ⨾ [ β ⨾ η ⨾ ς ] ]
    ∷ []

-- ἀλλ᾽ ἕνεκ᾽ ἀρητῆρος ὃν ἠτίμησ᾽ Ἀγαμέμνων,
v94 : Verse
v94 = word [ [ ἀ ⨾ ƛ ⨾ ƛ ⨾ ᾽ ] ]
    ∷ word [ [ ἕ ] ⨾ [ ν ⨾ ε ⨾ κ ⨾ ᾽ ] ]
    ∷ word [ [ ἀ ] ⨾ [ ρ ⨾ η ] ⨾ [ τ ⨾ ῆ ] ⨾ [ ρ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ὃ ⨾ ν ] ]
    ∷ word [ [ ἠ ] ⨾ [ τ ⨾ ί ] ⨾ [ μ ⨾ η ⨾ σ ⨾ ᾽ ] ]
    ∷ word [ [ Ἀ ] ⨾ [ γ ⨾ α ] ⨾ [ μ ⨾ έ ] ⨾ [ μ ⨾ ν ⨾ ω ⨾ ν ] ]
    ∷ []

-- οὐδ᾽ ἀπέλυσε θύγατρα καὶ οὐκ ἀπεδέξατ᾽ ἄποινα,
v95 : Verse
v95 = word [ [ ο ⨾ ὐ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ έ ] ⨾ [ ƛ ⨾ υ ] ⨾ [ σ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ύ ] ⨾ [ γ ⨾ α ] ⨾ [ τ ⨾ ρ ⨾ α ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ο ⨾ ὐ ⨾ κ ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ε ] ⨾ [ δ ⨾ έ ] ⨾ [ ξ ⨾ α ⨾ τ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ α ] ]
    ∷ []

-- τοὔνεκ᾽ ἄρ᾽ ἄλγε᾽ ἔδωκεν ἑκηβόλος ἠδ᾽ ἔτι δώσει·
v96 : Verse
v96 = word [ [ τ ⨾ ο ⨾ ὔ ] ⨾ [ ν ⨾ ε ⨾ κ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ⨾ ρ ⨾ ᾽ ] ]
    ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ δ ⨾ ω ] ⨾ [ κ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ η ] ⨾ [ β ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ ς ] ]
    ∷ word [ [ ἠ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ἔ ] ⨾ [ τ ⨾ ι ] ]
    ∷ word [ [ δ ⨾ ώ ] ⨾ [ σ ⨾ ε ⨾ ι ] ]
    ∷ []

-- οὐδ᾽ ὅ γε πρὶν Δαναοῖσιν ἀεικέα λοιγὸν ἀπώσει
v97 : Verse
v97 = word [ [ ο ⨾ ὐ ⨾ δ ⨾ ᾽ ] ]
    ∷ word [ [ ὅ ] ]
    ∷ word [ [ γ ⨾ ε ] ]
    ∷ word [ [ π ⨾ ρ ⨾ ὶ ⨾ ν ] ]
    ∷ word [ [ Δ ⨾ α ] ⨾ [ ν ⨾ α ] ⨾ [ ο ⨾ ῖ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ε ⨾ ι ] ⨾ [ κ ⨾ έ ] ⨾ [ α ] ]
    ∷ word [ [ ƛ ⨾ ο ⨾ ι ] ⨾ [ γ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ π ⨾ ώ ] ⨾ [ σ ⨾ ε ⨾ ι ] ]
    ∷ []

-- πρίν γ᾽ ἀπὸ πατρὶ φίλῳ δόμεναι ἑλικώπιδα κούρην
v98 : Verse
v98 = word [ [ π ⨾ ρ ⨾ ί ⨾ ν ] ]
    ∷ word [ [ γ ⨾ ᾽ ⨾ ἀ ] ⨾ [ π ⨾ ὸ ] ]
    ∷ word [ [ π ⨾ α ] ⨾ [ τ ⨾ ρ ⨾ ὶ ] ]
    ∷ word [ [ φ ⨾ ί ] ⨾ [ ƛ ⨾ ῳ ] ]
    ∷ word [ [ δ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ α ⨾ ι ] ]
    ∷ word [ [ ἑ ] ⨾ [ ƛ ⨾ ι ] ⨾ [ κ ⨾ ώ ] ⨾ [ π ⨾ ι ] ⨾ [ δ ⨾ α ] ]
    ∷ word [ [ κ ⨾ ο ⨾ ύ ] ⨾ [ ρ ⨾ η ⨾ ν ] ]
    ∷ []

-- ἀπριάτην ἀνάποινον, ἄγειν θ᾽ ἱερὴν ἑκατόμβην
v99 : Verse
v99 = word [ [ ἀ ] ⨾ [ π ⨾ ρ ⨾ ι ] ⨾ [ ά ] ⨾ [ τ ⨾ η ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ά ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἄ ] ⨾ [ γ ⨾ ε ⨾ ι ⨾ ν ] ]
    ∷ word [ [ θ ⨾ ᾽ ⨾ ἱ ] ⨾ [ ε ] ⨾ [ ρ ⨾ ὴ ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ α ] ⨾ [ τ ⨾ ό ⨾ μ ] ⨾ [ β ⨾ η ⨾ ν ] ]
    ∷ []

-- ἐς Χρύσην· τότε κέν μιν ἱλασσάμενοι πεπίθοιμεν.
v100 : Verse
v100 = word [ [ ἐ ⨾ ς ] ]
     ∷ word [ [ Χ ⨾ ρ ⨾ ύ ] ⨾ [ σ ⨾ η ⨾ ν ] ]
     ∷ word [ [ τ ⨾ ό ] ⨾ [ τ ⨾ ε ] ]
     ∷ word [ [ κ ⨾ έ ⨾ ν ] ]
     ∷ word [ [ μ ⨾ ι ⨾ ν ] ]
     ∷ word [ [ ἱ ] ⨾ [ ƛ ⨾ α ⨾ σ ] ⨾ [ σ ⨾ ά ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ο ⨾ ι ] ]
     ∷ word [ [ π ⨾ ε ] ⨾ [ π ⨾ ί ] ⨾ [ θ ⨾ ο ⨾ ι ] ⨾ [ μ ⨾ ε ⨾ ν ] ]
     ∷ []

verses : Verses
verses
  = (-, v1)
  ∷ (-, v2)
  ∷ (-, v3)
  ∷ (-, v4)
  ∷ (-, v5)
  ∷ (-, v6)
  ∷ (-, v7)
  ∷ (-, v8)
  ∷ (-, v9)
  ∷ (-, v10)
  ∷ (-, v11)
  ∷ (-, v12)
  ∷ (-, v13)
  ∷ (-, v14)
  ∷ (-, v15)
  ∷ (-, v16)
  ∷ (-, v17)
  ∷ (-, v18)
  ∷ (-, v19)
  ∷ (-, v20)
  ∷ (-, v21)
  ∷ (-, v22)
  ∷ (-, v23)
  ∷ (-, v24)
  ∷ (-, v25)
  ∷ (-, v26)
  ∷ (-, v27)
  ∷ (-, v28)
  ∷ (-, v29)
  ∷ (-, v30)
  ∷ (-, v31)
  ∷ (-, v32)
  ∷ (-, v33)
  ∷ (-, v34)
  ∷ (-, v35)
  ∷ (-, v36)
  ∷ (-, v37)
  ∷ (-, v38)
  ∷ (-, v39)
  ∷ (-, v40)
  ∷ (-, v41)
  ∷ (-, v42)
  ∷ (-, v43)
  ∷ (-, v44)
  ∷ (-, v45)
  ∷ (-, v46)
  ∷ (-, v47)
  ∷ (-, v48)
  ∷ (-, v49)
  ∷ (-, v50)
  ∷ (-, v51)
  ∷ (-, v52)
  ∷ (-, v53)
  ∷ (-, v54)
  ∷ (-, v55)
  ∷ (-, v56)
  ∷ (-, v57)
  ∷ (-, v58)
  ∷ (-, v59)
  ∷ (-, v60)
  ∷ (-, v61)
  ∷ (-, v62)
  ∷ (-, v63)
  ∷ (-, v64)
  ∷ (-, v65)
  ∷ (-, v66)
  ∷ (-, v67)
  ∷ (-, v68)
  ∷ (-, v69)
  ∷ (-, v70)
  ∷ (-, v71)
  ∷ (-, v72)
  ∷ (-, v73)
  ∷ (-, v74)
  ∷ (-, v75)
  ∷ (-, v76)
  ∷ (-, v77)
  ∷ (-, v78)
  ∷ (-, v79)
  ∷ (-, v80)
  ∷ (-, v81)
  ∷ (-, v82)
  ∷ (-, v83)
  ∷ (-, v84)
  ∷ (-, v85)
  ∷ (-, v86)
  ∷ (-, v87)
  ∷ (-, v88)
  ∷ (-, v89)
  ∷ (-, v90)
  ∷ (-, v91)
  ∷ (-, v92)
  ∷ (-, v93)
  ∷ (-, v94)
  ∷ (-, v95)
  ∷ (-, v96)
  ∷ (-, v97)
  ∷ (-, v98)
  ∷ (-, v99)
  ∷ (-, v100)
  ∷ []
