{-# OPTIONS --safe #-}
module Iliagda.Verses where

open import Iliagda.Init
open import Iliagda.Morphology

-- μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος
v1 : Verse
v1 = word [ [ μ ⨾ ῆ ] ⨾ [ ν ⨾ ι ⨾ ν ] ]
   ∷ word [ [ ἄ ] ⨾ [ ε ⨾ ι ] ⨾ [ δ ⨾ ε ] ]
   ∷ word [ [ θ ⨾ ε ] ⨾ [ ὰ ] ]
   ∷ word [ [ Π ⨾ η ] ⨾ [ ƛ ⨾ η ] ⨾ [ ϊ ] ⨾ [ ά ] ⨾ [ δ ⨾ ε ] ⨾ [ ω ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ο ⨾ ς ] ]
   ∷ []

-- οὐλομένην, ἣ μυρί᾽ Ἀχαιοῖς ἄλγε᾽ ἔθηκε,
v2 : Verse
v2 = word [ [ ο ⨾ ὐ ] ⨾ [ ƛ ⨾ ο ] ⨾ [ μ ⨾ έ ] ⨾ [ ν ⨾ η ⨾ ν ] ]
   ∷ word [ [ ἣ ] ]
   ∷ word [ [ μ ⨾ υ ] ⨾ [ ρ ⨾ ί ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ῖ ⨾ ς ] ]
   ∷ word [ [ ἄ ⨾ ƛ ] ⨾ [ γ ⨾ ε ] ]
   ∷ word [ [ ἔ ] ⨾ [ θ ⨾ η ] ⨾ [ κ ⨾ ε ] ]
   ∷ []

-- πολλὰς δ᾽ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν
v3 : Verse
v3 = word [ [ π ⨾ ο ⨾ ƛ ] ⨾ [ ƛ ⨾ ὰ ⨾ ς ] ]
   ∷ word [ [ δ{-᾽-} ⨾ ἰ ⨾ φ ] ⨾ [ θ ⨾ ί ] ⨾ [ μ ⨾ ο ⨾ υ ⨾ ς ] ]
   ∷ word [ [ ψ ⨾ υ ] ⨾ [ χ ⨾ ὰ ⨾ ς ] ]
   ∷ word [  [ Ἄ ] ⨾ [ ϊ ] ⨾ [ δ ⨾ ι ] ]
   ∷ word [ [ π ⨾ ρ ⨾ ο ] ⨾ [ ΐ ] ⨾ [ α ] ⨾ [ ψ ⨾ ε ⨾ ν ] ]
   ∷ []

-- ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν
v4 : Verse
v4 = word [ [ ἡ ⨾ ρ ] ⨾ [ ώ ] ⨾ [ ω ⨾ ν ] ]
   ∷ word [ [ α ⨾ ὐ ] ⨾ [ τ ⨾ ο ⨾ ὺ ⨾ ς ] ]
   ∷ word [ [ δ ⨾ ὲ ] ]
   ∷ word [ [ ἑ ] ⨾ [ ƛ ⨾ ώ ] ⨾ [ ρ ⨾ ι ] ⨾ [ α ] ]
   ∷ word [ [ τ ⨾ ε ⨾ ῦ ] ⨾ [ χ ⨾ ε ] ]
   ∷ word [ [ κ ⨾ ύ ] ⨾ [ ν ⨾ ε ⨾ σ ] ⨾ [ σ ⨾ ι ⨾ ν ] ]
   ∷ []

-- οἰωνοῖσί τε πᾶσι, Διὸς δ᾽ ἐτελείετο βουλή,
v5 : Verse
v5 = word [ [ ο ⨾ ἰ ] ⨾ [ ω ] ⨾ [ ν ⨾ ο ⨾ ῖ ] ⨾ [ σ ⨾ ί ] ]
   ∷ word [ [ τ ⨾ ε ] ]
   ∷ word [ [ π ⨾ ᾶ ] ⨾ [ σ ⨾ ι ] ]
   ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
   ∷ word [ [ δ{-᾽-} ⨾ ἐ ] ⨾ [ τ ⨾ ε ] ⨾ [ ƛ ⨾ ε ⨾ ί ] ⨾ [ ε ] ⨾ [ τ ⨾ ο ] ]
   ∷ word [ [ β ⨾ ο ⨾ υ ] ⨾ [ ƛ ⨾ ή ] ]
   ∷ []

-- ἐξ οὗ δὴ τὰ πρῶτα διαστήτην ἐρίσαντε
v6 : Verse
v6 = word [ [ ἐ ⨾ ξ ] ]
   ∷ word [ [ ο ⨾ ὗ ] ]
   ∷ word [ [ δ ⨾ ὴ ] ]
   ∷ word [ [ τ ⨾ ὰ ] ]
   ∷ word [ [ π ⨾ ρ ⨾ ῶ ] ⨾ [ τ ⨾ α ] ]
   ∷ word [ [ δ ⨾ ι ] ⨾ [ α ] ⨾ [ σ ⨾ τ ⨾ ή ] ⨾ [ τ ⨾ η ⨾ ν ] ]
   ∷ word [ [ ἐ ] ⨾ [ ρ ⨾ ί ] ⨾ [ σ ⨾ α ] ⨾ [ ν ⨾ τ ⨾ ε ] ]
   ∷ []

-- Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς.
v7 : Verse
v7 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ⨾ ς ] ]
   ∷ word [ [ τ ⨾ ε ] ]
   ∷ word [ [ ἄ ] ⨾ [ ν ⨾ α ⨾ ξ ] ]
   ∷ word [ [ ἀ ⨾ ν ] ⨾ [ δ ⨾ ρ ⨾ ῶ ⨾ ν ] ]
   ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
   ∷ word [ [ δ ⨾ ῖ ] ⨾ [ ο ⨾ ς ] ]
   ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ ι ⨾ ƛ ] ⨾ [ ƛ ⨾ ε ⨾ ύ ⨾ ς ] ]
   ∷ []

-- τίς τ᾽ ἄρ σφωε θεῶν ἔριδι ξυνέηκε μάχεσθαι;
v8 : Verse
v8 = word [ [ τ ⨾ ί ⨾ ς ] ]
   ∷ word [ [ τ{-᾽-} ⨾ ἄ ⨾ ρ ] ]
   ∷ word [ [ σ ⨾ φ ⨾ ω ] ⨾ [ ε ] ]
   ∷ word [ [ θ ⨾ ε ] ⨾ [ ῶ ⨾ ν ] ]
   ∷ word [ [ ἔ ] ⨾ [ ρ ⨾ ι ] ⨾ [ δ ⨾ ι ] ]
   ∷ word [ [ ξ ⨾ υ ] ⨾ [ ν ⨾ έ ] ⨾ [ η ] ⨾ [ κ ⨾ ε ] ]
   ∷ word [ [ μ ⨾ ά ] ⨾ [ χ ⨾ ε ] ⨾ [ σ ⨾ θ ⨾ α ⨾ ι ] ]
   ∷ []

-- Λητοῦς καὶ Διὸς υἱός: ὃ γὰρ βασιλῆϊ χολωθεὶς
v9 : Verse
v9 = word [ [ Λ ⨾ η ] ⨾ [ τ ⨾ ο ⨾ ῦ ⨾ ς ] ]
   ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
   ∷ word [ [ Δ ⨾ ι ] ⨾ [ ὸ ⨾ ς ] ]
   ∷ word [ [ υ ⨾ ἱ ] ⨾ [ ό ⨾ ς{-:-} ] ]
   ∷ word [ [ ὃ ] ]
   ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
   ∷ word [ [ β ⨾ α ] ⨾ [ σ ⨾ ι ] ⨾ [ ƛ ⨾ ῆ ] ⨾ [ ϊ ] ]
   ∷ word [ [ χ ⨾ ο ] ⨾ [ ƛ ⨾ ω ] ⨾ [ θ ⨾ ε ⨾ ὶ ⨾ ς ] ]
   ∷ []

--
--
-- νοῦσον ἀνὰ στρατὸν ὄρσε κακήν, ὀλέκοντο δὲ λαοί,
v10 : Verse
v10 = word [ [ ν ⨾ ο ⨾ ῦ ] ⨾ [ σ ⨾ ο ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ὰ ] ]
    ∷ word [ [ σ ⨾ τ ⨾ ρ ⨾ α ] ⨾ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ ὄ ⨾ ρ ] ⨾ [ σ ⨾ ε ] ]
    ∷ word [ [ κ ⨾ α ] ⨾ [ κ ⨾ ή ⨾ ν ] ]
    ∷ word [ [ ὀ ] ⨾ [ ƛ ⨾ έ ] ⨾ [ κ ⨾ ο ] ⨾ [ ν ⨾ τ ⨾ ο ] ]
    ∷ word [ [ δ ⨾ ὲ ] ]
    ∷ word [ [ ƛ ⨾ α ] ⨾ [ ο ⨾ ί ] ]
    ∷ []

-- οὕνεκα τὸν Χρύσην ἠτίμασεν ἀρητῆρα
v11 : Verse
v11 = word [ [ ο ⨾ ὕ ] ⨾ [ ν ⨾ ε ] ⨾ [ κ ⨾ α ] ]
    ∷ word [ [ τ ⨾ ὸ ⨾ ν ] ]
    ∷ word [ [ Χ ⨾ ρ ⨾ ύ ] ⨾ [ σ ⨾ η ⨾ ν ] ]
    ∷ word [ [ ἠ ] ⨾ [ τ ⨾ ί ] ⨾ [ μ ⨾ α ] ⨾ [ σ ⨾ ε ⨾ ν ] ]
    ∷ word [ [ ἀ ] ⨾ [ ρ ⨾ η ] ⨾ [ τ ⨾ ῆ ] ⨾ [ ρ ⨾ α ] ]
    ∷ []

-- Ἀτρεΐδης: ὃ γὰρ ἦλθε θοὰς ἐπὶ νῆας Ἀχαιῶν
v12 : Verse
v12 = word [ [ Ἀ ] ⨾ [ τ ⨾ ρ ⨾ ε ] ⨾ [ ΐ ] ⨾ [ δ ⨾ η ⨾ ς{-:-} ] ]
    ∷ word [ [ ὃ ] ]
    ∷ word [ [ γ ⨾ ὰ ⨾ ρ ] ]
    ∷ word [ [ ἦ ⨾ ƛ ] ⨾ [ θ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ο ] ⨾ [ ὰ ⨾ ς ] ]
    ∷ word [ [ ἐ ] ⨾ [ π ⨾ ὶ ] ]
    ∷ word [ [ ν ⨾ ῆ ] ⨾ [ α ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ῶ ⨾ ν ] ]
    ∷ []

-- λυσόμενός τε θύγατρα φέρων τ᾽ ἀπερείσι᾽ ἄποινα,
v13 : Verse
v13 = word [ [ ƛ ⨾ υ ] ⨾ [ σ ⨾ ό ] ⨾ [ μ ⨾ ε ] ⨾ [ ν ⨾ ό ⨾ ς ] ]
    ∷ word [ [ τ ⨾ ε ] ]
    ∷ word [ [ θ ⨾ ύ ] ⨾ [ γ ⨾ α ] ⨾ [ τ ⨾ ρ ⨾ α ] ]
    ∷ word [ [ φ ⨾ έ ] ⨾ [ ρ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ τ{-᾽-} ⨾ ἀ ] ⨾ [ π ⨾ ε ] ⨾ [ ρ ⨾ ε ⨾ ί ] ⨾ [ σ ⨾ ι{-᾽-} ] ]
    ∷ word [ [ ἄ ] ⨾ [ π ⨾ ο ⨾ ι ] ⨾ [ ν ⨾ α{-,-} ] ]
    ∷ []

-- στέμματ᾽ ἔχων ἐν χερσὶν ἑκηβόλου Ἀπόλλωνος
v14 : Verse
v14 = word [ [ σ ⨾ τ ⨾ έ ⨾ μ ] ⨾ [ μ ⨾ α ⨾ τ{-᾽-} ] ]
    ∷ word [ [ ἔ ] ⨾ [ χ ⨾ ω ⨾ ν ] ]
    ∷ word [ [ ἐ ⨾ ν  ] ]
    ∷ word [ [ χ ⨾ ε ⨾ ρ ] ⨾ [ σ ⨾ ὶ ⨾ ν ] ]
    ∷ word [ [ ἑ ] ⨾ [ κ ⨾ η ] ⨾ [ β ⨾ ό ] ⨾ [ ƛ ⨾ ο ⨾ υ  ] ]
    ∷ word [ [ Ἀ ] ⨾ [ π ⨾ ό ⨾ ƛ ] ⨾ [ ƛ ⨾ ω ] ⨾ [ ν ⨾ ο ⨾ ς ] ]
    ∷ []

-- χρυσέῳ ἀνὰ σκήπτρῳ, καὶ λίσσετο πάντας Ἀχαιούς,
v15 : Verse
v15 = word [ [ χ ⨾ ρ ⨾ υ ] ⨾ [ σ ⨾ έ ] ⨾ [ ῳ ] ]
    ∷ word [ [ ἀ ] ⨾ [ ν ⨾ ὰ ] ]
    ∷ word [ [ σ ⨾ κ ⨾ ή ⨾ π ] ⨾ [ τ ⨾ ρ ⨾ ῳ{-,-}  ] ]
    ∷ word [ [ κ ⨾ α ⨾ ὶ ] ]
    ∷ word [ [ ƛ ⨾ ί ⨾ σ ] ⨾ [ σ ⨾ ε ] ⨾ [ τ ⨾ ο ] ]
    ∷ word [ [ π ⨾ ά ] ⨾ [ ν ⨾ τ ⨾ α ⨾ ς ] ]
    ∷ word [ [ Ἀ ] ⨾ [ χ ⨾ α ⨾ ι ] ⨾ [ ο ⨾ ύ ⨾ ς ] ]
    ∷ []
{-
Ἀτρεΐδα δὲ μάλιστα δύω, κοσμήτορε λαῶν:
Ἀτρεΐδαι τε καὶ ἄλλοι ἐϋκνήμιδες Ἀχαιοί,
ὑμῖν μὲν θεοὶ δοῖεν Ὀλύμπια δώματ᾽ ἔχοντες
ἐκπέρσαι Πριάμοιο πόλιν, εὖ δ᾽ οἴκαδ᾽ ἱκέσθαι:
παῖδα δ᾽ ἐμοὶ λύσαιτε φίλην, τὰ δ᾽ ἄποινα δέχεσθαι,
ἁζόμενοι Διὸς υἱὸν ἑκηβόλον Ἀπόλλωνα.

ἔνθ᾽ ἄλλοι μὲν πάντες ἐπευφήμησαν Ἀχαιοὶ
αἰδεῖσθαί θ᾽ ἱερῆα καὶ ἀγλαὰ δέχθαι ἄποινα:
ἀλλ᾽ οὐκ Ἀτρεΐδῃ Ἀγαμέμνονι ἥνδανε θυμῷ,
ἀλλὰ κακῶς ἀφίει, κρατερὸν δ᾽ ἐπὶ μῦθον ἔτελλε:
μή σε γέρον κοίλῃσιν ἐγὼ παρὰ νηυσὶ κιχείω
ἢ νῦν δηθύνοντ᾽ ἢ ὕστερον αὖτις ἰόντα,
μή νύ τοι οὐ χραίσμῃ σκῆπτρον καὶ στέμμα θεοῖο:
τὴν δ᾽ ἐγὼ οὐ λύσω: πρίν μιν καὶ γῆρας ἔπεισιν
ἡμετέρῳ ἐνὶ οἴκῳ ἐν Ἄργεϊ τηλόθι πάτρης
ἱστὸν ἐποιχομένην καὶ ἐμὸν λέχος ἀντιόωσαν:
ἀλλ᾽ ἴθι μή μ᾽ ἐρέθιζε σαώτερος ὥς κε νέηαι.--



...ἀνδρειφόντης... <--- most unmetrical line!!!
-}

verses : List (∃ λ n → Verse {n})
verses
  = {-(-, v1)
  ∷ -}(-, v2)
  ∷ (-, v3)
  ∷ (-, v4)
  ∷ (-, v5)
  ∷ (-, v6)
  ∷ (-, v7)
  ∷ (-, v8)
  ∷ (-, v9)
  ∷ (-, v10)
  ∷ (-, v11)
  ∷ (-, v12)
  ∷ (-, v13)
  ∷ (-, v14)
  ∷ (-, v15)
  ∷ []

-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
-- -}
